/*
#############################################################################################
# Smite (v3.24.3804.2) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: PlatformCommon_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function PlatformCommon.PComBrowserManager.OpenURL
// [0x00024400] ( FUNC_Native )
struct UPComBrowserManager_execOpenURL_Parms
{
	struct FString                                     URL;                                              		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bShowNavButtons : 1;                              		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bSetFocus : 1;                                    		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function PlatformCommon.PComGameEngine.HandlePlayerCommandInput
// [0x00024400] ( FUNC_Native )
struct UPComGameEngine_execHandlePlayerCommandInput_Parms
{
	struct FString                                     FSCommand;                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class APlayerController*                           PC;                                               		// 0x0010 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComGameEngine.SendGameRequest
// [0x00020400] ( FUNC_Native )
struct UPComGameEngine_execSendGameRequest_Parms
{
	struct FString                                     fsRequest;                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComGameEngine.SendCtrlRequest
// [0x00020400] ( FUNC_Native )
struct UPComGameEngine_execSendCtrlRequest_Parms
{
	struct FString                                     fsRequest;                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComGameEngine.SendMarshalAll
// [0x00020400] ( FUNC_Native )
struct UPComGameEngine_execSendMarshalAll_Parms
{
	unsigned long                                      bLowPriority : 1;                                 		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlatformCommon.PComGameEngine.SendMarshal
// [0x00020400] ( FUNC_Native )
struct UPComGameEngine_execSendMarshal_Parms
{
	struct FUniqueNetId                                qwPlayerId;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bLowPriority : 1;                                 		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlatformCommon.PComGameEngine.ClearMarshal
// [0x00020400] ( FUNC_Native )
struct UPComGameEngine_execClearMarshal_Parms
{
};

// Function PlatformCommon.PComGameEngine.SetFieldString
// [0x00020400] ( FUNC_Native )
struct UPComGameEngine_execSetFieldString_Parms
{
	int                                                nToken;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     StrValue;                                         		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComGameEngine.SetFieldFloat
// [0x00020400] ( FUNC_Native )
struct UPComGameEngine_execSetFieldFloat_Parms
{
	int                                                nToken;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              FloatValue;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComGameEngine.SetFieldInt
// [0x00020400] ( FUNC_Native )
struct UPComGameEngine_execSetFieldInt_Parms
{
	int                                                nToken;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                IntValue;                                         		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComGameEngine.SetFunction
// [0x00020400] ( FUNC_Native )
struct UPComGameEngine_execSetFunction_Parms
{
	int                                                nFunction;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComGameViewportClient.Init
// [0x00420802] ( FUNC_Event )
struct UPComGameViewportClient_eventInit_Parms
{
	struct FString                                     OutError;                                         		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComGameViewportClient.StartFacebookStreaming
// [0x00020202] ( FUNC_Exec )
struct UPComGameViewportClient_execStartFacebookStreaming_Parms
{
};

// Function PlatformCommon.PComGameViewportClient.StopRTMPStreaming
// [0x00020202] ( FUNC_Exec )
struct UPComGameViewportClient_execStopRTMPStreaming_Parms
{
};

// Function PlatformCommon.PComGameViewportClient.StartRTMPStreaming
// [0x00020202] ( FUNC_Exec )
struct UPComGameViewportClient_execStartRTMPStreaming_Parms
{
	struct FString                                     InServer;                                         		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     InKey;                                            		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComGameViewportClient.SetRTMPSettings
// [0x00820202] ( FUNC_Exec )
struct UPComGameViewportClient_execSetRTMPSettings_Parms
{
	unsigned long                                      bAllowWebcam : 1;                                 		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bAllowMicrophone : 1;                             		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bAllowDesktopAudio : 1;                           		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// struct FPComOpenBroadcasterSettings             NewSettings;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function PlatformCommon.PComGameViewportClient.CheckGameSettingsVersion
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPComGameViewportClient_execCheckGameSettingsVersion_Parms
{
};

// Function PlatformCommon.PComGameViewportClient.HandleGameSettingsMigration
// [0x00020400] ( FUNC_Native )
struct UPComGameViewportClient_execHandleGameSettingsMigration_Parms
{
	int                                                OldGameSettingsVersion;                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlatformCommon.PComGameViewportClient.GetCurrentGameSettingsVersion
// [0x00020400] ( FUNC_Native )
struct UPComGameViewportClient_execGetCurrentGameSettingsVersion_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComGameViewportClient.InitDynamicResolutionScaler
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPComGameViewportClient_execInitDynamicResolutionScaler_Parms
{
};

// Function PlatformCommon.PComImageDownloader.SetPComImageDownloadedDelegate
// [0x00020002] 
struct UPComImageDownloader_execSetPComImageDownloadedDelegate_Parms
{
	struct FScriptDelegate                             PComImageDownloadedDelegate;                      		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComImageDownloader.OnPComImageDownloaded
// [0x00120000] 
struct UPComImageDownloader_execOnPComImageDownloaded_Parms
{
	struct FPComImageDownload                          CachedEntry;                                      		// 0x0000 (0x0040) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComInputLightingEffect.IsLogitechSdkVersionValid
// [0x00020400] ( FUNC_Native )
struct UPComInputLightingEffect_execIsLogitechSdkVersionValid_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComInputLightingEffect.SetCurrentTime
// [0x00020400] ( FUNC_Native )
struct UPComInputLightingEffect_execSetCurrentTime_Parms
{
	struct FName                                       InPresetName;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              CurrentTime;                                      		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlatformCommon.PComInputLightingEffect.StopPreset
// [0x00020400] ( FUNC_Native )
struct UPComInputLightingEffect_execStopPreset_Parms
{
	struct FName                                       InPresetName;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlatformCommon.PComInputLightingEffect.PlayPreset
// [0x00024400] ( FUNC_Native )
struct UPComInputLightingEffect_execPlayPreset_Parms
{
	struct FName                                       InPresetName;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bUseOverrideStartTime : 1;                        		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	float                                              OverrideStartTime;                                		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function PlatformCommon.PComInputLightingEffect.DisableSystem
// [0x00020400] ( FUNC_Native )
struct UPComInputLightingEffect_execDisableSystem_Parms
{
};

// Function PlatformCommon.PComInputLightingEffect.TryEnableSystem
// [0x00020400] ( FUNC_Native )
struct UPComInputLightingEffect_execTryEnableSystem_Parms
{
};

// Function PlatformCommon.PComJsonHandler.OnImageDownloaded
// [0x00020400] ( FUNC_Native )
struct UPComJsonHandler_execOnImageDownloaded_Parms
{
	struct FPComImageDownload                          CachedEntry;                                      		// 0x0000 (0x0040) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComOpenBroadcaster.DecodeFacebookRTMPUrl
// [0x00020902] ( FUNC_Event )
struct UPComOpenBroadcaster_eventDecodeFacebookRTMPUrl_Parms
{
	struct FString                                     InRequest;                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UWebRequest*                                 ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UWebRequest*                              WebRequest;                                       		// 0x0018 (0x0008) [0x0000000000000000]              
};

// Function PlatformCommon.PComOpenBroadcaster.Tick
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPComOpenBroadcaster_execTick_Parms
{
};

// Function PlatformCommon.PComOpenBroadcaster.ForceStopStreaming
// [0x00020400] ( FUNC_Native )
struct UPComOpenBroadcaster_execForceStopStreaming_Parms
{
};

// Function PlatformCommon.PComOpenBroadcaster.StopStreaming
// [0x00020400] ( FUNC_Native )
struct UPComOpenBroadcaster_execStopStreaming_Parms
{
};

// Function PlatformCommon.PComOpenBroadcaster.StartRTMPStreaming
// [0x00020400] ( FUNC_Native )
struct UPComOpenBroadcaster_execStartRTMPStreaming_Parms
{
	struct FString                                     InServer;                                         		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     InKey;                                            		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComOpenBroadcaster.StartFacebookStreaming
// [0x00020400] ( FUNC_Native )
struct UPComOpenBroadcaster_execStartFacebookStreaming_Parms
{
};

// Function PlatformCommon.PComOpenBroadcaster.QueueFacebookStreaming
// [0x00020400] ( FUNC_Native )
struct UPComOpenBroadcaster_execQueueFacebookStreaming_Parms
{
};

// Function PlatformCommon.PComOpenBroadcaster.SetStreamSettings
// [0x00420400] ( FUNC_Native )
struct UPComOpenBroadcaster_execSetStreamSettings_Parms
{
	struct FPComOpenBroadcasterSettings                InSettings;                                       		// 0x0000 (0x0004) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
};

// Function PlatformCommon.PComOpenBroadcaster.IsStreaming
// [0x00020400] ( FUNC_Native )
struct UPComOpenBroadcaster_execIsStreaming_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComOpenBroadcaster.CloseWebBrowser
// [0x00120000] 
struct UPComOpenBroadcaster_execCloseWebBrowser_Parms
{
};

// Function PlatformCommon.PComOpenBroadcaster.OpenWebBrowser
// [0x00120000] 
struct UPComOpenBroadcaster_execOpenWebBrowser_Parms
{
	struct FString                                     URL;                                              		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComOpenBroadcaster.IsWebBrowserLoaded
// [0x00120000] 
struct UPComOpenBroadcaster_execIsWebBrowserLoaded_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComOpenBroadcaster.PreloadWebBrowser
// [0x00120000] 
struct UPComOpenBroadcaster_execPreloadWebBrowser_Parms
{
};

// Function PlatformCommon.PComPerformanceCaptureBase.CreateFileAndExit
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPComPerformanceCaptureBase_execCreateFileAndExit_Parms
{
	struct FString                                     FileNameWithExtension;                            		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     FileContents;                                     		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     SubfolderName;                                    		// 0x0020 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComPerformanceCaptureBase.GetPerfStats
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UPComPerformanceCaptureBase_execGetPerfStats_Parms
{
	TArray< struct FPComPerformanceCaptureStat >       PerfStats;                                        		// 0x0000 (0x0010) [0x0000000000400082]              ( CPF_Const | CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     FileContents;                                     		// 0x0010 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComPerformanceCaptureBase.GetStatsToCollect
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UPComPerformanceCaptureBase_execGetStatsToCollect_Parms
{
	struct FString                                     FileContents;                                     		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComPerformanceCaptureBase.GetMapNameAndTime
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UPComPerformanceCaptureBase_execGetMapNameAndTime_Parms
{
	struct FString                                     MapNameStr;                                       		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FString                                     FormattedDate;                                    		// 0x0010 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FString                                     FormattedTime;                                    		// 0x0020 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComPerformanceCaptureBase.StopCycleStats
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UPComPerformanceCaptureBase_execStopCycleStats_Parms
{
	TArray< struct FPComPerformanceCaptureStat >       PerfStats;                                        		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComPerformanceCaptureBase.GetPerformanceData
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UPComPerformanceCaptureBase_execGetPerformanceData_Parms
{
	TArray< struct FPComPerformanceCaptureStat >       PerfStats;                                        		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComPerformanceCaptureBase.EnableStatNotify
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPComPerformanceCaptureBase_execEnableStatNotify_Parms
{
};

// Function PlatformCommon.PComPerformanceCaptureBase.EnableNonCycleStats
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPComPerformanceCaptureBase_execEnableNonCycleStats_Parms
{
};

// Function PlatformCommon.PComPerformanceCaptureBase.MoveCamera
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPComPerformanceCaptureBase_execMoveCamera_Parms
{
	class APlayerController*                           PlayerController;                                 		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Node;                                             		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlatformCommon.PComPerformanceCaptureBase.InitializePerformanceCaptureSettings
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPComPerformanceCaptureBase_execInitializePerformanceCaptureSettings_Parms
{
};

// Function PlatformCommon.PComPerformanceCaptureGame.DoNextAction
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct APComPerformanceCaptureGame_execDoNextAction_Parms
{
};

// Function PlatformCommon.PComPerformanceCaptureGame.CollectNodes
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct APComPerformanceCaptureGame_execCollectNodes_Parms
{
};

// Function PlatformCommon.PComPerformanceCaptureGame.PostBeginPlay
// [0x00020802] ( FUNC_Event )
struct APComPerformanceCaptureGame_eventPostBeginPlay_Parms
{
};

// Function PlatformCommon.PComPictureInPicture.TestPictureInPicture
// [0x00820002] 
struct UPComPictureInPicture_execTestPictureInPicture_Parms
{
	// class AWorldInfo*                               WorldInfo;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	// class APlayerController*                        PlayerController;                                 		// 0x0008 (0x0008) [0x0000000000000000]              
	// class ULocalPlayer*                             LocalPlayer;                                      		// 0x0010 (0x0008) [0x0000000000000000]              
	// struct FPComPipViewDesc                         ViewDesc;                                         		// 0x0018 (0x01E4) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function PlatformCommon.PComPictureInPicture.DebugRender
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPComPictureInPicture_execDebugRender_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlatformCommon.PComPictureInPicture.IsViewDescReady
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UPComPictureInPicture_execIsViewDescReady_Parms
{
	struct FPComPipViewDesc                            ViewDesc;                                         		// 0x0000 (0x01E4) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x01E4 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComPictureInPicture.IsViewReady
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPComPictureInPicture_execIsViewReady_Parms
{
	struct FName                                       ViewName;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComPictureInPicture.RequestRender
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPComPictureInPicture_execRequestRender_Parms
{
	struct FName                                       ViewName;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlatformCommon.PComPictureInPicture.RemoveView
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPComPictureInPicture_execRemoveView_Parms
{
	struct FName                                       ViewName;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlatformCommon.PComPictureInPicture.AddView
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UPComPictureInPicture_execAddView_Parms
{
	struct FPComPipViewDesc                            InViewDesc;                                       		// 0x0000 (0x01E4) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComPictureInPicture.Tick
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPComPictureInPicture_execTick_Parms
{
};

// Function PlatformCommon.PComPictureInPicture.InitializeRenderTarget
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPComPictureInPicture_execInitializeRenderTarget_Parms
{
};

// Function PlatformCommon.PComPictureInPictureScene.SetSkyColor
// [0x00420400] ( FUNC_Native )
struct UPComPictureInPictureScene_execSetSkyColor_Parms
{
	struct FColor                                      InSkyColor;                                       		// 0x0000 (0x0004) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
};

// Function PlatformCommon.PComPictureInPictureScene.SetSkyBrightness
// [0x00020400] ( FUNC_Native )
struct UPComPictureInPictureScene_execSetSkyBrightness_Parms
{
	float                                              InSkyBrightness;                                  		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlatformCommon.PComPictureInPictureScene.SetBounceLightColor
// [0x00420400] ( FUNC_Native )
struct UPComPictureInPictureScene_execSetBounceLightColor_Parms
{
	struct FColor                                      LightColor;                                       		// 0x0000 (0x0004) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
};

// Function PlatformCommon.PComPictureInPictureScene.SetBounceLightBrightness
// [0x00020400] ( FUNC_Native )
struct UPComPictureInPictureScene_execSetBounceLightBrightness_Parms
{
	float                                              InLightBrightness;                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlatformCommon.PComPictureInPictureScene.SetBounceLightDirection
// [0x00420400] ( FUNC_Native )
struct UPComPictureInPictureScene_execSetBounceLightDirection_Parms
{
	struct FRotator                                    InLightDir;                                       		// 0x0000 (0x000C) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
};

// Function PlatformCommon.PComPictureInPictureScene.EnableDirectionalBounceLight
// [0x00024400] ( FUNC_Native )
struct UPComPictureInPictureScene_execEnableDirectionalBounceLight_Parms
{
	unsigned long                                      bInEnableBoundLight : 1;                          		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	float                                              InBounceLightBrightness;                          		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FRotator                                    BounceLightDir;                                   		// 0x0008 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function PlatformCommon.PComPictureInPictureScene.SetLightColor
// [0x00420400] ( FUNC_Native )
struct UPComPictureInPictureScene_execSetLightColor_Parms
{
	struct FColor                                      LightColor;                                       		// 0x0000 (0x0004) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
};

// Function PlatformCommon.PComPictureInPictureScene.SetLightBrightness
// [0x00020400] ( FUNC_Native )
struct UPComPictureInPictureScene_execSetLightBrightness_Parms
{
	float                                              InLightBrightness;                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlatformCommon.PComPictureInPictureScene.SetLightDirection
// [0x00420400] ( FUNC_Native )
struct UPComPictureInPictureScene_execSetLightDirection_Parms
{
	struct FRotator                                    InLightDir;                                       		// 0x0000 (0x000C) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
};

// Function PlatformCommon.PComPictureInPictureScene.GetLightDirection
// [0x00020400] ( FUNC_Native )
struct UPComPictureInPictureScene_execGetLightDirection_Parms
{
	struct FRotator                                    ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComPictureInPictureScene.RemoveComponent
// [0x00020400] ( FUNC_Native )
struct UPComPictureInPictureScene_execRemoveComponent_Parms
{
	class UActorComponent*                             Component;                                        		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function PlatformCommon.PComPictureInPictureScene.AddComponent
// [0x00420400] ( FUNC_Native )
struct UPComPictureInPictureScene_execAddComponent_Parms
{
	class UActorComponent*                             Component;                                        		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FMatrix                                     LocalToWorld;                                     		// 0x0010 (0x0040) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
};

// Function PlatformCommon.PComPictureInPictureScene.InitScene
// [0x00020400] ( FUNC_Native )
struct UPComPictureInPictureScene_execInitScene_Parms
{
};

// Function PlatformCommon.PComPlayerController.PlayTestInputLightingEffect
// [0x00020A02] ( FUNC_Exec | FUNC_Event )
struct APComPlayerController_execPlayTestInputLightingEffect_Parms
{
	struct FName                                       InPresetName;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlatformCommon.PComPlayerController.SetCurrentTimeForInputLightingEffect
// [0x00020400] ( FUNC_Native )
struct APComPlayerController_execSetCurrentTimeForInputLightingEffect_Parms
{
	struct FName                                       InPresetName;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              InCurrentTime;                                    		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlatformCommon.PComPlayerController.StopInputLightingEffect
// [0x00020400] ( FUNC_Native )
struct APComPlayerController_execStopInputLightingEffect_Parms
{
	struct FName                                       InPresetName;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlatformCommon.PComPlayerController.PlayInputLightingEffect
// [0x00024400] ( FUNC_Native )
struct APComPlayerController_execPlayInputLightingEffect_Parms
{
	struct FName                                       InPresetName;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bUseOverrideStartTime : 1;                        		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	float                                              OverrideStartTime;                                		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function PlatformCommon.PComPlayerController.ClientPlayInputLightingEffect
// [0x010249C2] ( FUNC_Event )
struct APComPlayerController_eventClientPlayInputLightingEffect_Parms
{
	struct FName                                       InPresetName;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bUseOverrideStartTime : 1;                        		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	float                                              OverrideStartTime;                                		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function PlatformCommon.PComPlayerController.TryAutoLogin
// [0x00020400] ( FUNC_Native )
struct APComPlayerController_execTryAutoLogin_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComPlayerController.TryAutoLoginDelayed
// [0x00020802] ( FUNC_Event )
struct APComPlayerController_eventTryAutoLoginDelayed_Parms
{
};

// Function PlatformCommon.PComPlayerController.SetAsNewPartyHost
// [0x00020902] ( FUNC_Event )
struct APComPlayerController_eventSetAsNewPartyHost_Parms
{
	// class UOnlineGameSettings*                      GS;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.ToggleGameSessionInvitesAllowed
// [0x00020902] ( FUNC_Event )
struct APComPlayerController_eventToggleGameSessionInvitesAllowed_Parms
{
	unsigned long                                      bAllowed : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// class UOnlineGameSettings*                      GS;                                               		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.TogglePartySessionInvitesAllowed
// [0x00020902] ( FUNC_Event )
struct APComPlayerController_eventTogglePartySessionInvitesAllowed_Parms
{
	unsigned long                                      bAllowed : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// class UOnlineGameSettings*                      GS;                                               		// 0x0004 (0x0008) [0x0000000000000000]              
	// unsigned long                                   bInCustomQueue : 1;                               		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function PlatformCommon.PComPlayerController.UpdateMCTSWithNewPartyInfo
// [0x00020902] ( FUNC_Event )
struct APComPlayerController_eventUpdateMCTSWithNewPartyInfo_Parms
{
	// class UOnlineGameSettings*                      GS;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// unsigned long                                   bIsHost : 1;                                      		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FString                                  SessionGuid;                                      		// 0x000C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function PlatformCommon.PComPlayerController.IsHostOfParty
// [0x00020902] ( FUNC_Event )
struct APComPlayerController_eventIsHostOfParty_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComPlayerController.OnPeoplePickerComplete
// [0x00820002] 
struct APComPlayerController_execOnPeoplePickerComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	TArray< struct FOnlineFriend >                     PeoplePicked;                                     		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             I;                                                		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FUniqueNetId                             ZeroId;                                           		// 0x0018 (0x0008) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.OnReadFriendsListComplete
// [0x00020002] 
struct APComPlayerController_execOnReadFriendsListComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// TArray< struct FOnlineFriend >                  FriendsList;                                      		// 0x0004 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned char                                   LocalUserNum;                                     		// 0x0014 (0x0001) [0x0000000000000000]              
	// struct FString                                  PeoplePickerText;                                 		// 0x0018 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             OpenPartySlots;                                   		// 0x0028 (0x0004) [0x0000000000000000]              
	// TArray< struct FSessionMemberInfo >             SessionMemberList;                                		// 0x002C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function PlatformCommon.PComPlayerController.ShowPeoplePickerUI
// [0x00020B02] ( FUNC_Exec | FUNC_Event )
struct APComPlayerController_execShowPeoplePickerUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned char                                   LocalUserNum;                                     		// 0x0004 (0x0001) [0x0000000000000000]              
	// TArray< struct FSessionMemberInfo >             SessionMemberList;                                		// 0x0008 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             OpenPartySlots;                                   		// 0x0018 (0x0004) [0x0000000000000000]              
	// TArray< struct FOnlineFriend >                  FriendsList;                                      		// 0x001C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function PlatformCommon.PComPlayerController.JoinCustomMatchForInviteDelay
// [0x00020002] 
struct APComPlayerController_execJoinCustomMatchForInviteDelay_Parms
{
	// class UOnlineGameSettings*                      GS;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.JoinCustomMatchFromInvite
// [0x00020802] ( FUNC_Event )
struct APComPlayerController_eventJoinCustomMatchFromInvite_Parms
{
};

// Function PlatformCommon.PComPlayerController.OnJoinSessionForReceivedInviteComplete
// [0x00020102] 
struct APComPlayerController_execOnJoinSessionForReceivedInviteComplete_Parms
{
	struct FName                                       SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlatformCommon.PComPlayerController.OnPrivilegeCheckForGameSessionJoin
// [0x00820102] 
struct APComPlayerController_execOnPrivilegeCheckForGameSessionJoin_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      Privilege;                                        		// 0x0001 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      PrivilegeLevel;                                   		// 0x0002 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bDiffersFromHint : 1;                             		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// struct FOnlineGameSearchResult                  EmptyResult;                                      		// 0x0008 (0x0010) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.OnPrivilegeLevelCheckedCompleteForPartyJoin
// [0x00820102] 
struct APComPlayerController_execOnPrivilegeLevelCheckedCompleteForPartyJoin_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      Privilege;                                        		// 0x0001 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      PrivilegeLevel;                                   		// 0x0002 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bDiffersFromHint : 1;                             		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// struct FOnlineGameSearchResult                  EmptyResult;                                      		// 0x0008 (0x0010) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.OnGameDestroyedForPartyJoin
// [0x00020102] 
struct APComPlayerController_execOnGameDestroyedForPartyJoin_Parms
{
	struct FName                                       SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// unsigned char                                   Hint;                                             		// 0x000C (0x0001) [0x0000000000000000]              
	// int                                             InvitedPlayerControllerId;                        		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.OnAlternatePrivilegeLevelCheckedComplete
// [0x00020102] 
struct APComPlayerController_execOnAlternatePrivilegeLevelCheckedComplete_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      Privilege;                                        		// 0x0001 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      PrivilegeLevel;                                   		// 0x0002 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bDiffersFromHint : 1;                             		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlatformCommon.PComPlayerController.OnGameInviteAccepted
// [0x00420102] 
struct APComPlayerController_execOnGameInviteAccepted_Parms
{
	struct FOnlineGameSearchResult                     InviteResult;                                     		// 0x0000 (0x0010) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
	// unsigned long                                   bPartySession : 1;                                		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FName                                    SessionName;                                      		// 0x0014 (0x0008) [0x0000000000000000]              
	// class UOnlineGameSettings*                      GS;                                               		// 0x001C (0x0008) [0x0000000000000000]              
	// unsigned char                                   Hint;                                             		// 0x0024 (0x0001) [0x0000000000000000]              
	// int                                             InvitedPlayerControllerId;                        		// 0x0028 (0x0004) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.JoinPartySession
// [0x00020802] ( FUNC_Event )
struct APComPlayerController_eventJoinPartySession_Parms
{
	unsigned char                                      PartySessionGuid[ 0x50 ];                         		// 0x0000 (0x0050) [0x0000000000000080]              ( CPF_Parm )
	// class UOnlineGameSearch*                        NewGameSearch;                                    		// 0x0050 (0x0008) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.OnPartySessionDestroyed
// [0x00020902] ( FUNC_Event )
struct APComPlayerController_eventOnPartySessionDestroyed_Parms
{
	struct FName                                       SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlatformCommon.PComPlayerController.DestroyPartySession
// [0x00020B02] ( FUNC_Exec | FUNC_Event )
struct APComPlayerController_execDestroyPartySession_Parms
{
};

// Function PlatformCommon.PComPlayerController.InvitePlayerToParty
// [0x00020802] ( FUNC_Event )
struct APComPlayerController_eventInvitePlayerToParty_Parms
{
	struct FUniqueNetId                                InPlayerId;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComPlayerController.InvitePlayerToPartyByName
// [0x00820802] ( FUNC_Event )
struct APComPlayerController_eventInvitePlayerToPartyByName_Parms
{
	struct FString                                     InPlayerName;                                     		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FUniqueNetId                             IgnoredId;                                        		// 0x0014 (0x0008) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.OnCreatePartySessionComplete
// [0x00020102] 
struct APComPlayerController_execOnCreatePartySessionComplete_Parms
{
	struct FName                                       SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSuccessful : 1;                                  		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlatformCommon.PComPlayerController.CreatePartySession
// [0x00020B02] ( FUNC_Exec | FUNC_Event )
struct APComPlayerController_execCreatePartySession_Parms
{
	// class UOnlineGameSettings*                      NewGameSettings;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.UnregisterP2PEnemiesForCustomMatch
// [0x00020802] ( FUNC_Event )
struct APComPlayerController_eventUnregisterP2PEnemiesForCustomMatch_Parms
{
	TArray< struct FUniqueNetId >                      EnemyIds;                                         		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.OnGetVoicePermissionsForUsersComplete
// [0x00020102] 
struct APComPlayerController_execOnGetVoicePermissionsForUsersComplete_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      Privilege;                                        		// 0x0001 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FPermissionsResult >                Results;                                          		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// TArray< struct FSessionMemberInfo >             SessionListInfo;                                  		// 0x0014 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             I;                                                		// 0x0024 (0x0004) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.OnGetSessionMemberInfoComplete
// [0x00020102] 
struct APComPlayerController_execOnGetSessionMemberInfoComplete_Parms
{
	TArray< struct FSessionMemberInfo >                SessionListInfo;                                  		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlatformCommon.PComPlayerController.OnGetUserConnectionInfoComplete
// [0x00020102] 
struct APComPlayerController_execOnGetUserConnectionInfoComplete_Parms
{
	TArray< struct FSessionMemberInfo >                SessionListInfo;                                  		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlatformCommon.PComPlayerController.GetUserNamesForPS4P2PConnections
// [0x00020500] ( FUNC_Native )
struct APComPlayerController_execGetUserNamesForPS4P2PConnections_Parms
{
	TArray< struct FString >                           ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComPlayerController.CloseConnectionsToInvalidPeers
// [0x00020500] ( FUNC_Native )
struct APComPlayerController_execCloseConnectionsToInvalidPeers_Parms
{
	TArray< struct FSessionMemberInfo >                SessionListInfo;                                  		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PlatformCommon.PComPlayerController.EstablishPeers
// [0x00020B02] ( FUNC_Exec | FUNC_Event )
struct APComPlayerController_execEstablishPeers_Parms
{
};

// Function PlatformCommon.PComPlayerController.LostP2PConnection
// [0x00020902] ( FUNC_Event )
struct APComPlayerController_eventLostP2PConnection_Parms
{
	struct FUniqueNetId                                UniqueId;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlatformCommon.PComPlayerController.GetControllerIdFromNetId
// [0x00420802] ( FUNC_Event )
struct APComPlayerController_eventGetControllerIdFromNetId_Parms
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ControllerId;                                     		// 0x0008 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function PlatformCommon.PComPlayerController.PairLoggedInUserAndCurrentController
// [0x00020802] ( FUNC_Event )
struct APComPlayerController_eventPairLoggedInUserAndCurrentController_Parms
{
	// class ULocalPlayer*                             LP;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// int                                             LoggedInPlayerIndex;                              		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.IsInGame
// [0x00020400] ( FUNC_Native )
struct APComPlayerController_execIsInGame_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComPlayerController.IsPackageInstalled
// [0x00020400] ( FUNC_Native )
struct APComPlayerController_execIsPackageInstalled_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComPlayerController.OnMultiplayerSessionChange
// [0x00020002] 
struct APComPlayerController_execOnMultiplayerSessionChange_Parms
{
	struct FName                                       SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FSessionUpdateInfo                          SessionChanges;                                   		// 0x0008 (0x0024) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// TArray< struct FSessionMemberInfo >             JoinedMembers;                                    		// 0x002C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             I;                                                		// 0x003C (0x0004) [0x0000000000000000]              
	// unsigned long                                   bRecreateSession : 1;                             		// 0x0040 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UOnlineGameSettings*                      GS;                                               		// 0x0044 (0x0008) [0x0000000000000000]              
};

// Function PlatformCommon.PComPlayerController.CheckFilterText
// [0x00020802] ( FUNC_Event )
struct APComPlayerController_eventCheckFilterText_Parms
{
	struct FString                                     Text;                                             		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComPlayerController.CanPlayOnlineWithUsersByUniqueNetIds
// [0x00020802] ( FUNC_Event )
struct APComPlayerController_eventCanPlayOnlineWithUsersByUniqueNetIds_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FUniqueNetId >                      Users;                                            		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComPlayerController.CanCommunicateTextWithUsersByUniqueNetIds
// [0x00020802] ( FUNC_Event )
struct APComPlayerController_eventCanCommunicateTextWithUsersByUniqueNetIds_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FUniqueNetId >                      Users;                                            		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComPlayerController.CanCommunicateText
// [0x00424802] ( FUNC_Event )
struct APComPlayerController_eventCanCommunicateText_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      PrivilegeLevelHint;                               		// 0x0001 (0x0001) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      bAttemptToResolve : 1;                            		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	struct FString                                     Reason;                                           		// 0x0008 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlatformCommon.PComPlayerController.OnTextFilterApplied
// [0x00020400] ( FUNC_Native )
struct APComPlayerController_execOnTextFilterApplied_Parms
{
	struct FString                                     OriginalText;                                     		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     FilteredText;                                     		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bCensorCompletely : 1;                            		// 0x0020 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlatformCommon.PComPlayerController.RequestUpdateFriendsList
// [0x00024400] ( FUNC_Native )
struct APComPlayerController_execRequestUpdateFriendsList_Parms
{
	unsigned long                                      bForceRequest : 1;                                		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function PlatformCommon.PComPlayerController.UpdateMctsWithFriends
// [0x00020400] ( FUNC_Native )
struct APComPlayerController_execUpdateMctsWithFriends_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

