/*
#############################################################################################
# Smite (v3.24.3804.2) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TgClient_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_DCCLAN_MAX_MEMBERS                                 1000
#define CONST_CLAN_RANK_GROUP                                    96
#define CONST_MAX_BROWSER_TEXTURES                               12
#define CONST_RATATOSKR_BOT_ID                                   2063
#define CONST_RATATOSKR_ACORN_DEVICE_ID                          18703
#define CONST_RECOMMEND_ITEM_CATEGORY_STARTER                    10772
#define CONST_STORE_HEAD_COUNT                                   4
#define CONST_STORE_LIST_COUNT                                   12

// Enum TgClient.TgGfxPartyManagement.PartyManagementActions
/*enum PartyManagementActions
{
	PMA_None                                           = 0,
	PMA_SelectTab                                      = 1,
	PMA_Search                                         = 2,
	PMA_Invite                                         = 3,
	PMA_ViewProfile                                    = 4,
	PMA_PromoteLeader                                  = 5,
	PMA_PromoteInvite                                  = 6,
	PMA_Kick                                           = 7,
	PMA_Leave                                          = 8,
	PMA_UpdateInviteList                               = 9,
	PMA_InviteListToggle                               = 10,
	PMA_UpdateTab                                      = 11,
	PMA_UpdateInviteListDisabled                       = 12,
	PMA_MAX                                            = 13
};*/

// Enum TgClient.TgGfxPlayerProfile.EPlayerProfileFilter
/*enum EPlayerProfileFilter
{
	PPF_YOURSELF                                       = 0,
	PPF_FRIENDS                                        = 1,
	PPF_CLAN                                           = 2,
	PPF_RECENTLY_PLAYED                                = 3,
	PPF_MAX                                            = 4
};*/

// Enum TgClient.TgGfxPlayerProfile.EPlayerProfileTab
/*enum EPlayerProfileTab
{
	PPT_OVERVIEW                                       = 0,
	PPT_MATCHES                                        = 1,
	PPT_GODS                                           = 2,
	PPT_RECORDS                                        = 3,
	PPT_MAX                                            = 4
};*/

// Enum TgClient.TgGfxProfileWorshiper.EGodMasteryFilter
/*enum EGodMasteryFilter
{
	GMS_ALL                                            = 0,
	GMS_MASTERED                                       = 1,
	GMS_IN_PROGRESS                                    = 2,
	GMS_NOT_MASTERED                                   = 3,
	GMS_NOT_PLAYED                                     = 4,
	GMS_MAX                                            = 5
};*/

// Enum TgClient.TgGfxRacerDispatcher.TgRacerDispatcherEvent
/*enum TgRacerDispatcherEvent
{
	TGRDE_PlacementChange                              = 0,
	TGRDE_WeaponChange                                 = 1,
	TGRDE_LapChange                                    = 2,
	TGRDE_MAX                                          = 3
};*/

// Enum TgClient.TgGfxStoreChestPC.EStoreChestPCActions
/*enum EStoreChestPCActions
{
	ESCPCA_None                                        = 0,
	ESCPCA_ItemUnlock                                  = 1,
	ESCPCA_RefreshItems                                = 2,
	ESCPCA_ChestIndex                                  = 3,
	ESCPCA_MAX                                         = 4
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class TgClient.TgGameLaunch
// 0x0000 (0x04D0 - 0x04D0)
class ATgGameLaunch : public ATgGameLaunchBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5130 );

		return pClassPointer;
	};

};

UClass* ATgGameLaunch::pClassPointer = NULL;

// Class TgClient.TgGameViewportClient
// 0x0000 (0x01D8 - 0x01D8)
class UTgGameViewportClient : public UTgGameViewportClientBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5131 );

		return pClassPointer;
	};

};

UClass* UTgGameViewportClient::pClassPointer = NULL;

// Class TgClient.TgGfxAchievementPopup
// 0x0000 (0x0284 - 0x0284)
class UTgGfxAchievementPopup : public UTgGfxScene
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5132 );

		return pClassPointer;
	};

	void eventQueueAchievement ( );
	void asc_QueueAchievement ( );
	void Initialize ( class UTgMoviePlayer* pMoviePlayer );
};

UClass* UTgGfxAchievementPopup::pClassPointer = NULL;

// Class TgClient.TgGfxAchievementSelection
// 0x0014 (0x0298 - 0x0284)
class UTgGfxAchievementSelection : public UTgGfxScene
{
public:
	int                                                m_requestedPlayerId;                              		// 0x0284 (0x0004) [0x0000000000000000]              
	struct FScriptDelegate                             __USC_ApplySelections_Delegate__Delegate;         		// 0x0288 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x028C (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5133 );

		return pClassPointer;
	};

	void eventUpdateSelectedAchievements ( );
	void ASC_UpdateSelectedAchievements ( );
	void eventUpdateScreen ( );
	void ASC_UpdateScreen ( );
	void USC_ApplySelections ( int as1, int as2, int as3, int as4 );
	void USC_ApplySelections_Delegate ( int as1, int as2, int as3, int as4 );
	void Uninitialize ( );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxAchievementSelection::pClassPointer = NULL;

// Class TgClient.TgGfxAdventureProgress
// 0x0008 (0x028C - 0x0284)
class UTgGfxAdventureProgress : public UTgGfxScene
{
public:
	int                                                m_nActivityId;                                    		// 0x0284 (0x0004) [0x0000000000000000]              
	int                                                m_nVictoryLaps;                                   		// 0x0288 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5134 );

		return pClassPointer;
	};

	void OnAcquisition ( class UTgEventDataItem* pEvent );
	void Uninitialize ( );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxAdventureProgress::pClassPointer = NULL;

// Class TgClient.TgGfxAdventureProgressDungeon2
// 0x0014 (0x0298 - 0x0284)
class UTgGfxAdventureProgressDungeon2 : public UTgGfxScene
{
public:
	int                                                m_nActivityId;                                    		// 0x0284 (0x0004) [0x0000000000000000]              
	int                                                m_nBundleId;                                      		// 0x0288 (0x0004) [0x0000000000000000]              
	int                                                m_nStatueActivityId;                              		// 0x028C (0x0004) [0x0000000000000000]              
	int                                                m_nStatueGoalId;                                  		// 0x0290 (0x0004) [0x0000000000000000]              
	int                                                m_nStatueCompleteGoalId;                          		// 0x0294 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5135 );

		return pClassPointer;
	};

	void OnAcquisition ( class UTgEventDataItem* pEvent );
	void Uninitialize ( );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxAdventureProgressDungeon2::pClassPointer = NULL;

// Class TgClient.TgGfxAdventureProgressFox
// 0x0034 (0x02B8 - 0x0284)
class UTgGfxAdventureProgressFox : public UTgGfxScene
{
public:
	int                                                m_nActivityId;                                    		// 0x0284 (0x0004) [0x0000000000000000]              
	int                                                m_nBundleId;                                      		// 0x0288 (0x0004) [0x0000000000000000]              
	int                                                m_nChestItemId;                                   		// 0x028C (0x0004) [0x0000000000000000]              
	int                                                m_nPointBundleId;                                 		// 0x0290 (0x0004) [0x0000000000000000]              
	int                                                m_nFox1LTI;                                       		// 0x0294 (0x0004) [0x0000000000000000]              
	int                                                m_nFox2LTI;                                       		// 0x0298 (0x0004) [0x0000000000000000]              
	int                                                m_nFox3LTI;                                       		// 0x029C (0x0004) [0x0000000000000000]              
	int                                                m_nFox4LTI;                                       		// 0x02A0 (0x0004) [0x0000000000000000]              
	int                                                m_nFox1ItemId;                                    		// 0x02A4 (0x0004) [0x0000000000000000]              
	int                                                m_nFox2ItemId;                                    		// 0x02A8 (0x0004) [0x0000000000000000]              
	int                                                m_nFox3ItemId;                                    		// 0x02AC (0x0004) [0x0000000000000000]              
	int                                                m_nFox4ItemId;                                    		// 0x02B0 (0x0004) [0x0000000000000000]              
	unsigned long                                      b_chestPurchaseLock : 1;                          		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      b_requestedChestPurchase : 1;                     		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5136 );

		return pClassPointer;
	};

	void OnAcquisition ( class UTgEventDataItem* pEvent );
	void SetupChestPurchaseFox ( );
	void Uninitialize ( );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxAdventureProgressFox::pClassPointer = NULL;

// Class TgClient.TgGfxAdventureProgressMMO
// 0x0008 (0x028C - 0x0284)
class UTgGfxAdventureProgressMMO : public UTgGfxScene
{
public:
	int                                                m_nActivityId;                                    		// 0x0284 (0x0004) [0x0000000000000000]              
	int                                                m_nBundleId;                                      		// 0x0288 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5137 );

		return pClassPointer;
	};

	void OnAcquisition ( class UTgEventDataItem* pEvent );
	void Uninitialize ( );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxAdventureProgressMMO::pClassPointer = NULL;

// Class TgClient.TgGfxAdventuresHub
// 0x0074 (0x02F8 - 0x0284)
class UTgGfxAdventuresHub : public UTgGfxScene
{
public:
	int                                                m_nBundleId;                                      		// 0x0284 (0x0004) [0x0000000000000000]              
	int                                                m_nChestItemId;                                   		// 0x0288 (0x0004) [0x0000000000000000]              
	int                                                m_nPointBundleLTI;                                		// 0x028C (0x0004) [0x0000000000000000]              
	unsigned long                                      b_chestPurchaseLock : 1;                          		// 0x0290 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      b_requestedChestPurchase : 1;                     		// 0x0290 (0x0004) [0x0000000000000000] [0x00000002] 
	int                                                m_nCurrentQueueId;                                		// 0x0294 (0x0004) [0x0000000000000000]              
	int                                                m_nChestLTI;                                      		// 0x0298 (0x0004) [0x0000000000000000]              
	int                                                m_nPointLTI;                                      		// 0x029C (0x0004) [0x0000000000000000]              
	int                                                m_nItemLTI1;                                      		// 0x02A0 (0x0004) [0x0000000000000000]              
	int                                                m_nItemLTI2;                                      		// 0x02A4 (0x0004) [0x0000000000000000]              
	int                                                m_nItemLTI3;                                      		// 0x02A8 (0x0004) [0x0000000000000000]              
	int                                                m_nItemLTI4;                                      		// 0x02AC (0x0004) [0x0000000000000000]              
	int                                                m_nCurrentAdventureItem;                          		// 0x02B0 (0x0004) [0x0000000000000000]              
	int                                                m_nActivityId;                                    		// 0x02B4 (0x0004) [0x0000000000000000]              
	struct FScriptDelegate                             __USC_SetUserViewedEvent_Delegate__Delegate;      		// 0x02B8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x02BC (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __USC_GetAdventureLeaderboard_Delegate__Delegate; 		// 0x02C8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x02CC (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __USC_GotoVault_Delegate__Delegate;               		// 0x02D8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData02[ 0x4 ];                             		// 0x02DC (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __USC_OpenEventCam_Delegate__Delegate;            		// 0x02E8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData03[ 0x4 ];                             		// 0x02EC (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5138 );

		return pClassPointer;
	};

	void eventSceneTick ( float Delta );
	void OnAcquisition ( class UTgEventDataItem* pEvent );
	void SetBundleOwnership ( );
	void TriggerLobbyEventHub ( int nType, int nTarget );
	void TriggerLobbyCamEvent ( int nType, int nTarget );
	void Uninitialize ( );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Initialize ( class UTgMoviePlayer* theMovie );
	void LeaveQueue ( );
	void PopulateGoalData ( );
	void USC_OpenEventCam ( unsigned long isSmall );
	void USC_GotoVault ( unsigned long bIsSmall );
	void USC_SetUserViewedEvent ( );
	void USC_GetAdventureLeaderboard ( int nEventId );
	void USC_OpenEventCam_Delegate ( );
	void USC_GotoVault_Delegate ( );
	void USC_GetAdventureLeaderboard_Delegate ( );
	void USC_SetUserViewedEvent_Delegate ( );
};

UClass* UTgGfxAdventuresHub::pClassPointer = NULL;

// Class TgClient.TgGfxBooster
// 0x0010 (0x0294 - 0x0284)
class UTgGfxBooster : public UTgGfxScene
{
public:
	struct FScriptDelegate                             __USC_ShowPurchasePopup_Delegate__Delegate;       		// 0x0284 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0288 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5139 );

		return pClassPointer;
	};

	void UpdateBoosterTime ( );
	void USC_ShowPurchasePopup ( int ItemId, int nQuantity );
	void USC_ShowPurchasePopup_Delegate ( int ItemId, int nQuantity );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxBooster::pClassPointer = NULL;

// Class TgClient.TgGfxCharacterBuilder
// 0x16E8 (0x196C - 0x0284)
class UTgGfxCharacterBuilder : public UTgGfxScene
{
public:
	struct FString                                     m_lsItems;                                        		// 0x0284 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsActives;                                      		// 0x0294 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsConsumables;                                  		// 0x02A4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsPassive;                                      		// 0x02B4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsActivated;                                    		// 0x02C4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsAbilities;                                    		// 0x02D4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsSkip;                                         		// 0x02E4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsSaveItems;                                    		// 0x02F4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsSaveAbilities;                                		// 0x0304 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	int                                                m_playerClassId;                                  		// 0x0314 (0x0004) [0x0000000000000000]              
	int                                                m_nSelectedTab;                                   		// 0x0318 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_Tabs[ 0x2 ];                                    		// 0x031C (0x0010) [0x0000000000000000]              
	class UTgGFxObject*                                m_SaveButton;                                     		// 0x032C (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_ClearButton;                                    		// 0x0334 (0x0008) [0x0000000000000000]              
	int                                                m_nSelectedItem;                                  		// 0x033C (0x0004) [0x0000000000000000]              
	int                                                m_nHighlightIndex;                                		// 0x0340 (0x0004) [0x0000000000000000]              
	int                                                m_nItemScrollIndex;                               		// 0x0344 (0x0004) [0x0000000000000000]              
	TArray< struct FItemBuilderCategory >              m_Categories;                                     		// 0x0348 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FItemBuilderCategory >              m_CustomCategories;                               		// 0x0358 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      m_ShownList;                                      		// 0x0368 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      m_ShownGrid;                                      		// 0x0378 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_nRoleIndex;                                     		// 0x0388 (0x0004) [0x0000000000000000]              
	unsigned char                                      m_TipType;                                        		// 0x038C (0x0001) [0x0000000000000000]              
	int                                                m_nPreviewTipIndex;                               		// 0x0390 (0x0004) [0x0000000000000000]              
	float                                              m_fTipWaitTimer;                                  		// 0x0394 (0x0004) [0x0000000000000000]              
	float                                              m_fTipWaitDuration;                               		// 0x0398 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bIsCustomRole : 1;                              		// 0x039C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bIsSubFilter : 1;                               		// 0x039C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bProfileModified : 1;                           		// 0x039C (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      m_bAbilitiesModified : 1;                         		// 0x039C (0x0004) [0x0000000000000000] [0x00000008] 
	int                                                m_nCustomRoleIndex;                               		// 0x03A0 (0x0004) [0x0000000000000000]              
	TArray< struct FPreviewItem >                      m_PreviewItemData;                                		// 0x03A4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FPreviewItem >                      m_PreviewActiveData;                              		// 0x03B4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FPreviewItem >                      m_PreviewConsumableData;                          		// 0x03C4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_nFilterIndex;                                   		// 0x03D4 (0x0004) [0x0000000000000000]              
	int                                                m_nFocusedItemIndex;                              		// 0x03D8 (0x0004) [0x0000000000000000]              
	int                                                m_nFocusedItemCategory;                           		// 0x03DC (0x0004) [0x0000000000000000]              
	int                                                m_bIsFocusingGridItem;                            		// 0x03E0 (0x0004) [0x0000000000000000]              
	class UTgGFxObject*                                m_ItemView;                                       		// 0x03E4 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_BuildPreview;                                   		// 0x03EC (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_RoleDropDown;                                   		// 0x03F4 (0x0008) [0x0000000000000000]              
	struct FItemDisplay                                m_ListItem[ 0xC ];                                		// 0x03FC (0x0600) [0x0000000000000000]              
	struct FItemDisplay                                m_GridItem[ 0x10 ];                               		// 0x09FC (0x0800) [0x0000000000000000]              
	class UTgGFxObject*                                m_Header[ 0x4 ];                                  		// 0x11FC (0x0020) [0x0000000000000000]              
	class UTgGFxObject*                                m_HeaderTF[ 0x4 ];                                		// 0x121C (0x0020) [0x0000000000000000]              
	class UTgGFxObject*                                m_HeaderBlock[ 0x4 ];                             		// 0x123C (0x0020) [0x0000000000000000]              
	struct FBuildItemDisplay                           m_PreviewItems[ 0x6 ];                            		// 0x125C (0x0060) [0x0000000000000000]              
	struct FBuildItemDisplay                           m_PreviewActives[ 0x2 ];                          		// 0x12BC (0x0020) [0x0000000000000000]              
	struct FBuildItemDisplay                           m_PreviewConsumables[ 0x2 ];                      		// 0x12DC (0x0020) [0x0000000000000000]              
	int                                                m_nSelectedLevel;                                 		// 0x12FC (0x0004) [0x0000000000000000]              
	int                                                m_nSelectedAbility;                               		// 0x1300 (0x0004) [0x0000000000000000]              
	struct FLevelInfo                                  m_nLevelAbilities[ 0x14 ];                        		// 0x1304 (0x00A0) [0x0000000000000000]              
	int                                                m_nAbilityLevels[ 0x4 ];                          		// 0x13A4 (0x0010) [0x0000000000000000]              
	struct FString                                     m_AbilityIcons[ 0x4 ];                            		// 0x13B4 (0x0040) [0x0000000000500000]              ( CPF_NeedCtorLink )
	class UTgGFxObject*                                m_AbilityPreview;                                 		// 0x13F4 (0x0008) [0x0000000000000000]              
	struct FAbilitySelectionButton                     m_PreviewAbilities[ 0x5 ];                        		// 0x13FC (0x0140) [0x0000000000000000]              
	class UTgGFxObject*                                m_AbilitiesView;                                  		// 0x153C (0x0008) [0x0000000000000000]              
	struct FAbilitySelectionButton                     m_AbilityBtns[ 0x4 ];                             		// 0x1544 (0x0100) [0x0000000000000000]              
	struct FAbilityRow                                 m_AbilityRows[ 0x14 ];                            		// 0x1644 (0x0320) [0x0000000000000000]              
	class UTgGFxObject*                                m_AbilitySkip;                                    		// 0x1964 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5140 );

		return pClassPointer;
	};

	bool HasVendorData ( );
	class UTgVendorData* GetVendorData ( );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Uninitialize ( );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxCharacterBuilder::pClassPointer = NULL;

// Class TgClient.TgGfxClanIconPicker
// 0x0010 (0x0294 - 0x0284)
class UTgGfxClanIconPicker : public UTgGfxScene
{
public:
	struct FScriptDelegate                             __USC_SelectIcon_Delegate__Delegate;              		// 0x0284 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0288 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5141 );

		return pClassPointer;
	};

	void Initialize ( class UTgMoviePlayer* pMP );
	void USC_SelectIcon ( int nIconItemId );
	void USC_SelectIcon_Delegate ( );
};

UClass* UTgGfxClanIconPicker::pClassPointer = NULL;

// Class TgClient.TgGFxDungeonCurrencies
// 0x0000 (0x0284 - 0x0284)
class UTgGFxDungeonCurrencies : public UTgGfxScene
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5142 );

		return pClassPointer;
	};

	void Uninitialize ( );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGFxDungeonCurrencies::pClassPointer = NULL;

// Class TgClient.TgGfxEOMLobby
// 0x0014 (0x0298 - 0x0284)
class UTgGfxEOMLobby : public UTgGfxScene
{
public:
	struct FString                                     m_sGiftedPlayerName;                              		// 0x0284 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_nGiftedPlayerId;                                		// 0x0294 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5143 );

		return pClassPointer;
	};

	void OnAcquisition ( class UTgEventDataItem* pEvent );
	void OnStats ( struct FString instanceId );
	void OnFeedback ( );
	void OnTwitter ( struct FString instanceId );
	void OnFacebook ( struct FString instanceId );
	void OnSendPlayerGift ( class UTgEventDataItem* pEvent );
	void OnSendGiftPoints ( class UGFxObject* pData );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void USC_SendPlayerGift ( struct FString PlayerName, struct FString nPlayerId );
	void eventReceiveGiftedPoints ( class UGFxObject* Data );
	void Uninitialize ( );
	void Initialize ( class UTgMoviePlayer* pMoviePlayer );
};

UClass* UTgGfxEOMLobby::pClassPointer = NULL;

// Class TgClient.TgGfxEventAchievements
// 0x0000 (0x0284 - 0x0284)
class UTgGfxEventAchievements : public UTgGfxScene
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5144 );

		return pClassPointer;
	};

	void CheckBundleOwned ( );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxEventAchievements::pClassPointer = NULL;

// Class TgClient.TgGfxEventLeaderboard
// 0x0020 (0x02A4 - 0x0284)
class UTgGfxEventLeaderboard : public UTgGfxScene
{
public:
	unsigned long                                      requestingData : 1;                               		// 0x0284 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      gotFriendsData : 1;                               		// 0x0284 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      gotPersonalData : 1;                              		// 0x0284 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      gotWorldData : 1;                                 		// 0x0284 (0x0004) [0x0000000000000000] [0x00000008] 
	struct FString                                     dataIndex;                                        		// 0x0288 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                nCurrentEventId;                                  		// 0x0298 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  cachedBoards;                                     		// 0x029C (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5145 );

		return pClassPointer;
	};

	void USC_RequestEventLeaderboard ( int EventIdx );
	class UGFxObject* Chunk ( struct FString dataIdx );
	class UGFxObject* CreateChunk ( struct FString dataIdx );
	bool UpdateFromChunk ( struct FString dataIdx );
	void OnReceivePlayerNames ( );
	void ReceivedAllData ( );
	void PopulateDropdown ( TArray< int > arrEventIds );
	void ShowLeaderboard ( int nStartIndex, int nEndIndex );
	void RequestFriendAndWorldPlayerNames ( );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxEventLeaderboard::pClassPointer = NULL;

// Class TgClient.TgGfxFeedback
// 0x00AC (0x0330 - 0x0284)
class UTgGfxFeedback : public UTgGfxScene
{
public:
	struct FString                                     m_lsHeaderServerStability;                        		// 0x0284 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsHeaderMatchmaking;                            		// 0x0294 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsDescriptionServerStability;                   		// 0x02A4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsDescriptionMatchmaking;                       		// 0x02B4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsSubmit;                                       		// 0x02C4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsComments;                                     		// 0x02D4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsUnrated;                                      		// 0x02E4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	class UTgGFxObject*                                m_Comments;                                       		// 0x02F4 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_RatingBtns[ 0x5 ];                              		// 0x02FC (0x0028) [0x0000000000000000]              
	class UTgGFxObject*                                m_RatingTF;                                       		// 0x0324 (0x0008) [0x0000000000000000]              
	int                                                m_nStarRating;                                    		// 0x032C (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5146 );

		return pClassPointer;
	};

	void ReceiveGFxData ( class UGFxObject* pObj );
	void Initialize ( class UTgMoviePlayer* theMovie );
};

UClass* UTgGfxFeedback::pClassPointer = NULL;

// Class TgClient.TgGfxGlossary
// 0x0000 (0x0284 - 0x0284)
class UTgGfxGlossary : public UTgGfxScene
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5147 );

		return pClassPointer;
	};

	void Uninitialize ( );
	void Initialize ( class UTgMoviePlayer* pMP );
	void ReceiveGFxData ( class UGFxObject* pObj );
};

UClass* UTgGfxGlossary::pClassPointer = NULL;

// Class TgClient.TgGfxGods
// 0x17CC (0x1A50 - 0x0284)
class UTgGfxGods : public UTgGfxScene
{
public:
	struct FString                                     m_lsStandard;                                     		// 0x0284 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsOwned;                                        		// 0x0294 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     rented_label;                                     		// 0x02A4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsCurrentRentalExpiresIn;                       		// 0x02B4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsDiamond;                                      		// 0x02C4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsDiamond_description;                          		// 0x02D4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusive;                                    		// 0x02E4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusive_description;                        		// 0x02F4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveChest;                               		// 0x0304 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveChest_description;                   		// 0x0314 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveClan;                                		// 0x0324 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveClan_description;                    		// 0x0334 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusivePromo;                               		// 0x0344 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusivePromo_description;                   		// 0x0354 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveEsports;                             		// 0x0364 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveEsports_description;                 		// 0x0374 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveSeasonal;                            		// 0x0384 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsExclusiveSeasonal_description;                		// 0x0394 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsGold;                                         		// 0x03A4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsGold_description;                             		// 0x03B4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLegendary;                                    		// 0x03C4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLegendary_description;                        		// 0x03D4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimited;                                      		// 0x03E4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimited_description;                          		// 0x03F4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedChest;                                 		// 0x0404 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedChest_description;                     		// 0x0414 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedClan;                                  		// 0x0424 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedClan_description;                      		// 0x0434 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedPromo;                                 		// 0x0444 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedPromo_description;                     		// 0x0454 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedEsports;                               		// 0x0464 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedEsports_description;                   		// 0x0474 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedSeasonal;                              		// 0x0484 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsLimitedSeasonal_description;                  		// 0x0494 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsUnlimited;                                    		// 0x04A4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsUnlimited_description;                        		// 0x04B4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_lsClan;                                         		// 0x04C4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     days_label;                                       		// 0x04D4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     day_label;                                        		// 0x04E4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     hours_label;                                      		// 0x04F4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     hour_label;                                       		// 0x0504 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     minutes_label;                                    		// 0x0514 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     minute_label;                                     		// 0x0524 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     seconds_label;                                    		// 0x0534 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     second_label;                                     		// 0x0544 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      god_ids;                                          		// 0x0554 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FGFxItem                                    m_ItemBtn[ 0x38 ];                                		// 0x0564 (0x08C0) [0x0000000000000000]              
	struct FGFxSkinBtn                                 m_SkinBtn[ 0x6 ];                                 		// 0x0E24 (0x02A0) [0x0000000000000000]              
	struct FGFxGodBtn                                  m_GodCardBtn[ 0x10 ];                             		// 0x10C4 (0x0680) [0x0000000000000000]              
	class UTgGFxObject*                                m_SearchField;                                    		// 0x1744 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_FilterDropdown;                                 		// 0x174C (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_GodGrid;                                        		// 0x1754 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_GodCardCheckbox;                                		// 0x175C (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_GodGridScrollbar;                               		// 0x1764 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_GodCardScrollbar;                               		// 0x176C (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_UGPIconsBtn;                                    		// 0x1774 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_UGPCardsBtn;                                    		// 0x177C (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_SkinCall;                                       		// 0x1784 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_SkinCallTF;                                     		// 0x178C (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_ExtraCall;                                      		// 0x1794 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_ExtraCallTF;                                    		// 0x179C (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_VoiceCall;                                      		// 0x17A4 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_VoiceCallTF;                                    		// 0x17AC (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_VPContainer;                                    		// 0x17B4 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_SkinGoto;                                       		// 0x17BC (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_RentalInfo;                                     		// 0x17C4 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_SkinInfo;                                       		// 0x17CC (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_SideSkinInfo;                                   		// 0x17D4 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_UnlockBtn;                                      		// 0x17DC (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_EmoteLabel;                                     		// 0x17E4 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_RightGodsText;                                  		// 0x17EC (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_RightGodsText2;                                 		// 0x17F4 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_AbilityScreen;                                  		// 0x17FC (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_AboutScreen;                                    		// 0x1804 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_LoreScreen;                                     		// 0x180C (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_StatScreen;                                     		// 0x1814 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_ExtraScreen;                                    		// 0x181C (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_HistoryScreen;                                  		// 0x1824 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_VoiceScreen;                                    		// 0x182C (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_AchieveScreen;                                  		// 0x1834 (0x0008) [0x0000000000000000]              
	int                                                m_nSelectedIndex;                                 		// 0x183C (0x0004) [0x0000000000000000]              
	int                                                m_nScrollIndex;                                   		// 0x1840 (0x0004) [0x0000000000000000]              
	TArray< int >                                      m_nShownItems;                                    		// 0x1844 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      m_nUnsortedItems;                                 		// 0x1854 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      m_RentalGodsIndex;                                		// 0x1864 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sSearchField;                                   		// 0x1874 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sSearch;                                        		// 0x1884 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              m_fTipWaitTimer;                                  		// 0x1894 (0x0004) [0x0000000000000000]              
	float                                              m_fTipWaitDuration;                               		// 0x1898 (0x0004) [0x0000000000000000]              
	float                                              m_fRentalTimer;                                   		// 0x189C (0x0004) [0x0000000000000000]              
	int                                                m_nHighlightIndex;                                		// 0x18A0 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bScrollToSelection : 1;                         		// 0x18A4 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bHasGodPack : 1;                                		// 0x18A4 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bShouldUpdateCall : 1;                          		// 0x18A4 (0x0004) [0x0000000000000000] [0x00000004] 
	int                                                m_nSelectedTab;                                   		// 0x18A8 (0x0004) [0x0000000000000000]              
	int                                                m_nSelectedGodId;                                 		// 0x18AC (0x0004) [0x0000000000000000]              
	int                                                m_nSelectedSkinId;                                		// 0x18B0 (0x0004) [0x0000000000000000]              
	int                                                m_nSelectedWardSkinId;                            		// 0x18B4 (0x0004) [0x0000000000000000]              
	int                                                m_nFilterType;                                    		// 0x18B8 (0x0004) [0x0000000000000000]              
	int                                                m_nPrevGodScrollIndex;                            		// 0x18BC (0x0004) [0x0000000000000000]              
	int                                                m_nPrevWardScrollIndex;                           		// 0x18C0 (0x0004) [0x0000000000000000]              
	int                                                m_nStatsHPLow;                                    		// 0x18C4 (0x0004) [0x0000000000000000]              
	int                                                m_nStatsHPHigh;                                   		// 0x18C8 (0x0004) [0x0000000000000000]              
	int                                                m_nStatsManaLow;                                  		// 0x18CC (0x0004) [0x0000000000000000]              
	int                                                m_nStatsManaHigh;                                 		// 0x18D0 (0x0004) [0x0000000000000000]              
	int                                                m_nCachedGodsTabSelection;                        		// 0x18D4 (0x0004) [0x0000000000000000]              
	int                                                m_playerId;                                       		// 0x18D8 (0x0004) [0x0000000000000000]              
	int                                                m_nColCount;                                      		// 0x18DC (0x0004) [0x0000000000000000]              
	struct FItemData_GodPage                           m_SelectedGod;                                    		// 0x18E0 (0x00E8) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FItemData_GodPage >                 m_GodData;                                        		// 0x19C8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FItemData_GodPage >                 m_WardData;                                       		// 0x19D8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FItemData_GodPage >                 m_SkinData;                                       		// 0x19E8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FStreamData_Gods >                  m_StreamData;                                     		// 0x19F8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FAchievementData_GodsAchievements > m_achievementDatas;                               		// 0x1A08 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UGFxObject*                                  m_achievementDatasArray;                          		// 0x1A18 (0x0008) [0x0000000000000000]              
	TArray< struct FVendorItemUIHint >                 m_vendorUiHints;                                  		// 0x1A20 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __USC_UpdateEmoteSelection_Delegate__Delegate;    		// 0x1A30 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x1A34 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __USC_PlayGodVideo_Delegate__Delegate;            		// 0x1A40 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x1A44 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 5148 );

		return pClassPointer;
	};

	void OnAcquisition ( class UTgEventDataItem* pEvent );
	void UpdateUGPValue ( class UTgEventDataItem* pEvent );
	void ReceiveGFxData ( class UGFxObject* pObj );
	void Uninitialize ( );
	void Initialize ( class UTgMoviePlayer* theMovie );
	void USC_PlayGodVideo ( int abilityNumber );
	void USC_PlayGodVideo_Delegate ( );
	void USC_UpdateEmoteSelection ( struct FString emoteName );
	void USC_UpdateEmoteSelection_Delegate ( struct FString emoteName );
};

UClass* UTgGfxGods::pClassPointer = NULL;

// Class TgClient.TgGfxGodsHistory
// 0x0038 (0x02BC - 0x0284)
class UTgGfxGodsHistory : public UTgGfxScene
{
public:
	int                                                m_godId;                                          		// 0x0284 (0x0004) [0x0000000000000000]              
