/*
#############################################################################################
# Smite (v3.24.3804.2) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TgClientBase_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function TgClientBase.TgAnnouncerPreviewer.PreviewAnnouncerByItemId
// [0x00024400] ( FUNC_Native )
struct UTgAnnouncerPreviewer_execPreviewAnnouncerByItemId_Parms
{
	int                                                nItemId;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bAsync : 1;                                       		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClientBase.TgAnnouncerPreviewer.OnAnnouncerLoaded
// [0x00020400] ( FUNC_Native )
struct UTgAnnouncerPreviewer_execOnAnnouncerLoaded_Parms
{
};

// Function TgClientBase.TgAnnouncerPreviewer.Init
// [0x00020400] ( FUNC_Native )
struct UTgAnnouncerPreviewer_execInit_Parms
{
};

// Function TgClientBase.TgMoviePlayer.usc_get_experimental_hud
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execusc_get_experimental_hud_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.usc_use_experimental_hud
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execusc_use_experimental_hud_Parms
{
	unsigned long                                      Value : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.usc_PauseGame
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execusc_PauseGame_Parms
{
	unsigned long                                      shouldPause : 1;                                  		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// class ATgDemoRecSpectator*                      SpecPC;                                           		// 0x0004 (0x0008) [0x0000000000000000]              
	// class ATgPlayerController*                      TgPC;                                             		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function TgClientBase.TgMoviePlayer.usc_minimap_hovered
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execusc_minimap_hovered_Parms
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     MapName;                                          		// 0x0008 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// class ATgGameHUD*                               HUD;                                              		// 0x0018 (0x0008) [0x0000000000000000]              
};

// Function TgClientBase.TgMoviePlayer.usc_minimap_pinged
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execusc_minimap_pinged_Parms
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Type;                                             		// 0x0008 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     MapName;                                          		// 0x0018 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// class ATgGameHUD*                               HUD;                                              		// 0x0028 (0x0008) [0x0000000000000000]              
};

// Function TgClientBase.TgMoviePlayer.usc_PauseGameToggle
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execusc_PauseGameToggle_Parms
{
	// class ATgPlayerController*                      TgPC;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function TgClientBase.TgMoviePlayer.usc_isAllowedPause
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execusc_isAllowedPause_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ATgPlayerController*                      TgPC;                                             		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function TgClientBase.TgMoviePlayer.IsAccountPickerOpen
// [0x00020802] ( FUNC_Event )
struct UTgMoviePlayer_eventIsAccountPickerOpen_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.usc_ShowContentPurchaseUI
// [0x00020A02] ( FUNC_Exec | FUNC_Event )
struct UTgMoviePlayer_execusc_ShowContentPurchaseUI_Parms
{
	struct FString                                     SignedOffer;                                      		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.GetAvailableProducts
// [0x00420802] ( FUNC_Event )
struct UTgMoviePlayer_eventGetAvailableProducts_Parms
{
	int                                                nControllerId;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      MediaType;                                        		// 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FMarketplaceProductDetails >        Products;                                         		// 0x0008 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.ShowContentPurchaseUI
// [0x00020A02] ( FUNC_Exec | FUNC_Event )
struct UTgMoviePlayer_execShowContentPurchaseUI_Parms
{
	struct FString                                     SingedOffer;                                      		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.GetInventoryItems
// [0x00420802] ( FUNC_Event )
struct UTgMoviePlayer_eventGetInventoryItems_Parms
{
	TArray< struct FMarketplaceInventoryItem >         InventoryItems;                                   		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.CanShowContentPurchaseUI
// [0x00020802] ( FUNC_Event )
struct UTgMoviePlayer_eventCanShowContentPurchaseUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.UnregisterLocalTalker
// [0x00024803] ( FUNC_Final | FUNC_Event )
struct UTgMoviePlayer_eventUnregisterLocalTalker_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      ChannelIndex;                                     		// 0x0001 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.RegisterLocalTalker
// [0x00024803] ( FUNC_Final | FUNC_Event )
struct UTgMoviePlayer_eventRegisterLocalTalker_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      ChannelIndex;                                     		// 0x0001 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.ShowNotification
// [0x00024803] ( FUNC_Final | FUNC_Event )
struct UTgMoviePlayer_eventShowNotification_Parms
{
	int                                                nType;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Message;                                          		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     Message2;                                         		// 0x0014 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	class UGFxObject*                                  Data;                                             		// 0x0024 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.HideNotification
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UTgMoviePlayer_eventHideNotification_Parms
{
	int                                                nType;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.TestShowNotification
// [0x00020203] ( FUNC_Final | FUNC_Exec )
struct UTgMoviePlayer_execTestShowNotification_Parms
{
};

// Function TgClientBase.TgMoviePlayer.TestHideNotification
// [0x00020203] ( FUNC_Final | FUNC_Exec )
struct UTgMoviePlayer_execTestHideNotification_Parms
{
};

// Function TgClientBase.TgMoviePlayer.LogFocus
// [0x00020203] ( FUNC_Final | FUNC_Exec )
struct UTgMoviePlayer_execLogFocus_Parms
{
};

// Function TgClientBase.TgMoviePlayer.SetGamepadMode
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UTgMoviePlayer_eventSetGamepadMode_Parms
{
	unsigned long                                      bIsGamepad : 1;                                   		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.SetModal
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UTgMoviePlayer_eventSetModal_Parms
{
	class UGFxObject*                                  modalObj;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.ClearModal
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UTgMoviePlayer_eventClearModal_Parms
{
};

// Function TgClientBase.TgMoviePlayer.EndLoading
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UTgMoviePlayer_eventEndLoading_Parms
{
	struct FString                                     KeyName;                                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.StartLoading
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UTgMoviePlayer_eventStartLoading_Parms
{
	struct FString                                     KeyName;                                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.GainFocus
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UTgMoviePlayer_eventGainFocus_Parms
{
	class UGFxObject*                                  focusObj;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.FindFocus
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UTgMoviePlayer_eventFindFocus_Parms
{
};

// Function TgClientBase.TgMoviePlayer.RegainFocus
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UTgMoviePlayer_eventRegainFocus_Parms
{
};

// Function TgClientBase.TgMoviePlayer.LostFocus
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UTgMoviePlayer_eventLostFocus_Parms
{
};

// Function TgClientBase.TgMoviePlayer.SetOnlineStatus
// [0x00024802] ( FUNC_Event )
struct UTgMoviePlayer_eventSetOnlineStatus_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     StatusString;                                     		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      PlayerActive : 1;                                 		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.DisableVideoRecording
// [0x00020802] ( FUNC_Event )
struct UTgMoviePlayer_eventDisableVideoRecording_Parms
{
};

// Function TgClientBase.TgMoviePlayer.EnableVideoRecording
// [0x00020802] ( FUNC_Event )
struct UTgMoviePlayer_eventEnableVideoRecording_Parms
{
};

// Function TgClientBase.TgMoviePlayer.usc_get_gamestate
// [0x00020002] 
struct UTgMoviePlayer_execusc_get_gamestate_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.UIDebugModeEnd
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execUIDebugModeEnd_Parms
{
};

// Function TgClientBase.TgMoviePlayer.UIDebugModeWatch
// [0x00024202] ( FUNC_Exec )
struct UTgMoviePlayer_execUIDebugModeWatch_Parms
{
	struct FString                                     sPath;                                            		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                nDrillInDepth;                                    		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.UIDebugModeNavigation
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execUIDebugModeNavigation_Parms
{
};

// Function TgClientBase.TgMoviePlayer.UIDebugModeHighlight
// [0x00024202] ( FUNC_Exec )
struct UTgMoviePlayer_execUIDebugModeHighlight_Parms
{
	unsigned long                                      mousableOnly : 1;                                 		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.ToggleAlienFX
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execToggleAlienFX_Parms
{
	// class ATgPlayerController*                      TgPC;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function TgClientBase.TgMoviePlayer.FlashCaptureMouse
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execFlashCaptureMouse_Parms
{
};

// Function TgClientBase.TgMoviePlayer.FlashReleaseMouse
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execFlashReleaseMouse_Parms
{
};

// Function TgClientBase.TgMoviePlayer.ListOpenScenes
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execListOpenScenes_Parms
{
};

// Function TgClientBase.TgMoviePlayer.CloseAllScenes
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execCloseAllScenes_Parms
{
};

// Function TgClientBase.TgMoviePlayer.EnableItemWarningPopup
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execEnableItemWarningPopup_Parms
{
};

// Function TgClientBase.TgMoviePlayer.DisableItemWarningPopup
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execDisableItemWarningPopup_Parms
{
};

// Function TgClientBase.TgMoviePlayer.ClosePartyInviteDialog
// [0x00020802] ( FUNC_Event )
struct UTgMoviePlayer_eventClosePartyInviteDialog_Parms
{
};

// Function TgClientBase.TgMoviePlayer.DisplayLoginUI
// [0x00020802] ( FUNC_Event )
struct UTgMoviePlayer_eventDisplayLoginUI_Parms
{
};

// Function TgClientBase.TgMoviePlayer.ShouldBlockKey
// [0x00020802] ( FUNC_Event )
struct UTgMoviePlayer_eventShouldBlockKey_Parms
{
	int                                                ControllerId;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       ButtonName;                                       		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      Event;                                            		// 0x000C (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ATgPlayerController*                      TgPC;                                             		// 0x0014 (0x0008) [0x0000000000000000]              
	// class UTgPlayerInput*                           tgPI;                                             		// 0x001C (0x0008) [0x0000000000000000]              
};

// Function TgClientBase.TgMoviePlayer.usc_ClipboardCopy
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execusc_ClipboardCopy_Parms
{
	struct FString                                     Str;                                              		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// class ATgPlayerController*                      TgPC;                                             		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function TgClientBase.TgMoviePlayer.usc_ClipboardPaste
// [0x00020202] ( FUNC_Exec )
struct UTgMoviePlayer_execusc_ClipboardPaste_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// class ATgPlayerController*                      TgPC;                                             		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function TgClientBase.TgMoviePlayer.OnPlayerCardComplete
// [0x00020002] 
struct UTgMoviePlayer_execOnPlayerCardComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.WidgetUnloaded
// [0x00020802] ( FUNC_Event )
struct UTgMoviePlayer_eventWidgetUnloaded_Parms
{
	struct FName                                       WidgetName;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       WidgetPath;                                       		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UGFxObject*                                  Widget;                                           		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             I;                                                		// 0x001C (0x0004) [0x0000000000000000]              
	// class UGFxObject*                               tempWidget;                                       		// 0x0020 (0x0008) [0x0000000000000000]              
};

// Function TgClientBase.TgMoviePlayer.WidgetInitialized
// [0x00820802] ( FUNC_Event )
struct UTgMoviePlayer_eventWidgetInitialized_Parms
{
	struct FName                                       WidgetName;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       WidgetPath;                                       		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UGFxObject*                                  Widget;                                           		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FWidgetBinding                           newWidget;                                        		// 0x001C (0x0010) [0x0000000000000000]              
	// int                                             I;                                                		// 0x002C (0x0004) [0x0000000000000000]              
};

// Function TgClientBase.TgMoviePlayer.ReadOnlinePlayerData
// [0x00024802] ( FUNC_Event )
struct UTgMoviePlayer_eventReadOnlinePlayerData_Parms
{
	TArray< struct FString >                           PlayerIDs;                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bIncludePresence : 1;                             		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.CleanupUC
// [0x00020802] ( FUNC_Event )
struct UTgMoviePlayer_eventCleanupUC_Parms
{
};

// Function TgClientBase.TgMoviePlayer.InitOSSRef
// [0x00020002] 
struct UTgMoviePlayer_execInitOSSRef_Parms
{
};

// Function TgClientBase.TgMoviePlayer.Init
// [0x00024802] ( FUNC_Event )
struct UTgMoviePlayer_eventInit_Parms
{
	class ULocalPlayer*                                LocPlay;                                          		// 0x0000 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.PostWidgetInit
// [0x00020800] ( FUNC_Event )
struct UTgMoviePlayer_eventPostWidgetInit_Parms
{
};

// Function TgClientBase.TgMoviePlayer.Tick
// [0x00020802] ( FUNC_Event )
struct UTgMoviePlayer_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.usc_findIndicesForCapitalSizeCharacters
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execusc_findIndicesForCapitalSizeCharacters_Parms
{
	struct FString                                     sourceText;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UGFxObject*                                  out_capitalIndices;                               		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.usc_report_player
// [0x00024600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execusc_report_player_Parms
{
	struct FString                                     sPlayerName;                                      		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                nReasonCode;                                      		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sReason;                                          		// 0x0014 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                nTaskForce;                                       		// 0x0024 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                nPlayerCount;                                     		// 0x0028 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                nReportedPlayerTaskForce;                         		// 0x002C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.DebugSimulmediaVideoPlayer
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execDebugSimulmediaVideoPlayer_Parms
{
};

// Function TgClientBase.TgMoviePlayer.DebugIntroVideo
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execDebugIntroVideo_Parms
{
};

// Function TgClientBase.TgMoviePlayer.DebugActivities
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execDebugActivities_Parms
{
};

// Function TgClientBase.TgMoviePlayer.usc_GetAppSettings
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execusc_GetAppSettings_Parms
{
	struct FString                                     pSetting;                                         		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.OnClearCachedJoinChallengeTimer
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execOnClearCachedJoinChallengeTimer_Parms
{
};

// Function TgClientBase.TgMoviePlayer.OnJoinChallengePasswordPopup
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execOnJoinChallengePasswordPopup_Parms
{
	class UTgPagePopup*                                pData;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FPopupResponse                              Response;                                         		// 0x0008 (0x0018) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.FlushKeyboardBinds
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execFlushKeyboardBinds_Parms
{
};

// Function TgClientBase.TgMoviePlayer.ToggleInputConfirm
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execToggleInputConfirm_Parms
{
	unsigned long                                      bEnable : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.TestInputHud
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execTestInputHud_Parms
{
	unsigned long                                      isGamePad : 1;                                    		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.ForcePSPlus
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execForcePSPlus_Parms
{
	unsigned long                                      bShouldForce : 1;                                 		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.usc_MuteVivoxPlayer
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execusc_MuteVivoxPlayer_Parms
{
	struct FString                                     sPlayerId;                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      Toggle : 1;                                       		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FString                                     sPlatformId;                                      		// 0x0014 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.OnReferralSelected
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execOnReferralSelected_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.ShowGodPackPurchase
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execShowGodPackPurchase_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.GetOwnsGodPack
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execGetOwnsGodPack_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.DestroyVideoPlayer
// [0x00020802] ( FUNC_Event )
struct UTgMoviePlayer_eventDestroyVideoPlayer_Parms
{
};

// Function TgClientBase.TgMoviePlayer.OnVideoError
// [0x00020802] ( FUNC_Event )
struct UTgMoviePlayer_eventOnVideoError_Parms
{
	class APComVideoPlayer*                            VideoPlayer;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      ErrorCode;                                        		// 0x0008 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.SpawnVideoPlayer
// [0x00020802] ( FUNC_Event )
struct UTgMoviePlayer_eventSpawnVideoPlayer_Parms
{
	class AActor*                                      SpawningActor;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.PrintUIGameInputIntercepts
// [0x00020203] ( FUNC_Final | FUNC_Exec )
struct UTgMoviePlayer_execPrintUIGameInputIntercepts_Parms
{
};

// Function TgClientBase.TgMoviePlayer.PrintInputCaptures
// [0x00020601] ( FUNC_Final | FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execPrintInputCaptures_Parms
{
};

// Function TgClientBase.TgMoviePlayer.PrintFocusStack
// [0x00020601] ( FUNC_Final | FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execPrintFocusStack_Parms
{
};

// Function TgClientBase.TgMoviePlayer.PrintGameInfo
// [0x00020601] ( FUNC_Final | FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execPrintGameInfo_Parms
{
};

// Function TgClientBase.TgMoviePlayer.NativeVideoPlayerDestroy
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execNativeVideoPlayerDestroy_Parms
{
};

// Function TgClientBase.TgMoviePlayer.HandleVideoPlayerErrorCallback
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execHandleVideoPlayerErrorCallback_Parms
{
	class APComVideoPlayer*                            VideoPlayer;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      ErrorCode;                                        		// 0x0008 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.CheckForGlobalKeyInput
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execCheckForGlobalKeyInput_Parms
{
	int                                                ControllerId;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       ButtonName;                                       		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      Event;                                            		// 0x000C (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.OnToggleSkillScreen
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execOnToggleSkillScreen_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.OnVendorStoreToggle
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execOnVendorStoreToggle_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.OnVendorStoreClose
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execOnVendorStoreClose_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.OnVendorStoreOpen
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execOnVendorStoreOpen_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.usc_CheckEOMLSimulmediaOpportunities
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execusc_CheckEOMLSimulmediaOpportunities_Parms
{
};

// Function TgClientBase.TgMoviePlayer.usc_NativeLog
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execusc_NativeLog_Parms
{
	struct FString                                     sValue;                                           		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.usc_getIsGamePadInput
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execusc_getIsGamePadInput_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.usc_saveTransformSettings
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execusc_saveTransformSettings_Parms
{
	struct FString                                     TransformSettings;                                		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.usc_loadTransformSettings
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execusc_loadTransformSettings_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.OnVideoPlaybackEnded
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execOnVideoPlaybackEnded_Parms
{
};

// Function TgClientBase.TgMoviePlayer.usc_GetFocusedTextField
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execusc_GetFocusedTextField_Parms
{
	class UGFxObject*                                  ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.usc_ShowKeyboardUI
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execusc_ShowKeyboardUI_Parms
{
	class UGFxObject*                                  FocusedTextField;                                 		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     TitleText;                                        		// 0x0008 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     DescriptionText;                                  		// 0x0018 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bIsPassword : 1;                                  		// 0x0028 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bShouldValidate : 1;                              		// 0x002C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	struct FString                                     DefaultText;                                      		// 0x0030 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	int                                                MaxResultLength;                                  		// 0x0040 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0044 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.usc_HideKeyboardUI
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execusc_HideKeyboardUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.usc_IsShowingKeyboardUI
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execusc_IsShowingKeyboardUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.OnResolveChatMessage
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execOnResolveChatMessage_Parms
{
	unsigned long                                      bSuccess : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	class UTgPlayerNameManager*                        pManager;                                         		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.OpenPurchaseGems
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execOpenPurchaseGems_Parms
{
	struct FString                                     SKUCode;                                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.ClaimPendingChatMessages
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execClaimPendingChatMessages_Parms
{
	TArray< class UTgChatData* >                       out_arrData;                                      		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.ShowHudChatMessage
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execShowHudChatMessage_Parms
{
	class UTgChatData*                                 pData;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.TestShowMessage
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execTestShowMessage_Parms
{
	struct FString                                     msg;                                              		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.gfxProcessSound
// [0x00020601] ( FUNC_Final | FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execgfxProcessSound_Parms
{
	struct FName                                       aThemeName;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       aEventName;                                       		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.OnBattlePassToastUpdate
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execOnBattlePassToastUpdate_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.OnInputModeChanged
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execOnInputModeChanged_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.HandleClanPlayerInviteUpdates
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execHandleClanPlayerInviteUpdates_Parms
{
	struct FPointer                                    pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.usc_send_chat
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execusc_send_chat_Parms
{
	int                                                nChannel;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     msg;                                              		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     Recipient;                                        		// 0x0014 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.usc_can_view_ugc
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execusc_can_view_ugc_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.ASC_ShowFriendsUI
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execASC_ShowFriendsUI_Parms
{
};

// Function TgClientBase.TgMoviePlayer.SetupPurchaseWithProductId
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execSetupPurchaseWithProductId_Parms
{
	struct FString                                     sProductId;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.ClaimGift
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execClaimGift_Parms
{
	struct FString                                     nAcqId;                                           		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.TestListPendingGifts
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execTestListPendingGifts_Parms
{
};

// Function TgClientBase.TgMoviePlayer.TestSendGift
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execTestSendGift_Parms
{
	int                                                nPlayerId;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nMessageIndex;                                    		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bAnon : 1;                                        		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.FixLocalizationKeybinds
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execFixLocalizationKeybinds_Parms
{
	struct FString                                     sMsg;                                             		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.GetPlayerData
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execGetPlayerData_Parms
{
	struct FTgPlayerId                                 pid;                                              		// 0x0000 (0x0024) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	class UTgGFxPlayerData*                            ReturnValue;                                      		// 0x0024 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.AttemptToJoinTutorial
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execAttemptToJoinTutorial_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.CallPrivilegeDelegate
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UTgMoviePlayer_eventCallPrivilegeDelegate_Parms
{
	struct FScriptDelegate                             delCallback;                                      		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned char                                      ePriv;                                            		// 0x0010 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      ePermiss;                                         		// 0x0011 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.CheckOnlinePrivileges
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execCheckOnlinePrivileges_Parms
{
	unsigned char                                      ePriv;                                            		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FScriptDelegate                             delCallback;                                      		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.CancelCheckOnlinePrivileges
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execCancelCheckOnlinePrivileges_Parms
{
	class UObject*                                     pScope;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.OnVGSCustomMessage
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execOnVGSCustomMessage_Parms
{
	unsigned long                                      bSuccess : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FString                                     sText;                                            		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.TryEstablishPlatformSession
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execTryEstablishPlatformSession_Parms
{
	struct FPointer                                    pMarshal;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.OnForceMatchDataUpdate
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execOnForceMatchDataUpdate_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.OnMatchDataChange
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execOnMatchDataChange_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.ReceiveMatchData
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execReceiveMatchData_Parms
{
	struct FPointer                                    pMarshal;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.UnregisterLocalPlayerForVoice
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execUnregisterLocalPlayerForVoice_Parms
{
	unsigned char                                      ChannelIndex;                                     		// 0x0000 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.RegisterLocalPlayerForVoice
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execRegisterLocalPlayerForVoice_Parms
{
	unsigned char                                      ChannelIndex;                                     		// 0x0000 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.UpdateCameraBasedOnNavAction
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execUpdateCameraBasedOnNavAction_Parms
{
};

// Function TgClientBase.TgMoviePlayer.EquipLoadoutItem
// [0x00020601] ( FUNC_Final | FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execEquipLoadoutItem_Parms
{
	int                                                nItemId;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.NavigateTo
// [0x00420400] ( FUNC_Native )
struct UTgMoviePlayer_execNavigateTo_Parms
{
	struct FNavParams                                  Params;                                           		// 0x0000 (0x0024) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
};

// Function TgClientBase.TgMoviePlayer.HandleEscapeKey
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execHandleEscapeKey_Parms
{
};

// Function TgClientBase.TgMoviePlayer.usc_goto_item
// [0x00024600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execusc_goto_item_Parms
{
	int                                                nItemId;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bUseAltRedirect : 1;                              		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.GotoChestItem
// [0x00024400] ( FUNC_Native )
struct UTgMoviePlayer_execGotoChestItem_Parms
{
	int                                                nChestItemId;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nOriginalItemId;                                  		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nReturnToTarget;                                  		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                nReturnToEvent;                                   		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bUseAltRedirect : 1;                              		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.GotoItem
// [0x00024400] ( FUNC_Native )
struct UTgMoviePlayer_execGotoItem_Parms
{
	int                                                nItemId;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nReturnToTarget;                                  		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                nReturnToEvent;                                   		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bUseAltRedirect : 1;                              		// 0x000C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.RedirectToItemObtainLocation
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execRedirectToItemObtainLocation_Parms
{
	int                                                nItemId;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.ShowGodVideo
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execShowGodVideo_Parms
{
	int                                                nGodVideoId;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sGodVideoUrl;                                     		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.goto_lobby
// [0x00024400] ( FUNC_Native )
struct UTgMoviePlayer_execgoto_lobby_Parms
{
	unsigned long                                      bAtEOM : 1;                                       		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.GetRoot
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execGetRoot_Parms
{
	class UTgGFxObject*                                ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.GetWidget
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execGetWidget_Parms
{
	struct FName                                       WidgetName;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UGFxObject*                                  ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClientBase.TgMoviePlayer.TestMatchLobby
// [0x00024601] ( FUNC_Final | FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execTestMatchLobby_Parms
{
	int                                                nQueue;                                           		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bPreSelect : 1;                                   		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	int                                                nTeamCount;                                       		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                nPlayerPerTeam;                                   		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClientBase.TgMoviePlayer.GetHUDTeamName
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execGetHUDTeamName_Parms
{
	unsigned long                                      bEnemy : 1;                                       		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.SetLanguage
// [0x00020400] ( FUNC_Native )
struct UTgMoviePlayer_execSetLanguage_Parms
{
};

// Function TgClientBase.TgMoviePlayer.ShowLoginMessage
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execShowLoginMessage_Parms
{
	struct FString                                     sMsg;                                             		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClientBase.TgMoviePlayer.ShowLoginUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execShowLoginUI_Parms
{
};

// Function TgClientBase.TgMoviePlayer.ShowNormalUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UTgMoviePlayer_execShowNormalUI_Parms
{
};

// Function TgClientBase.TgMoviePlayer.GetAndClearLastLoginError
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgMoviePlayer_execGetAndClearLastLoginError_Parms
{
