/*
#############################################################################################
# Smite (v3.24.3804.2) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TgClientBase_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct TgClientBase.TgGameUIDispatcher.GameEventListener
// 0x0014
struct FGameEventListener
{
	int                                                nEventId;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	class UObject*                                     pScope;                                           		// 0x0004 (0x0008) [0x0000000000000000]              
	struct FName                                       nmCallback;                                       		// 0x000C (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgAcquisitionManager.EventAssociation
// 0x000C
struct FEventAssociation
{
	int                                                nEventId;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                nEventChapter;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned long                                      bIsReward : 1;                                    		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgClientBase.TgPlayerNameManager.TgPlayerId
// 0x0024
struct FTgPlayerId
{
	struct FUniqueNetId                                m_UserId;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FString                                     m_sAltId;                                         		// 0x0008 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct Fdword                                      m_nType;                                          		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FQWord                                      m_nPlayerId;                                      		// 0x001C (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgAcquisitionManager.SmiteAcquisition
// 0x0060
struct FSmiteAcquisition
{
	int                                                nSourceId;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                nFailureMsgId;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nItemId;                                          		// 0x0008 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nLootId;                                          		// 0x000C (0x0004) [0x0000000000000000]              
	struct Fdword                                      nLootTableId;                                     		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                nRecipeItemType;                                  		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                nItemType;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                nSubItemType;                                     		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                nEventFlags;                                      		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                nFillQuantity;                                    		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                nLootQuantity;                                    		// 0x0028 (0x0004) [0x0000000000000000]              
	int                                                nTotalQuantity;                                   		// 0x002C (0x0004) [0x0000000000000000]              
	unsigned long                                      bSuccess : 1;                                     		// 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bQuietFailures : 1;                               		// 0x0030 (0x0004) [0x0000000000000000] [0x00000002] 
	struct FTgPlayerId                                 nGiftPlayerId;                                    		// 0x0034 (0x0024) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FQWord                                      qwCustomData;                                     		// 0x0058 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgAcquisitionManager.UIQueuedAcquisition
// 0x0080
struct FUIQueuedAcquisition
{
	int                                                nType;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                nSubType;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FEventAssociation                           EventAssociation;                                 		// 0x0008 (0x000C) [0x0000000000000000]              
	int                                                nQuantity;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  pObject;                                          		// 0x0018 (0x0008) [0x0000000000000000]              
	struct FSmiteAcquisition                           Acquisition;                                      		// 0x0020 (0x0060) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgPlayerNameManager.TgProfileDelegatesBuffer
// 0x0020
struct FTgProfileDelegatesBuffer
{
	TArray< struct FString >                           arrIdList;                                        		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct FScriptDelegate >                   arrDelegates;                                     		// 0x0010 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgPlayerNameManager.TgPidIndexPair
// 0x0008
struct FTgPidIndexPair
{
	struct Fdword                                      nPid;                                             		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                nIndex;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgPlayerNameManager.TgUserId
// 0x000C
struct FTgUserId
{
	unsigned char                                      Type;                                             		// 0x0000 (0x0001) [0x0000000000000000]              
	struct FQWord                                      Uid;                                              		// 0x0004 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgPlayerNameManager.TgUidIndexPair
// 0x0010
struct FTgUidIndexPair
{
	struct FTgUserId                                   Uid;                                              		// 0x0000 (0x000C) [0x0000000000000000]              
	int                                                nIndex;                                           		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgPlayerNameManager.TgPlayerNameMap
// 0x003C
struct FTgPlayerNameMap
{
	TArray< struct FTgPidIndexPair >                   arrPidLookup;                                     		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct FTgUidIndexPair >                   arrUidLookup;                                     		// 0x0010 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           arrNames;                                         		// 0x0020 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                nSortedPid;                                       		// 0x0030 (0x0004) [0x0000000000000000]              
	int                                                nSortedUid;                                       		// 0x0034 (0x0004) [0x0000000000000000]              
	int                                                nSortedNames;                                     		// 0x0038 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgChangeHudSectionEvent.TgHudSectionInfo
// 0x0040
struct FTgHudSectionInfo
{
	struct FString                                     sSection;                                         		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sDockObj;                                         		// 0x0010 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	float                                              nPercentX;                                        		// 0x0020 (0x0004) [0x0000000000000000]              
	float                                              nPercentY;                                        		// 0x0024 (0x0004) [0x0000000000000000]              
	float                                              nScale;                                           		// 0x0028 (0x0004) [0x0000000000000000]              
	float                                              nDockX;                                           		// 0x002C (0x0004) [0x0000000000000000]              
	float                                              nDockY;                                           		// 0x0030 (0x0004) [0x0000000000000000]              
	float                                              nDockObjX;                                        		// 0x0034 (0x0004) [0x0000000000000000]              
	float                                              nDockObjY;                                        		// 0x0038 (0x0004) [0x0000000000000000]              
	unsigned long                                      bOutX : 1;                                        		// 0x003C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bOutY : 1;                                        		// 0x003C (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct TgClientBase.TgGFxObject.Rect
// 0x0010
struct FRect
{
	struct FVector2D                                   vecMin;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FVector2D                                   vecMax;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgGFxObject.GFxEventData
// 0x002C
struct FGFxEventData
{
	class UGFxObject*                                  _this;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  Target;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
	struct FName                                       Type;                                             		// 0x0010 (0x0008) [0x0000000000000000]              
	int                                                Data;                                             		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                mouseIndex;                                       		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                Button;                                           		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                Index;                                            		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                lastIndex;                                        		// 0x0028 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgDataChunk.DataField
// 0x0050
struct FDataField
{
	struct FPointer                                    FieldName;                                        		// 0x0000 (0x0008) [0x0000000000001000]              ( CPF_Native )
	int                                                nNameLen;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FASValue                                    Value;                                            		// 0x000C (0x0020) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FASValue                                    Last;                                             		// 0x002C (0x0020) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bDirty : 1;                                       		// 0x004C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgClientBase.TgDataChunk.TgDataFieldHandle
// 0x0004
struct FTgDataFieldHandle
{
	int                                                Index;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgClientHUD.SceneInfo
// 0x0018
struct FSceneInfo
{
	unsigned long                                      bWorkInProgress : 1;                              		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                nUIType;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FString                                     sPath;                                            		// 0x0008 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgDataHandler.TgChunkUpdateQueue
// 0x0011
struct FTgChunkUpdateQueue
{
	TArray< class UTgDataChunk* >                      arrChunks;                                        		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	unsigned char                                      fUpdateDelay;                                     		// 0x0010 (0x0001) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgDeferredTask.TgDeferProgress
// 0x0014
struct FTgDeferProgress
{
	float                                              nProgress;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     sStepLabel;                                       		// 0x0004 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgIntervalManager.TgIntervalHandle
// 0x0010
struct FTgIntervalHandle
{
	struct FQWord                                      nId;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
	class UTgIntervalManager*                          pOwner;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgIntervalManager.TgIntervalEntry
// 0x0028
struct FTgIntervalEntry
{
	int                                                nLoopValue;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                nRepeatStep;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nDuration;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FQWord                                      nTime;                                            		// 0x000C (0x0008) [0x0000000000000000]              
	struct FScriptDelegate                             delCallback;                                      		// 0x0014 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0018 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	unsigned long                                      bRemove : 1;                                      		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgClientBase.TgDeferManager.TgDeferTaskData
// 0x001C
struct FTgDeferTaskData
{
	class UTgDeferredTask*                             pTask;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FTgDeferProgress                            LastProgress;                                     		// 0x0008 (0x0014) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgDeferManager.TgDeferEntry
// 0x0034
struct FTgDeferEntry
{
	struct FTgDeferTaskData                            Task;                                             		// 0x0000 (0x001C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             delCallback;                                      		// 0x001C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0020 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	class UClass*                                      pOwnerClass;                                      		// 0x002C (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgMoviePlayer.TgPurchaseRequest
// 0x0028
struct FTgPurchaseRequest
{
	int                                                nLootTableItemId;                                 		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                nVendorId;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                nPriceInUI;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                nCurrencyType;                                    		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                nQuantity;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                nLocationId;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                nCouponId;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                nGiftPlayerId;                                    		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                nGiftMsgIndex;                                    		// 0x0020 (0x0004) [0x0000000000000000]              
	unsigned long                                      bIsAnonGift : 1;                                  		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgClientBase.TgMoviePlayer.TgLobbyStates
// 0x0010
struct FTgLobbyStates
{
	int                                                GameState;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                LobbyState;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                QueueState;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                HudState;                                         		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgMoviePlayer.SysCounterData
// 0x0008
struct FSysCounterData
{
	int                                                CounterId;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                CounterCount;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgMoviePlayer.WidgetBinding
// 0x0010
struct FWidgetBinding
{
	struct FName                                       m_WidgetName;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  m_Widget;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgMoviePlayer.PendingChatMessage
// 0x0020
struct FPendingChatMessage
{
	struct FString                                     m_sRecipient;                                     		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sMsg;                                           		// 0x0010 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgMoviePlayer.UIChangeStruct
// 0x0010
struct FUIChangeStruct
{
	class AActor*                                      refActor;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	unsigned char                                      uiEvent;                                          		// 0x0008 (0x0001) [0x0000000000000000]              
	int                                                subType;                                          		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgMoviePlayer.LastMatchMember
// 0x0028
struct FLastMatchMember
{
	int                                                nBotId;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FTgPlayerId                                 pid;                                              		// 0x0004 (0x0024) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgMoviePlayer.LastPartiedMember
// 0x0014
struct FLastPartiedMember
{
	int                                                m_playerId;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     m_playerName;                                     		// 0x0004 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgMoviePlayer.CardTextureWidget
// 0x0058
struct FCardTextureWidget
{
	class UGFxObject*                                  Widget;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                nItemId;                                          		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                nUniqueId;                                        		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              X;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              Y;                                                		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              fWidth;                                           		// 0x0018 (0x0004) [0x0000000000000000]              
	float                                              fHeight;                                          		// 0x001C (0x0004) [0x0000000000000000]              
	float                                              fTimeSinceCreation;                               		// 0x0020 (0x0004) [0x0000000000000000]              
	unsigned long                                      bLoaded : 1;                                      		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     sCardMIC;                                         		// 0x0028 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     sTexture;                                         		// 0x0038 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UMaterialInstanceConstant*                   cardMIC;                                          		// 0x0048 (0x0008) [0x0000000000000000]              
	class UTexture2D*                                  Texture;                                          		// 0x0050 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgMoviePlayer.LeaderboardOpenData
// 0x0018
struct FLeaderboardOpenData
{
	struct FString                                     sName;                                            		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                nValue;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                nOption;                                          		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgMoviePlayer.InputSensitiveComponent
// 0x0014
struct FInputSensitiveComponent
{
	class UObject*                                     pOwner;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  pObj;                                             		// 0x0008 (0x0008) [0x0000000000000000]              
	unsigned long                                      bGamepad : 1;                                     		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgClientBase.TgMoviePlayer.RecentlyInvitedPlayers
// 0x002C
struct FRecentlyInvitedPlayers
{
	struct FTgPlayerId                                 pid;                                              		// 0x0000 (0x0024) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FQWord                                      nTimeSecs;                                        		// 0x0024 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgMoviePlayer.IntStringPair
// 0x0014
struct FIntStringPair
{
	int                                                nNumber;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     sString;                                          		// 0x0004 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgMoviePlayer.NavParams
// 0x0024
struct FNavParams
{
	unsigned char                                      eNavId;                                           		// 0x0000 (0x0001) [0x0000000000000000]              
	struct Fdword                                      eEventId;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      eReturnToNavId;                                   		// 0x0008 (0x0001) [0x0000000000000000]              
	struct Fdword                                      eReturnToEventId;                                 		// 0x000C (0x0004) [0x0000000000000000]              
	class UTgDataItem*                                 pNavData;                                         		// 0x0010 (0x0008) [0x0000000000000000]              
	class UTgDataItem*                                 pReturnToData;                                    		// 0x0018 (0x0008) [0x0000000000000000]              
	unsigned long                                      bForce : 1;                                       		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgClientBase.TgMoviePlayer.TgReferralEntry
// 0x0030
struct FTgReferralEntry
{
	struct FTgPlayerId                                 pid;                                              		// 0x0000 (0x0024) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UTgGFxPlayerData*                            pPlayerData;                                      		// 0x0024 (0x0008) [0x0000000000000000]              
	int                                                externalReferralId;                               		// 0x002C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgMoviePlayer.TgNavProperties
// 0x0009
struct FTgNavProperties
{
	unsigned char                                      eNavId;                                           		// 0x0000 (0x0001) [0x0000000000000000]              
	unsigned long                                      bIsPopup : 1;                                     		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bManuallySetsCamera : 1;                          		// 0x0004 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned char                                      eCameraTarget;                                    		// 0x0008 (0x0001) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgMoviePlayer.TgReportPlayer
// 0x0044
struct FTgReportPlayer
{
	struct Fdword                                      nReasonCode;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nPlayerCount;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nReporterTaskForce;                               		// 0x0008 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nReportedPlayerTaskForce;                         		// 0x000C (0x0004) [0x0000000000000000]              
	struct FTgPlayerId                                 pidToReport;                                      		// 0x0010 (0x0024) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     sReason;                                          		// 0x0034 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgPagePopup.PopupResponse
// 0x0018
struct FPopupResponse
{
	unsigned long                                      m_bHandled : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                nResponse;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	TArray< struct FString >                           arrInputs;                                        		// 0x0008 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgEsportsManager.TgEsportsEventTeam
// 0x0010
struct FTgEsportsEventTeam
{
	struct Fdword                                      nEventTeamId;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nTeamId;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FPointer                                    pEvent;                                           		// 0x0008 (0x0008) [0x0000000000001000]              ( CPF_Native )
};

// ScriptStruct TgClientBase.TgEsportsManager.TgEsportsEvent
// 0x0034
struct FTgEsportsEvent
{
	struct Fdword                                      nEventId;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     sName;                                            		// 0x0004 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct Fdword                                      nEventType;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FQWord                                      nStartDate;                                       		// 0x0018 (0x0008) [0x0000000000000000]              
	TArray< struct FTgEsportsEventTeam >               arrEventTeams;                                    		// 0x0020 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct Fdword                                      nTourneyPickEventTeamId;                          		// 0x0030 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgEsportsManager.TgEsportsMatch
// 0x0038
struct FTgEsportsMatch
{
	struct Fdword                                      nMatchId;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FPointer                                    pGroup;                                           		// 0x0004 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct Fdword                                      nEventTypeValue;                                  		// 0x000C (0x0004) [0x0000000000000000]              
	struct Fdword                                      nRoundTypeValue;                                  		// 0x0010 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nWinnerId;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FQWord                                      nStartDate;                                       		// 0x0018 (0x0008) [0x0000000000000000]              
	struct FQWord                                      nEndDate;                                         		// 0x0020 (0x0008) [0x0000000000000000]              
	struct FString                                     sUrl;                                             		// 0x0028 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgEsportsManager.TgEsportsMatchGroup
// 0x004C
struct FTgEsportsMatchGroup
{
	struct Fdword                                      nSeasonId;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nEventId;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nGroupId;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FQWord                                      nStartDate;                                       		// 0x000C (0x0008) [0x0000000000000000]              
	struct FQWord                                      nEndDate;                                         		// 0x0014 (0x0008) [0x0000000000000000]              
	struct Fdword                                      nVotedFor;                                        		// 0x001C (0x0004) [0x0000000000000000]              
	struct Fdword                                      nNextMatchId;                                     		// 0x0020 (0x0004) [0x0000000000000000]              
	struct Fdword                                      arrTeams[ 0x2 ];                                  		// 0x0024 (0x0008) [0x0000000000000000]              
	struct Fdword                                      arrScores[ 0x2 ];                                 		// 0x002C (0x0008) [0x0000000000000000]              
	struct Fdword                                      arrGlobalPickCounts[ 0x2 ];                       		// 0x0034 (0x0008) [0x0000000000000000]              
	TArray< struct FTgEsportsMatch >                   arrMatches;                                       		// 0x003C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgEsportsManager.TgEsportsWinBreakdown
// 0x0008
struct FTgEsportsWinBreakdown
{
	struct Fdword                                      nTeamId;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nWins;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgEsportsManager.TgEsportsStats
// 0x002C
struct FTgEsportsStats
{
	struct Fdword                                      nSeasonId;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nTeamId;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nMatchCount;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nWins;                                            		// 0x000C (0x0004) [0x0000000000000000]              
	struct Fdword                                      nLosses;                                          		// 0x0010 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nWinLossPercentage;                               		// 0x0014 (0x0004) [0x0000000000000000]              
	TArray< struct FTgEsportsWinBreakdown >            arrWinsBreakdown;                                 		// 0x0018 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct Fdword                                      nRank;                                            		// 0x0028 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgEsportsManager.TgEsportsIconHandle
// 0x0010
struct FTgEsportsIconHandle
{
	struct FString                                     sId;                                              		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgEsportsManager.TgEsportsTeam
// 0x0094
struct FTgEsportsTeam
{
	struct Fdword                                      nTeamId;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nSortOrder;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nRank;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
	struct Fdword                                      nWinLossPercentage;                               		// 0x000C (0x0004) [0x0000000000000000]              
	struct FString                                     sColor;                                           		// 0x0010 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sName;                                            		// 0x0020 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sShortName;                                       		// 0x0030 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sTagLine;                                         		// 0x0040 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sLeagueTag;                                       		// 0x0050 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FTgEsportsIconHandle                        Icon;                                             		// 0x0060 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FTgEsportsIconHandle                        Banner;                                           		// 0x0070 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bIsActive : 1;                                    		// 0x0080 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bSwcTeam : 1;                                     		// 0x0080 (0x0004) [0x0000000000000000] [0x00000002] 
	TArray< struct Fdword >                            arrPurchaseLTIs;                                  		// 0x0084 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgEsportsManager.TgLocalizationRef
// 0x0030
struct FTgLocalizationRef
{
	struct FString                                     sKey;                                             		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     sSection;                                         		// 0x0010 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     sPackage;                                         		// 0x0020 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgEsportsManager.TgEsportsTeamConfig
// 0x0078
struct FTgEsportsTeamConfig
{
	int                                                nTeamId;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     sColor;                                           		// 0x0004 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     sIcon;                                            		// 0x0014 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FTgLocalizationRef                          locTagLine;                                       		// 0x0024 (0x0030) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      arrTeamItems;                                     		// 0x0054 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     sLeagueTag;                                       		// 0x0064 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bSwcTeam : 1;                                     		// 0x0074 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgClientBase.TgEsportsManager.TgEsportsRosterMember
// 0x0024
struct FTgEsportsRosterMember
{
	struct FString                                     sName;                                            		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sPosition;                                        		// 0x0010 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	unsigned long                                      bLeader : 1;                                      		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgClientBase.TgEsportsManager.TgEsportsRosterTeams
// 0x0014
struct FTgEsportsRosterTeams
{
	int                                                nTeamId;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	TArray< struct FTgEsportsRosterMember >            Members;                                          		// 0x0004 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgEsportsManager.TgEsportsFeaturedPanelData
// 0x0040
struct FTgEsportsFeaturedPanelData
{
	struct FString                                     sLargeText;                                       		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     sSmallText;                                       		// 0x0010 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     sImagePath;                                       		// 0x0020 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     sId;                                              		// 0x0030 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgGameDC_Chat.QueueMessage
// 0x0030
struct FQueueMessage
{
	int                                                Id;                                               		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned char                                      Priority;                                         		// 0x0004 (0x0001) [0x0000000000000000]              
	unsigned long                                      bHasPlayedSound : 1;                              		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                VoicePackId;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                VoiceBotId;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                VoiceSkinId;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FString                                     VoicePackCustomSuffix;                            		// 0x0018 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	class USoundCue*                                   SoundCue;                                         		// 0x0028 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgGameDC_Chat.MessageToken
// 0x001C
struct FMessageToken
{
	int                                                msgId;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                MsgIdRed;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                MsgIdBlue;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FString                                     Token;                                            		// 0x000C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClientBase.TgGameDC_Game.TgGameDCGameHandles
// 0x0054
struct FTgGameDCGameHandles
{
	struct FTgDataFieldHandle                          ActivePointA;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          ActivePointB;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          ActivePointC;                                     		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          CapturePercentA;                                  		// 0x000C (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          CapturePercentB;                                  		// 0x0010 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          CapturePercentC;                                  		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          DescriptionString;                                		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          EnemyTaskForceCount;                              		// 0x001C (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          EomMessageId;                                     		// 0x0020 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          FogGrowTime;                                      		// 0x0024 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          FogNextPhase;                                     		// 0x0028 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          GameTimerState;                                   		// 0x002C (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          GameType;                                         		// 0x0030 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          MapBackgroundTexture;                             		// 0x0034 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          OnPoint;                                          		// 0x0038 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          PauseTaskForce;                                   		// 0x003C (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          PauseType;                                        		// 0x0040 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          PauseDuration;                                    		// 0x0044 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          RoundNumber;                                      		// 0x0048 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          RoundTitle;                                       		// 0x004C (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          ShowObjectives;                                   		// 0x0050 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgGameDC_Player.TgGameDC_PlayerEffectEntry
// 0x0011
struct FTgGameDC_PlayerEffectEntry
{
	class UGFxObject*                                  EffectObject;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              TimeRemaining;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                nEffectGroupId;                                   		// 0x000C (0x0004) [0x0000000000000000]              
	unsigned char                                      byNumStacks;                                      		// 0x0010 (0x0001) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgGameDC_Player.TgGameDC_DeviceEntry
// 0x0020
struct FTgGameDC_DeviceEntry
{
	class UGFxObject*                                  DeviceObject;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                CurrentDeviceId;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              Cooldown;                                         		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              CooldownMax;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                DeviceCount;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
	unsigned char                                      DeviceTier;                                       		// 0x0018 (0x0001) [0x0000000000000000]              
	unsigned long                                      bIsDeviceReady : 1;                               		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgClientBase.TgGameDC_LocalPlayer.TgGameDCPlayerHandles
// 0x0030
struct FTgGameDCPlayerHandles
{
	struct FTgDataFieldHandle                          AutoPurchase;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          AutoSkill;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          CourierCurrency;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          CourierItemId;                                    		// 0x000C (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          CourierPhase;                                     		// 0x0010 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          CourierTransactionType;                           		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          MostPopularItemsSize;                             		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          SpectatorVisibilityMode;                          		// 0x001C (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          nTaskForce;                                       		// 0x0020 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          TutorialActivesDisabled;                          		// 0x0024 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          TutorialSkillsDisabled;                           		// 0x0028 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          TutorialStoreDisabled;                            		// 0x002C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClientBase.TgGameDC_LocalPlayer.TgGameDCPlayerData
// 0x0004
struct FTgGameDCPlayerData
{
	unsigned long                                      bDisableSkills : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bDisableActives : 1;                              		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bDisableStore : 1;                                		// 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct TgClientBase.TgGameDC_PlayerVitals.TgDCPlayerVitalsHandles
// 0x0080
struct FTgDCPlayerVitalsHandles
{
	struct FTgDataFieldHandle                          Accuracy;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          AltReticule;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          AuxiliaryPool;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          AuxiliaryPoolMax;                                 		// 0x000C (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          AuxiliaryPoolType;                                		// 0x0010 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          BuybackAmount;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          CapPercent;                                       		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          CapPercentMax;                                    		// 0x001C (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          Currency;                                         		// 0x0020 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          CurrentLevel;                                     		// 0x0024 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          CurrentXP;                                        		// 0x0028 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          DevicePointsAvail;                                		// 0x002C (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          Heading;                                          		// 0x0030 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          Health;                                           		// 0x0034 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          HealthMax;                                        		// 0x0038 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          IsPlayerInVolume;                                 		// 0x003C (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          NextLevel;                                        		// 0x0040 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          nPassiveData1;                                    		// 0x0044 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          bPassiveData1;                                    		// 0x0048 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          sPassiveData1;                                    		// 0x004C (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          nPassiveData2;                                    		// 0x0050 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          fPassiveData1;                                    		// 0x0054 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          PowerPool;                                        		// 0x0058 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          PowerPoolMax;                                     		// 0x005C (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          PowerPoolType;                                    		// 0x0060 (0x0004) [0x0000000000000000]              
	struct FTgDataFieldHandle                          PowerPoolUsing;                                   		// 0x0064 (0x0004) [0x0000000000000000]              
