/*
#############################################################################################
# Smite (v3.24.3804.2) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TgClientBase_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_ACQUISUTION_MANAGER_CHECK_FOR_ACQUISITON_POP       5.f
#define CONST_ACQUISUTION_MANAGER_CLUMP_TIMER                    0.5f
#define CONST_PROFILE_REQUEST_INTERVAL                           3
#define CONST_PROFILE_REQUEST_BUFFER_COUNT                       2
#define CONST_CHAT_FLAG_FEEDBACK                                 0x00000001
#define CONST_CHAT_FLAG_VGS                                      0x00000002
#define CONST_CHAT_FLAG_ONLY_OPEN                                0x00000004
#define CONST_CHAT_FLAG_IS_NEW                                   0x00000008

	ESMT_Unlock                                        = 1,
	ESMT_Clan                                          = 2,
	ESMT_Achievement                                   = 3,
	ESMT_Party                                         = 4,
	ESMT_Friend                                        = 5,
	ESMT_MAX                                           = 6
};*/

// Enum TgClientBase.TgSystemNotifManagerBase.ESystemMessageSubType
/*enum ESystemMessageSubType
{
	ESMST_None                                         = 0,
	ESMST_Quest                                        = 1,
	ESMST_Commendation                                 = 2,
	ESMST_GMSay                                        = 3,
	ESMST_FriendInvite                                 = 4,
	ESMST_PartyInvite                                  = 5,
	ESMST_ClanInvite                                   = 6,
	ESMST_MAX                                          = 7
};*/

// Enum TgClientBase.TgSystemNotifManagerBase.ENotificationType
/*enum ENotificationType
{
	ENT_Party                                          = 0,
	ENT_MESSAGE                                        = 1,
	ENT_QueueInvite                                    = 2,
	ENT_FriendInvite                                   = 3,
	ENT_ClanInvite                                     = 4,
	ENT_MAX                                            = 5
};*/

// Enum TgClientBase.TgSystemNotifManagerBase.ESystemMessageState
/*enum ESystemMessageState
{
	ESMS_None                                          = 0,
	ESMS_Active                                        = 1,
	ESMS_Expired                                       = 2,
	ESMS_Accepted                                      = 3,
	ESMS_Rejected                                      = 4,
	ESMS_MAX                                           = 5
};*/

// Enum TgClientBase.TgUIServerStates.EStateQueuePrivilegeState
/*enum EStateQueuePrivilegeState
{
	SQPS_None                                          = 0,
	SQPS_Pending                                       = 1,
	SQPS_Denied                                        = 2,
	SQPS_MAX                                           = 3
};*/

// Enum TgClientBase.TgUIServerStates.EServerStateForceUpdate
/*enum EServerStateForceUpdate
{
	SSFU_QueueStateUpdate                              = 0,
	SSFU_MatchStateUpdate                              = 1,
	SSFU_LobbyStateUpdate                              = 2,
	SSFU_MAX                                           = 3
};*/

// Enum TgClientBase.TgGFxMorePoints.EMorePointsActions
/*enum EMorePointsActions
{
	EMPA_None                                          = 0,
	EMPA_ItemGoto                                      = 1,
	EMPA_ItemUnlock                                    = 2,
	EMPA_MAX                                           = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class TgClientBase.TgAcquistionEvent
// 0x0080 (0x00F4 - 0x0074)
class UTgAcquistionEvent : public UTgEventDataItem
{
public:
	struct FUIQueuedAcquisition                        pAcq;                                             		// 0x0074 (0x0080) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 4826 );

		return pClassPointer;
	};

};

UClass* UTgAcquistionEvent::pClassPointer = NULL;

// Class TgClientBase.TgAcquistionNotificationEvent
// 0x0008 (0x007C - 0x0074)
class UTgAcquistionNotificationEvent : public UTgEventDataItem
{
public:
	struct FPointer                                    pAcq;                                             		// 0x0074 (0x0008) [0x0000000000001000]              ( CPF_Native )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 4827 );

		return pClassPointer;
	};

};

UClass* UTgAcquistionNotificationEvent::pClassPointer = NULL;

// Class TgClientBase.TgAnnouncerPreviewer
// 0x0010 (0x0070 - 0x0060)
class UTgAnnouncerPreviewer : public UObject
{
public:
	class UTgManifestGroup*                            c_AssetManifestGroup;                             		// 0x0060 (0x0008) [0x0000000004400008]              ( CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	struct FName                                       m_AnnouncerResName;                               		// 0x0068 (0x0008) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 4828 );

		return pClassPointer;
	};

	void PreviewAnnouncerByItemId ( int nItemId, unsigned long bAsync );
	void OnAnnouncerLoaded ( );
	void Init ( );
};

UClass* UTgAnnouncerPreviewer::pClassPointer = NULL;

// Class TgClientBase.TgMoviePlayer
// 0x0760 (0x0958 - 0x01F8)
class UTgMoviePlayer : public UGFxMoviePlayer
{
public:
	struct FPointer                                    VfTable_ITgIntervalInterface;                     		// 0x01F8 (0x0008) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	TArray< struct FInputSensitiveComponent >          RegisteredInputSensitiveComponents;               		// 0x0200 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FMultiMap_Mirror                            RegisteredObjects;                                		// 0x0210 (0x0048) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	struct FMultiMap_Mirror                            RegisteredScenes;                                 		// 0x0258 (0x0048) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	struct FMultiMap_Mirror                            RegisteredDataChunks;                             		// 0x02A0 (0x0048) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	struct FPointer                                    MarLobbyPlayback;                                 		// 0x02E8 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FPointer                                    PkgLobbyPlayback;                                 		// 0x02F0 (0x0008) [0x0000000000001000]              ( CPF_Native )
	class APComVideoPlayer*                            m_PComVideoPlayer;                                		// 0x02F8 (0x0008) [0x0000000000000000]              
	struct FPointer                                    m_ConfigManager;                                  		// 0x0300 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FString                                     GodPackOwnershipId;                               		// 0x0308 (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	int                                                m_eButtonPromptSetting;                           		// 0x0318 (0x0004) [0x0000000000000000]              
	struct FName                                       ButtonPromptName;                                 		// 0x031C (0x0008) [0x0000000000000000]              
	unsigned long                                      m_bShownIntroMovie : 1;                           		// 0x0324 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bShownLoginBlocker : 1;                         		// 0x0324 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bShownPublicSystemMessages : 1;                 		// 0x0324 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      m_bShownPatchOverview : 1;                        		// 0x0324 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      m_bIsListeningForVivoxBtn : 1;                    		// 0x0324 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      m_bRenderGammaControls : 1;                       		// 0x0324 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      m_bHasNoPlayer : 1;                               		// 0x0324 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      m_bAllowAllChat : 1;                              		// 0x0324 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      m_bLeaver : 1;                                    		// 0x0324 (0x0004) [0x0000000000000000] [0x00000100] 
	unsigned long                                      m_bPrintClanPlayerInvites : 1;                    		// 0x0324 (0x0004) [0x0000000000000000] [0x00000200] 
	unsigned long                                      m_bShouldNotKillSeasonalMusic : 1;                		// 0x0324 (0x0004) [0x0000000000000000] [0x00000400] 
	unsigned long                                      isNoItemPopup : 1;                                		// 0x0324 (0x0004) [0x0000000000000000] [0x00000800] 
	unsigned long                                      isMatchLobbyTrade : 1;                            		// 0x0324 (0x0004) [0x0000000000000000] [0x00001000] 
	unsigned long                                      disableNoItemPopup : 1;                           		// 0x0324 (0x0004) [0x0000000000000000] [0x00002000] 
	unsigned long                                      m_bHUDVisible : 1;                                		// 0x0324 (0x0004) [0x0000000000000000] [0x00004000] 
	unsigned long                                      m_bPrevLeader : 1;                                		// 0x0324 (0x0004) [0x0000000000000000] [0x00008000] 
	unsigned long                                      m_isPlayingTutorial : 1;                          		// 0x0324 (0x0004) [0x0000000000000000] [0x00010000] 
	unsigned long                                      m_bLoginComplete : 1;                             		// 0x0324 (0x0004) [0x0000000000000000] [0x00020000] 
	unsigned long                                      m_bAllShopVendorsReceived : 1;                    		// 0x0324 (0x0004) [0x0000000000000000] [0x00040000] 
	unsigned long                                      m_bWaitingForAllShopVendors : 1;                  		// 0x0324 (0x0004) [0x0000000000000000] [0x00080000] 
	unsigned long                                      m_bEnableShopVendorTimer : 1;                     		// 0x0324 (0x0004) [0x0000000000000000] [0x00100000] 
	unsigned long                                      m_bFailedBatchPurchase : 1;                       		// 0x0324 (0x0004) [0x0000000000000000] [0x00200000] 
	unsigned long                                      m_HideEOMLTriumph : 1;                            		// 0x0324 (0x0004) [0x0000000000000000] [0x00400000] 
	unsigned long                                      m_bInLoginQueue : 1;                              		// 0x0324 (0x0004) [0x0000000000000000] [0x00800000] 
	unsigned long                                      m_bQueueStatsRequestOutstanding : 1;              		// 0x0324 (0x0004) [0x0000000000000000] [0x01000000] 
	unsigned long                                      m_bInAccountLinkingProcess : 1;                   		// 0x0324 (0x0004) [0x0000000000000000] [0x02000000] 
	unsigned long                                      m_bInitialized : 1;                               		// 0x0324 (0x0004) [0x0000000000000000] [0x04000000] 
	unsigned long                                      m_bInTransition : 1;                              		// 0x0324 (0x0004) [0x0000000000000000] [0x08000000] 
	unsigned long                                      m_bResizeForSafeZones : 1;                        		// 0x0324 (0x0004) [0x0000000000000000] [0x10000000] 
	unsigned long                                      c_bChatReady : 1;                                 		// 0x0324 (0x0004) [0x0000000000000000] [0x20000000] 
	unsigned long                                      m_bFriendlyWon : 1;                               		// 0x0324 (0x0004) [0x0000000000000000] [0x40000000] 
	unsigned long                                      m_bTutorialPlayed : 1;                            		// 0x0324 (0x0004) [0x0000000000000000] [0x80000000] 
	unsigned long                                      m_bAutoQueueIntoPractice : 1;                     		// 0x0328 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bPartySelectState : 1;                          		// 0x0328 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bHasLoadedTeamNames : 1;                        		// 0x0328 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      m_bConfigManagerProcessed : 1;                    		// 0x0328 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      m_bShowingEmailPopup : 1;                         		// 0x0328 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      m_bMatchCheck : 1;                                		// 0x0328 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      m_bWaitingForReferralEntries : 1;                 		// 0x0328 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      m_bAttemptingToJoinTutorial : 1;                  		// 0x0328 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      m_bHasTutorialAttemptTimeout : 1;                 		// 0x0328 (0x0004) [0x0000000000000000] [0x00000100] 
	unsigned long                                      m_PlayingIntroVideo : 1;                          		// 0x0328 (0x0004) [0x0000000000000000] [0x00000200] 
	unsigned long                                      m_bForcingPSPlus : 1;                             		// 0x0328 (0x0004) [0x0000000000000000] [0x00000400] 
	unsigned long                                      m_bListeningForInputConfirm : 1;                  		// 0x0328 (0x0004) [0x0000000000000000] [0x00000800] 
	unsigned long                                      m_bUseExperimentalHud : 1;                        		// 0x0328 (0x0004) [0x0000000000000000] [0x00001000] 
	struct FTgPlayerId                                 m_PlayerLookup;                                   		// 0x032C (0x0024) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UTgVendorData*                               m_VendorData;                                     		// 0x0350 (0x0008) [0x0000000000000000]              
	class UTgBrowserManager*                           m_WebBrowser;                                     		// 0x0358 (0x0008) [0x0000000000000000]              
	TArray< struct FPendingChatMessage >               m_PendingMessages;                                		// 0x0360 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FTgPlayerId >                       m_ChatMessagePlayerIds;                           		// 0x0370 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      m_QueuedAchievementId;                            		// 0x0380 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                m_nQueuedBattlePassLevel;                         		// 0x0390 (0x0004) [0x0000000000000000]              
	struct FQWord                                      m_nLastMessageTime;                               		// 0x0394 (0x0008) [0x0000000000000000]              
	int                                                m_nReturnToNavigationAction;                      		// 0x039C (0x0004) [0x0000000000000000]              
	int                                                m_nReturnToId;                                    		// 0x03A0 (0x0004) [0x0000000000000000]              
	int                                                m_currentPurchaseId;                              		// 0x03A4 (0x0004) [0x0000000000000000]              
	int                                                m_nCurrentPurchaseQuantity;                       		// 0x03A8 (0x0004) [0x0000000000000000]              
	class UTextureRenderTarget2D*                      m_RenderTarget;                                   		// 0x03AC (0x0008) [0x0000000000000000]              
	int                                                m_nAutoNavToPurchasedIndex;                       		// 0x03B4 (0x0004) [0x0000000000000000]              
	int                                                m_nAutoNavToRewardIndex;                          		// 0x03B8 (0x0004) [0x0000000000000000]              
	int                                                m_activityRedirectId;                             		// 0x03BC (0x0004) [0x0000000000000000]              
	int                                                m_goalRedirectId;                                 		// 0x03C0 (0x0004) [0x0000000000000000]              
	int                                                m_nAutoNavItemId;                                 		// 0x03C4 (0x0004) [0x0000000000000000]              
	struct FString                                     m_sPageAutoTab;                                   		// 0x03C8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_uiDisplayMode;                                  		// 0x03D8 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  _global;                                          		// 0x03DC (0x0008) [0x0000000000000000]              
	float                                              m_fLobbyPlaybackTime;                             		// 0x03E4 (0x0004) [0x0000000000000000]              
	float                                              m_fLobbyNextFireTime;                             		// 0x03E8 (0x0004) [0x0000000000000000]              
	TArray< struct FLastMatchMember >                  m_lastMatchMembers;                               		// 0x03EC (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FLastPartiedMember >                m_lastPartiedMembers;                             		// 0x03FC (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct FRecentlyInvitedPlayers >           m_recentlyInvitedPlayers;                         		// 0x040C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< int >                                      m_PrevParty;                                      		// 0x041C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      m_NewQueueStatus;                                 		// 0x042C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_PrevMatchQueueState;                            		// 0x043C (0x0004) [0x0000000000000000]              
	struct FString                                     m_sSpectateTarget;                                		// 0x0440 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                m_nReplayId;                                      		// 0x0450 (0x0004) [0x0000000000000000]              
	float                                              m_fWaitTimeoutForShopVendors;                     		// 0x0454 (0x0004) [0x0000000000000000]              
	float                                              m_fShopVendorWaitTimer;                           		// 0x0458 (0x0004) [0x0000000000000000]              
	TArray< struct FIntStringPair >                    m_nCachedThemeIds;                                		// 0x045C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct Fdword >                            m_MultiQueueList;                                 		// 0x046C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	float                                              m_fLoginQueueTimer;                               		// 0x047C (0x0004) [0x0000000000000000]              
	float                                              m_fMatchCheckTime;                                		// 0x0480 (0x0004) [0x0000000000000000]              
	float                                              m_fTimerUpdate;                                   		// 0x0484 (0x0004) [0x0000000000000000]              
	float                                              m_fLastQueueStatsRequest;                         		// 0x0488 (0x0004) [0x0000000000000000]              
	TArray< struct FCardTextureWidget >                m_CardWidgets;                                    		// 0x048C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FName >                             GfxObjectBindings;                                		// 0x049C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      m_AutoReinviteList;                               		// 0x04AC (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_AutoReinviteQueueId;                            		// 0x04BC (0x0004) [0x0000000000000000]              
	int                                                m_nClearTransitionTicks;                          		// 0x04C0 (0x0004) [0x0000000000000000]              
	int                                                m_nEventDefaultTab;                               		// 0x04C4 (0x0004) [0x0000000000000000]              
	class UTgEventDispatcher*                          m_pUIDispatcher;                                  		// 0x04C8 (0x0008) [0x0000000004400008]              ( CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	float                                              m_fResumePurchaseRefreshCD;                       		// 0x04D0 (0x0004) [0x0000000000000000]              
	TArray< struct FUIChangeStruct >                   m_UIChangeEvents;                                 		// 0x04D4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FSysCounterData >                   m_CountDatas;                                     		// 0x04E4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FWidgetBinding >                    m_WidgetsBound;                                   		// 0x04F4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FWidgetBinding >                    m_ButtonPromptStackss;                            		// 0x0504 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UTgChatData* >                       m_arrPendingChat;                                 		// 0x0514 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	class UGFxObject*                                  m_mcGlobal;                                       		// 0x0524 (0x0008) [0x0000000000000000]              
	class UTgGFxObject*                                m_mcRoot;                                         		// 0x052C (0x0008) [0x0000000000000000]              
	class UTgDataHandler*                              m_DataHandler;                                    		// 0x0534 (0x0008) [0x0000000000000000]              
	class UTgEventMediator*                            m_EventMediator;                                  		// 0x053C (0x0008) [0x0000000000000000]              
	class UTgSceneManager*                             m_SceneManager;                                   		// 0x0544 (0x0008) [0x0000000000000000]              
	class UTgTimerManager*                             m_TimerManager;                                   		// 0x054C (0x0008) [0x0000000000000000]              
	class UTgPopupManager*                             m_PopupManager;                                   		// 0x0554 (0x0008) [0x0000000000000000]              
	class UTgRewardCenterManagerBase*                  m_RewardCenterManager;                            		// 0x055C (0x0008) [0x0000000000000000]              
	class UTgStreamManagerBase*                        m_StreamManager;                                  		// 0x0564 (0x0008) [0x0000000000000000]              
	class UTgLandingPanelManagerBase*                  m_LandingPanelManager;                            		// 0x056C (0x0008) [0x0000000000000000]              
	class UTgPlayerNameManager*                        m_pPlayerNameManager;                             		// 0x0574 (0x0008) [0x0000000000000000]              
	class UTgAcquisitionManager*                       m_AcquisitionManager;                             		// 0x057C (0x0008) [0x0000000000000000]              
	class UTgSessionVars*                              m_SessionVars;                                    		// 0x0584 (0x0008) [0x0000000000000000]              
	class UTgSystemNotifManagerBase*                   m_SystemNotificationManager;                      		// 0x058C (0x0008) [0x0000000000000000]              
	class UTgDeferManager*                             m_pDeferManager;                                  		// 0x0594 (0x0008) [0x0000000000000000]              
	class UTgUIServerStates*                           m_pUIStateInfo;                                   		// 0x059C (0x0008) [0x0000000000000000]              
	struct FTgIntervalHandle                           m_EndMatchHandle;                                 		// 0x05A4 (0x0010) [0x0000000000000000]              
	class UTgGFxSelection*                             m_pGFxSelection;                                  		// 0x05B4 (0x0008) [0x0000000000000000]              
	class UTgPromptManager*                            m_pPromptManager;                                 		// 0x05BC (0x0008) [0x0000000000000000]              
	class UTgGFxNameDisplayManager*                    m_pNameDisplayManager;                            		// 0x05C4 (0x0008) [0x0000000000000000]              
	class UClass*                                      m_RewardCenterManagerClass;                       		// 0x05CC (0x0008) [0x0000000000000000]              
	class UClass*                                      m_StreamManagerClass;                             		// 0x05D4 (0x0008) [0x0000000000000000]              
	class UClass*                                      m_DataHandlerClass;                               		// 0x05DC (0x0008) [0x0000000000000000]              
	class UClass*                                      m_EventMediatorClass;                             		// 0x05E4 (0x0008) [0x0000000000000000]              
	class UClass*                                      m_SceneManagerClass;                              		// 0x05EC (0x0008) [0x0000000000000000]              
	class UClass*                                      m_MenuManagerClass;                               		// 0x05F4 (0x0008) [0x0000000000000000]              
	class UClass*                                      m_SessionVarsClass;                               		// 0x05FC (0x0008) [0x0000000000000000]              
	int                                                m_nLastTimerIndex;                                		// 0x0604 (0x0004) [0x0000000000000000]              
	int                                                m_nFeedbackType;                                  		// 0x0608 (0x0004) [0x0000000000000000]              
	int                                                m_PrevQueue;                                      		// 0x060C (0x0004) [0x0000000000000000]              
	int                                                m_nVaultIndex;                                    		// 0x0610 (0x0004) [0x0000000000000000]              
	int                                                m_nUGPFavorRefund;                                		// 0x0614 (0x0004) [0x0000000000000000]              
	TArray< int >                                      c_DeferredChannelTabs;                            		// 0x0618 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_LobbyErrorMessage;                              		// 0x0628 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FIntStringPair                              m_LastLoginError;                                 		// 0x0638 (0x0014) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_nFeatureAutoGodId;                              		// 0x064C (0x0004) [0x0000000000000000]              
	int                                                m_nFeatureAutoSkinId;                             		// 0x0650 (0x0004) [0x0000000000000000]              
	int                                                m_nFeatureAutoEmoteId;                            		// 0x0654 (0x0004) [0x0000000000000000]              
	int                                                m_nFeatureAutoWardSkinId;                         		// 0x0658 (0x0004) [0x0000000000000000]              
	int                                                m_nMatchDetailsAutoMatchId;                       		// 0x065C (0x0004) [0x0000000000000000]              
	struct FString                                     m_socialPageAutoTab;                              		// 0x0660 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_rewardCenterTab;                                		// 0x0670 (0x0004) [0x0000000000000000]              
	int                                                m_rewardCenterItemId;                             		// 0x0674 (0x0004) [0x0000000000000000]              
	unsigned char                                      m_nCurrentActionId;                               		// 0x0678 (0x0001) [0x0000000000000000]              
	unsigned char                                      m_nCurrentEventId;                                		// 0x0679 (0x0001) [0x0000000000000000]              
	struct FString                                     m_SpecTeamNameEnemy;                              		// 0x067C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_SpecTeamNameFriendly;                           		// 0x068C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_SpecClanNameFriendly;                           		// 0x069C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_SpecClanNameEnemy;                              		// 0x06AC (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_SpecState;                                      		// 0x06BC (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sGodPackImagePath;                              		// 0x06CC (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                m_nGodTargeterFlags;                              		// 0x06DC (0x0004) [0x0000000000000000]              
	int                                                m_nGodTargeterPrevIndex;                          		// 0x06E0 (0x0004) [0x0000000000000000]              
	int                                                m_nGodTargeterPrevPawnId;                         		// 0x06E4 (0x0004) [0x0000000000000000]              
	struct FString                                     m_sGodTargeterDesc;                               		// 0x06E8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_nMorriganTargeterPrevBotId;                     		// 0x06F8 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  m_nMorriganPassiveMeterTarget;                    		// 0x06FC (0x0008) [0x0000000000000000]              
	int                                                m_nPracticeQueueSkinId;                           		// 0x0704 (0x0004) [0x0000000000000000]              
	struct FTgLobbyStates                              c_PrevStates;                                     		// 0x0708 (0x0010) [0x0000000000000000]              
	struct FTgLobbyStates                              c_CurrStates;                                     		// 0x0718 (0x0010) [0x0000000000000000]              
	class UAlienFXManager*                             m_AlienFX;                                        		// 0x0728 (0x0008) [0x0000000000000000]              
	struct FLeaderboardOpenData                        m_LeaderboardDelayedOptions;                      		// 0x0730 (0x0018) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UTgGfxGameInputInterceptor*                  m_pGameInputIntercept;                            		// 0x0748 (0x0008) [0x0000000000000000]              
	class UTgIntervalManager*                          m_pIntervalManager;                               		// 0x0750 (0x0008) [0x0000000000000000]              
	class UTgEsportsManager*                           m_pESportsManager;                                		// 0x0758 (0x0008) [0x0000000000000000]              
	struct FTgPurchaseRequest                          m_StoredPurchaseRequest;                          		// 0x0760 (0x0028) [0x0000000000000000]              
	float                                              m_fMatchingRemainingTimer;                        		// 0x0788 (0x0004) [0x0000000000000000]              
	float                                              m_fStatusCheckTimer;                              		// 0x078C (0x0004) [0x0000000000000000]              
	int                                                m_friendsAutoView;                                		// 0x0790 (0x0004) [0x0000000000000000]              
	struct FPointer                                    m_pTgCallbackDevice;                              		// 0x0794 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FPointer                                    m_pKeybindLookup;                                 		// 0x079C (0x0008) [0x0000000000001000]              ( CPF_Native )
	float                                              m_fMatchCheckTimer;                               		// 0x07A4 (0x0004) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x48 ];                            		// 0x07A8 (0x0048) UNKNOWN PROPERTY: MapProperty TgClientBase.TgMoviePlayer.m_mapPrivilegeChecks
	struct FTgIntervalEntry                            m_privDelay;                                      		// 0x07F0 (0x0028) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_CustomQueueTarget;                              		// 0x0818 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct Fdword >                            m_cachedGiftsRedeemedIds;                         		// 0x0828 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              m_fBlockBackLockoutTime;                          		// 0x0838 (0x0004) [0x0000000000000000]              
	class UTgVirtualKeyboard*                          m_pVirtualKeyboard;                               		// 0x083C (0x0008) [0x0000000000000000]              
	class UTgGFxItemHelperBinding*                     m_pGFxItemHelper;                                 		// 0x0844 (0x0008) [0x0000000000000000]              
	TArray< struct FTgReferralEntry >                  m_arrReferrals;                                   		// 0x084C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_nTutorialEntryTries;                            		// 0x085C (0x0004) [0x0000000000000000]              
	float                                              m_fLoadHudTimer;                                  		// 0x0860 (0x0004) [0x0000000000000000]              
	TArray< struct FTgNavProperties >                  m_arrNavProperties;                               		// 0x0864 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_cachedFailedJoinChallengeSessionGuid;           		// 0x0874 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_passwordForFailedJoinChallenge;                 		// 0x0884 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UTgAnnouncerPreviewer*                       m_AnnouncerPreview;                               		// 0x0894 (0x0008) [0x0000000000000000]              
	struct FTgReportPlayer                             m_ReportPlayer;                                   		// 0x089C (0x0044) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UOnlineSubsystem*                            OnlineSub;                                        		// 0x08E0 (0x0008) [0x0000000000000000]              
	class UOnlinePlayerInterface*                      PlayerInterface;                                  		// 0x08E8 (0x0010) [0x0000000000000000]              
	unsigned char                                      UnknownData01[ 0x8 ];                             		// 0x08F0 (0x0008) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	class UOnlineGameInterface*                        GameInterface;                                    		// 0x08F8 (0x0010) [0x0000000000000000]              
	unsigned char                                      UnknownData02[ 0x8 ];                             		// 0x0900 (0x0008) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	class UOnlinePlayerInterfaceEx*                    PlayerInterfaceEx;                                		// 0x0908 (0x0010) [0x0000000000000000]              
	unsigned char                                      UnknownData03[ 0x8 ];                             		// 0x0910 (0x0008) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	class UOnlineMarketplaceInterface*                 MarketplaceInterface;                             		// 0x0918 (0x0010) [0x0000000000000000]              
	unsigned char                                      UnknownData04[ 0x8 ];                             		// 0x0920 (0x0008) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	class UOnlineVoiceInterface*                       VoiceInterface;                                   		// 0x0928 (0x0010) [0x0000000000000000]              
	unsigned char                                      UnknownData05[ 0x8 ];                             		// 0x0930 (0x0008) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	class UOnlineContentInterface*                     ContentInterface;                                 		// 0x0938 (0x0010) [0x0000000000000000]              
	unsigned char                                      UnknownData06[ 0x8 ];                             		// 0x0940 (0x0008) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __OnPrivilegeCallback__Delegate;                  		// 0x0948 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData07[ 0x4 ];                             		// 0x094C (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->GetIndex( 4829 );

		return pClassPointer;
	};

	bool usc_get_experimental_hud ( );
	void usc_use_experimental_hud ( unsigned long Value );
	void usc_PauseGame ( unsigned long shouldPause );
	void usc_minimap_hovered ( float X, float Y, struct FString MapName );
	void usc_minimap_pinged ( float X, float Y, struct FString Type, struct FString MapName );
	void usc_PauseGameToggle ( );
	bool usc_isAllowedPause ( );
	bool eventIsAccountPickerOpen ( );
	void usc_ShowContentPurchaseUI ( struct FString SignedOffer );
	void eventGetAvailableProducts ( int nControllerId, unsigned char MediaType, TArray< struct FMarketplaceProductDetails >* Products );
	void ShowContentPurchaseUI ( struct FString SingedOffer );
	void eventGetInventoryItems ( TArray< struct FMarketplaceInventoryItem >* InventoryItems );
	bool eventCanShowContentPurchaseUI ( );
	bool eventUnregisterLocalTalker ( unsigned char LocalUserNum, unsigned char ChannelIndex );
	bool eventRegisterLocalTalker ( unsigned char LocalUserNum, unsigned char ChannelIndex );
	void eventShowNotification ( int nType, struct FString Message, struct FString Message2, class UGFxObject* Data );
	void eventHideNotification ( int nType );
	void TestShowNotification ( );
	void TestHideNotification ( );
	void LogFocus ( );
	void eventSetGamepadMode ( unsigned long bIsGamepad );
	void eventSetModal ( class UGFxObject* modalObj );
	void eventClearModal ( );
	void eventEndLoading ( struct FString KeyName );
	void eventStartLoading ( struct FString KeyName );
	void eventGainFocus ( class UGFxObject* focusObj );
	void eventFindFocus ( );
	void eventRegainFocus ( );
	void eventLostFocus ( );
	void eventSetOnlineStatus ( unsigned char LocalUserNum, struct FString StatusString, unsigned long PlayerActive );
	void eventDisableVideoRecording ( );
	void eventEnableVideoRecording ( );
	int usc_get_gamestate ( );
	void UIDebugModeEnd ( );
	void UIDebugModeWatch ( struct FString sPath, int nDrillInDepth );
	void UIDebugModeNavigation ( );
	void UIDebugModeHighlight ( unsigned long mousableOnly );
	void ToggleAlienFX ( );
	void FlashCaptureMouse ( );
	void FlashReleaseMouse ( );
	void ListOpenScenes ( );
	void CloseAllScenes ( );
	void EnableItemWarningPopup ( );
	void DisableItemWarningPopup ( );
	void eventClosePartyInviteDialog ( );
	void eventDisplayLoginUI ( );
	bool eventShouldBlockKey ( int ControllerId, struct FName ButtonName, unsigned char Event );
	void usc_ClipboardCopy ( struct FString Str );
	struct FString usc_ClipboardPaste ( );
	void OnPlayerCardComplete ( unsigned long bWasSuccessful );
	bool eventWidgetUnloaded ( struct FName WidgetName, struct FName WidgetPath, class UGFxObject* Widget );
	bool eventWidgetInitialized ( struct FName WidgetName, struct FName WidgetPath, class UGFxObject* Widget );
	void eventReadOnlinePlayerData ( TArray< struct FString > PlayerIDs, unsigned long bIncludePresence );
	void eventCleanupUC ( );
	void InitOSSRef ( );
	void eventInit ( class ULocalPlayer* LocPlay );
	void eventPostWidgetInit ( );
	void eventTick ( float DeltaTime );
	void usc_findIndicesForCapitalSizeCharacters ( struct FString sourceText, class UGFxObject* out_capitalIndices );
	void usc_report_player ( struct FString sPlayerName, int nReasonCode, struct FString sReason, int nTaskForce, int nPlayerCount, int nReportedPlayerTaskForce );
	void DebugSimulmediaVideoPlayer ( );
	void DebugIntroVideo ( );
	void DebugActivities ( );
	bool usc_GetAppSettings ( struct FString pSetting );
	void OnClearCachedJoinChallengeTimer ( );
	void OnJoinChallengePasswordPopup ( class UTgPagePopup* pData, struct FPopupResponse* Response );
	void FlushKeyboardBinds ( );
	void ToggleInputConfirm ( unsigned long bEnable );
	void TestInputHud ( unsigned long isGamePad );
	void ForcePSPlus ( unsigned long bShouldForce );
	void usc_MuteVivoxPlayer ( struct FString sPlayerId, unsigned long Toggle, struct FString sPlatformId );
	void OnReferralSelected ( class UTgEventDataItem* pEvent );
	bool ShowGodPackPurchase ( );
	bool GetOwnsGodPack ( );
	void eventDestroyVideoPlayer ( );
	void eventOnVideoError ( class APComVideoPlayer* VideoPlayer, unsigned char ErrorCode );
	void eventSpawnVideoPlayer ( class AActor* SpawningActor );
	void PrintUIGameInputIntercepts ( );
	void PrintInputCaptures ( );
	void PrintFocusStack ( );
	void PrintGameInfo ( );
	void NativeVideoPlayerDestroy ( );
	void HandleVideoPlayerErrorCallback ( class APComVideoPlayer* VideoPlayer, unsigned char ErrorCode );
	bool CheckForGlobalKeyInput ( int ControllerId, struct FName ButtonName, unsigned char Event );
	void OnToggleSkillScreen ( class UTgEventDataItem* pEvent );
	void OnVendorStoreToggle ( class UTgEventDataItem* pEvent );
	void OnVendorStoreClose ( class UTgEventDataItem* pEvent );
	void OnVendorStoreOpen ( class UTgEventDataItem* pEvent );
	void usc_CheckEOMLSimulmediaOpportunities ( );
	void usc_NativeLog ( struct FString sValue );
	bool usc_getIsGamePadInput ( );
	void usc_saveTransformSettings ( struct FString TransformSettings );
	struct FString usc_loadTransformSettings ( );
	void OnVideoPlaybackEnded ( );
	class UGFxObject* usc_GetFocusedTextField ( );
	bool usc_ShowKeyboardUI ( class UGFxObject* FocusedTextField, struct FString TitleText, struct FString DescriptionText, unsigned long bIsPassword, unsigned long bShouldValidate, struct FString DefaultText, int MaxResultLength );
	bool usc_HideKeyboardUI ( );
	bool usc_IsShowingKeyboardUI ( );
	void OnResolveChatMessage ( unsigned long bSuccess, class UTgPlayerNameManager* pManager );
	void OpenPurchaseGems ( struct FString SKUCode );
	void ClaimPendingChatMessages ( TArray< class UTgChatData* >* out_arrData );
	void ShowHudChatMessage ( class UTgChatData* pData );
	void TestShowMessage ( struct FString msg );
	void gfxProcessSound ( struct FName aThemeName, struct FName aEventName );
	void OnBattlePassToastUpdate ( class UTgEventDataItem* pEvent );
	void OnInputModeChanged ( class UTgEventDataItem* pEvent );
	void HandleClanPlayerInviteUpdates ( struct FPointer pEvent );
	bool usc_send_chat ( int nChannel, struct FString msg, struct FString Recipient );
	bool usc_can_view_ugc ( );
	void ASC_ShowFriendsUI ( );
	void SetupPurchaseWithProductId ( struct FString sProductId );
	void ClaimGift ( struct FString nAcqId );
	void TestListPendingGifts ( );
	void TestSendGift ( int nPlayerId, int nMessageIndex, unsigned long bAnon );
	struct FString FixLocalizationKeybinds ( struct FString sMsg );
	class UTgGFxPlayerData* GetPlayerData ( struct FTgPlayerId* pid );
	void AttemptToJoinTutorial ( float DeltaTime );
	void eventCallPrivilegeDelegate ( struct FScriptDelegate delCallback, unsigned char ePriv, unsigned char ePermiss );
	void CheckOnlinePrivileges ( unsigned char ePriv, struct FScriptDelegate delCallback );
	void CancelCheckOnlinePrivileges ( class UObject* pScope );
	void OnVGSCustomMessage ( unsigned long bSuccess, struct FString sText );
	void TryEstablishPlatformSession ( struct FPointer pMarshal );
	void OnForceMatchDataUpdate ( class UTgEventDataItem* pEvent );
	void OnMatchDataChange ( class UTgEventDataItem* pEvent );
	void ReceiveMatchData ( struct FPointer pMarshal );
	bool UnregisterLocalPlayerForVoice ( unsigned char ChannelIndex );
	bool RegisterLocalPlayerForVoice ( unsigned char ChannelIndex );
	void UpdateCameraBasedOnNavAction ( );
	void EquipLoadoutItem ( int nItemId );
	void NavigateTo ( struct FNavParams* Params );
	void HandleEscapeKey ( );
	void usc_goto_item ( int nItemId, unsigned long bUseAltRedirect );
	void GotoChestItem ( int nChestItemId, int nOriginalItemId, int nReturnToTarget, int nReturnToEvent, unsigned long bUseAltRedirect );
	void GotoItem ( int nItemId, int nReturnToTarget, int nReturnToEvent, unsigned long bUseAltRedirect );
	bool RedirectToItemObtainLocation ( int nItemId );
	bool ShowGodVideo ( int nGodVideoId, struct FString sGodVideoUrl );
	void goto_lobby ( unsigned long bAtEOM );
	class UTgGFxObject* GetRoot ( );
	class UGFxObject* GetWidget ( struct FName WidgetName );
	void TestMatchLobby ( int nQueue, unsigned long bPreSelect, int nTeamCount, int nPlayerPerTeam );
	struct FString GetHUDTeamName ( unsigned long bEnemy );
	void SetLanguage ( );
	void ShowLoginMessage ( struct FString sMsg );
	void ShowLoginUI ( );
	void ShowNormalUI ( );
	struct FIntStringPair GetAndClearLastLoginError ( );
	void TestClearDeferBlacklist ( );
	bool TestAddDeferBlacklistEntry ( int newEntry );
	void TestDeferBlacklist ( unsigned long bQueue );
	void TestShowPopupModal ( int nType );
	void TestSendPlayerTrackingEvent ( int nEvent, int nSubEvent, struct FString sRefName, int nRefValue );
	void TestPurchaseClanNameChange ( struct FString sName, struct FString sTag );
	void TestShowAcquisition ( int nType, int nLootId );
	void SendCloseAllPopup ( );
	void SendClosePopup ( );
	void SendOpenPopup ( class UTgPagePopup* pPopup );
	void SetSceneLoadPermissions ( struct Fdword fPermiss );
	void PlayerLoginError ( int nError, struct FString sMessage );
	void SetLoginReady ( unsigned long fromIntro );
	void OnLobbyStateChange ( class UTgEventDataItem* pEvent );
	void OnHUDStateChange ( class UTgEventDataItem* pEvent );
	void OnSpectateFail ( class UTgEventDataItem* pEvent );
	struct FString USC_GetCurrencyName ( int nCurrencyValidValue );
	int usc_getConsolePlatform ( );
	bool usc_isConsole ( );
	void AttemptAutoLogin ( );
	void usc_acceptEULA ( );
	bool usc_createPlayerName ( struct FString sLoginName, struct FString sPass, struct FString sNewPlayerName );
	bool USC_Login ( struct FString sUsername, struct FString sPassword );
	bool USC_LoginExits ( );
	bool usc_isLoginReady ( );
	void USC_ShowEndOfMatch ( unsigned long bShow );
	void eventUpdateVoiceChatPlayer ( struct FString sPId, unsigned long bIsActive, unsigned long bIsSpeaking );
	void usc_toggle_voice_mute ( struct FString sConsoleId, int nPortalType, struct FString sPlayerName, struct FString sPlayerId, unsigned long bMute );
	void usc_toggle_player_mute ( struct FString ConsoleIdString, struct FString PlayerName, struct FString sPlayerId );
	bool usc_add_to_party ( struct FString sConsoleId, int nPortalType, struct FString sPlayerId, struct FString sPlayerName );
	bool usc_can_invite_to_party ( struct FString sPlayerId );
	bool usc_add_to_clan ( struct FString sConsoleId, int nPortalType, struct FString sPlayerId, struct FString sPlayerName );
	bool usc_can_invite_to_clan ( struct FString sPlayerId );
	float usc_get_queue_timer ( int nQueueId );
	bool usc_can_cancel_spectate ( );
	void usc_disconnect ( );
	void usc_CancelQueue ( );
	bool is_item_owned ( int ItemId );
	bool SetUIDisplayMode ( int displayMode );
	class UGFxObject* usc_getItemData ( int ItemId, int quantityCount, int vendorId );
	void usc_Scene_Manager_Scene_Unloaded ( struct FString sSceneName );
	void usc_Scene_Manager_Scene_Loaded ( struct FString sSceneName );
	void update_player_mute ( );
	void TryToggleMute ( unsigned long bShouldMute );
	void ShowPopupMessage ( struct FString sTitle, struct FString sMessage );
	void ShowErrorMessage ( struct FString sTitle, struct FString sMessage, unsigned long _user_must_close );
	void SetHUDVisiblity ( );
	void OnDemoReady ( );
	void AddRecentlyInvited ( struct FTgPlayerId* pid );
	int GetRecentlyInvitedTimeRemain ( struct FTgPlayerId* pid );
	bool HasRecentlyInvited ( struct FTgPlayerId* pid );
	bool usc_isItemEquippable ( int nItemId );
	bool usc_isItemEquipped ( int nItemId );
	int usc_GetActiveGamepadIndex ( int nPlayerIndex );
	int usc_RegisterCardTexture ( class UGFxObject* Widget, int nItemId, float X, float Y, float Width, float Height, unsigned long bOnlyIfMat );
	class UGFxObject* GetTestNotificationData ( );
	void usc_UnregisterCardTextureById ( int nCardId );
	void usc_UnregisterCardTexture ( class UGFxObject* Widget );
	void StartBatchPurchaseRequest ( );
	void GetFeedback ( int nType );
	void CompleteBatchPurchaseRequest ( );
	void AddBatchPurchaseRequest ( int nVendorId, int nItemId, int nPriceInUI, int nCurrencyType, int nQuantity, struct Fdword locationId, int nCouponId );
	struct FString usc_get_class_purchase_pricing ( int nClassId );
	struct FString usc_GetGameName ( );
	int GetSysCounterValue ( int nCounterId );
	int GetPortalType ( );
	bool usc_is_time_between ( struct FString Start, struct FString End );
	bool usc_isFriend ( struct FString sPlayerId );
	bool usc_is_party_leader ( );
	bool usc_can_invite_players ( );
	bool usc_ableToSkipTutorial ( );
	void usc_watch_eom_replay ( struct FString sInstanceId );
	void usc_remove_music_theme ( int nItemId, struct FString sEventName );
	void usc_add_music_theme ( int nItemId, struct FString sEventName );
	void usc_test_music_theme ( int nItemId, struct FString sEventName );
	void usc_show_god_detail ( int nClassId );
	void usc_request_goto_lobby ( struct FString Title, struct FString Desc );
	void usc_redeem_login_bonus ( );
	void usc_queue_create_team ( int nQueueId, struct FString sPassword );
	void usc_onServerStabilityFeedback ( );
	void usc_match_suggest_pick ( int nClassId );
	void usc_match_suggest_ban ( int nClassId );
	void usc_match_cancel_role_trade ( );
	void usc_match_request_role_trade ( struct FString sPlayerId );
	void usc_match_request_trade ( struct FString sPlayerId );
	void usc_match_request_random_class ( );
	void usc_match_purchase_voice_pack ( int nVoicePackItemId );
	void usc_match_close_random_class_popup ( );
	void usc_match_cancel_trade ( );
	void usc_match_ban_class ( int nClassId );
	void usc_kick_team_player ( struct FString sPlayerName );
	void usc_introFinished ( );
	void Replay ( int nInstanceId, struct FString sPassword );
	void ChangeHudSection ( struct FString Section, float percentX, float percentY, float Scale, float dockX, float dockY, struct FString dockObj, float dockObjX, float dockObjY, unsigned long outX, unsigned long outY );
	struct FString usc_GetHudSkinPath ( );
	class UGFxObject* usc_get_date_est ( );
	int usc_get_time ( );
	int usc_get_server_time_secs ( );
	int usc_get_server_time ( );
	int usc_SyncMorriganPassiveMeter ( class UGFxObject* passiveMeter );
	int usc_GetRentedTimeLeft ( int nItemId, int nIdType );
	bool usc_resize_browser ( int surfaceId, float X, float Y, float Width, float Height, float widthReal, float heightReal );
	bool usc_match_can_purchase_random_class ( int nQueueId );
	bool usc_is_item_owned ( struct FString ItemId );
	bool usc_is_in_game ( );
	bool usc_isInTutorial ( );
	bool usc_isInSiege ( );
	bool usc_isCapsLockActive ( );
	bool usc_can_play_again ( );
	bool usc_IsGameBit ( int iGB );
	bool usc_ConfirmHudSkin ( int nId );
	void usc_viewStatsOnline ( struct FString sInstanceId );
	void usc_upgrade_item ( int nItemId, int nUpgradeInvId );
	void usc_unregister_mouse_region ( struct FString Key );
	void usc_test_voice_pack ( int nVoicePackId, int nSkinId );
	void usc_test_announcer_pack ( int nItemId );
	void usc_surrender ( unsigned long bSurrender );
	void usc_show_skin ( int nSkinId );
	void usc_set_auto_skill_up ( unsigned long bAutoSkill, unsigned long bForMatch );
	void usc_set_auto_purchase ( unsigned long bAutoPurchase, unsigned long bForMatch );
	void usc_sell_item ( int nInventoryId );
	void usc_resend_private_messages ( );
	void usc_request_treasure_roll ( int nItemId, int CurrencyType );
	void usc_keep_me_logged_in ( unsigned long bNewValue );
	void usc_rejectNotification ( int nNotificationType, int nId );
	void usc_register_mouse_region ( struct FString Key, int X, int Y, int Width, int Height );
	void usc_redeem_reward ( int nActId, int nGoalId, int nCount );
	void usc_queue_leave ( );
	void usc_purchase_item ( int nItemId, int nAmount );
	void usc_play_again ( );
	void usc_passwordInputFocus ( );
	void usc_open_triumph_chest ( int nLootTableItemId );
	void usc_nameInputFocus ( );
	void usc_match_lock_in ( );
	void usc_match_choose_skin ( int nSkinId );
	void usc_match_choose_class ( int nClassId );
	void usc_friend_action ( struct FString sType, struct FString sPlayerId );
	void usc_enable_browser_input ( unsigned long bEnable );
	void usc_close_eom_lobby ( int nNavigationTarget );
	void usc_clearLeagueDC ( );
	void usc_attempt_auto_login ( );
	void usc_acceptNotification ( int nNotificationType, int nId );
	void usc_Accept_Match_Invite ( );
	void UnloadHudSection ( struct FString Section );
	void USC_ShowLeaderboard ( struct FString sName, int nValue, int nOption );
	void SetSpecTeamName ( unsigned long bEnemy, struct FString TeamName );
	void SetSpecState ( struct FString stateString );
	void EndLobbyPlayback ( );
	void CancelPlayback ( );
	void USC_SelectedPopup ( int nActionId, struct FString sInputValue, struct FString sSecondaryInputValue );
	bool TryPopupCallback ( int nActionId, struct FString sInputValue, struct FString sSecondaryInputValue );
	void AddInitialChatMessages ( );
	void FakeItemToast ( int nItemId );
	void CloseChatTab ( int nChannel, struct FString sSender );
	void OpenChatTab ( int nChannel, unsigned long bForce );
	void UpdateMapBackground ( );
	void AttemptAutoReplayDemoRecording ( );
	void usc_chat_ready ( );
	void usc_vgs_command ( int nId, unsigned long bSubMenu );
	void usc_chat_close_tab ( int nChannel, struct FString Sender );
	int usc_get_sellback_price ( int nItemId );
	int usc_full_sellback_available ( int nItemId );
	void usc_set_chat_channel ( int nChannel );
	void AddRemoveDeferredChannelTab ( unsigned long bAdd, int nChannelId );
	bool usc_can_view_user_content ( );
	void UnregisterForJSON ( class UPComUIManagerBase* pRegistrant, struct FString sJsonName );
	void RegisterForJSON ( class UPComUIManagerBase* pRegistrant, struct FString sJsonName );
	void UnregisterMctsCallbacks ( );
	void RegisterMctsCallbacks ( );
	void OpenWorldScene ( struct FString CameraName, int cameraTransitionType );
	bool usc_IME_Exists ( );
	bool usc_IME_SetEnabled ( unsigned long bEnabled );
	void usc_view_player_profile ( struct FString sPlayerId, struct FString sPlayerName, struct FString sProfileTab );
	void usc_view_platform_player_card ( struct FString sPlayerId, struct FString sPlayerName );
	void UpdatePromptMode ( class UGFxObject* pObj );
	void SetButtonPromptMode ( int nMode );
	bool usc_HasPlayerLogin ( );
	struct FString usc_getFontSize ( struct FString Identifier, struct FString SectionName );
	struct FString usc_TranslateMsg ( struct FString Identifier, struct FString SectionName );
	struct FString usc_TranslateMsgId ( int nId );
	void ShowTransitionScene ( unsigned long bShow );
	bool usc_is_safe_to_load ( struct FString sUrl );
	void usc_toggle_key_capture ( unsigned long bCapture );
	void usc_toggle_cursor ( unsigned long bShow, unsigned long bOnlyVisibility );
