/*
#############################################################################################
# Smite (v3.24.3804.2) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TgClient_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function TgClient.TgGfxAchievementPopup.QueueAchievement
// [0x00020802] ( FUNC_Event )
struct UTgGfxAchievementPopup_eventQueueAchievement_Parms
{
};

// Function TgClient.TgGfxAchievementPopup.asc_QueueAchievement
// [0x00020003] ( FUNC_Final )
struct UTgGfxAchievementPopup_execasc_QueueAchievement_Parms
{
};

// Function TgClient.TgGfxAchievementPopup.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxAchievementPopup_execInitialize_Parms
{
	class UTgMoviePlayer*                              pMoviePlayer;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAchievementSelection.UpdateSelectedAchievements
// [0x00020802] ( FUNC_Event )
struct UTgGfxAchievementSelection_eventUpdateSelectedAchievements_Parms
{
};

// Function TgClient.TgGfxAchievementSelection.ASC_UpdateSelectedAchievements
// [0x00020003] ( FUNC_Final )
struct UTgGfxAchievementSelection_execASC_UpdateSelectedAchievements_Parms
{
};

// Function TgClient.TgGfxAchievementSelection.UpdateScreen
// [0x00020802] ( FUNC_Event )
struct UTgGfxAchievementSelection_eventUpdateScreen_Parms
{
};

// Function TgClient.TgGfxAchievementSelection.ASC_UpdateScreen
// [0x00020003] ( FUNC_Final )
struct UTgGfxAchievementSelection_execASC_UpdateScreen_Parms
{
};

// Function TgClient.TgGfxAchievementSelection.USC_ApplySelections
// [0x00020400] ( FUNC_Native )
struct UTgGfxAchievementSelection_execUSC_ApplySelections_Parms
{
	int                                                as1;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                as2;                                              		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                as3;                                              		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                as4;                                              		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAchievementSelection.USC_ApplySelections_Delegate
// [0x00120000] 
struct UTgGfxAchievementSelection_execUSC_ApplySelections_Delegate_Parms
{
	int                                                as1;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                as2;                                              		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                as3;                                              		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                as4;                                              		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAchievementSelection.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxAchievementSelection_execUninitialize_Parms
{
};

// Function TgClient.TgGfxAchievementSelection.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxAchievementSelection_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventureProgress.OnAcquisition
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgress_execOnAcquisition_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventureProgress.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgress_execUninitialize_Parms
{
};

// Function TgClient.TgGfxAdventureProgress.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgress_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventureProgress.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgress_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventureProgressDungeon2.OnAcquisition
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgressDungeon2_execOnAcquisition_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventureProgressDungeon2.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgressDungeon2_execUninitialize_Parms
{
};

// Function TgClient.TgGfxAdventureProgressDungeon2.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgressDungeon2_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventureProgressDungeon2.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgressDungeon2_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventureProgressFox.OnAcquisition
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgressFox_execOnAcquisition_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventureProgressFox.SetupChestPurchaseFox
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgressFox_execSetupChestPurchaseFox_Parms
{
};

// Function TgClient.TgGfxAdventureProgressFox.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgressFox_execUninitialize_Parms
{
};

// Function TgClient.TgGfxAdventureProgressFox.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgressFox_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventureProgressFox.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgressFox_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventureProgressMMO.OnAcquisition
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgressMMO_execOnAcquisition_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventureProgressMMO.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgressMMO_execUninitialize_Parms
{
};

// Function TgClient.TgGfxAdventureProgressMMO.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgressMMO_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventureProgressMMO.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventureProgressMMO_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventuresHub.SceneTick
// [0x00020800] ( FUNC_Event )
struct UTgGfxAdventuresHub_eventSceneTick_Parms
{
	float                                              Delta;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventuresHub.OnAcquisition
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventuresHub_execOnAcquisition_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventuresHub.SetBundleOwnership
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventuresHub_execSetBundleOwnership_Parms
{
};

// Function TgClient.TgGfxAdventuresHub.TriggerLobbyEventHub
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventuresHub_execTriggerLobbyEventHub_Parms
{
	int                                                nType;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nTarget;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventuresHub.TriggerLobbyCamEvent
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventuresHub_execTriggerLobbyCamEvent_Parms
{
	int                                                nType;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nTarget;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventuresHub.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventuresHub_execUninitialize_Parms
{
};

// Function TgClient.TgGfxAdventuresHub.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventuresHub_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventuresHub.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventuresHub_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventuresHub.LeaveQueue
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventuresHub_execLeaveQueue_Parms
{
};

// Function TgClient.TgGfxAdventuresHub.PopulateGoalData
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventuresHub_execPopulateGoalData_Parms
{
};

// Function TgClient.TgGfxAdventuresHub.USC_OpenEventCam
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventuresHub_execUSC_OpenEventCam_Parms
{
	unsigned long                                      isSmall : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgGfxAdventuresHub.USC_GotoVault
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventuresHub_execUSC_GotoVault_Parms
{
	unsigned long                                      bIsSmall : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgGfxAdventuresHub.USC_SetUserViewedEvent
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventuresHub_execUSC_SetUserViewedEvent_Parms
{
};

// Function TgClient.TgGfxAdventuresHub.USC_GetAdventureLeaderboard
// [0x00020400] ( FUNC_Native )
struct UTgGfxAdventuresHub_execUSC_GetAdventureLeaderboard_Parms
{
	int                                                nEventId;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxAdventuresHub.USC_OpenEventCam_Delegate
// [0x00120000] 
struct UTgGfxAdventuresHub_execUSC_OpenEventCam_Delegate_Parms
{
};

// Function TgClient.TgGfxAdventuresHub.USC_GotoVault_Delegate
// [0x00120000] 
struct UTgGfxAdventuresHub_execUSC_GotoVault_Delegate_Parms
{
};

// Function TgClient.TgGfxAdventuresHub.USC_GetAdventureLeaderboard_Delegate
// [0x00120000] 
struct UTgGfxAdventuresHub_execUSC_GetAdventureLeaderboard_Delegate_Parms
{
};

// Function TgClient.TgGfxAdventuresHub.USC_SetUserViewedEvent_Delegate
// [0x00120000] 
struct UTgGfxAdventuresHub_execUSC_SetUserViewedEvent_Delegate_Parms
{
};

// Function TgClient.TgGfxBooster.UpdateBoosterTime
// [0x00020400] ( FUNC_Native )
struct UTgGfxBooster_execUpdateBoosterTime_Parms
{
};

// Function TgClient.TgGfxBooster.USC_ShowPurchasePopup
// [0x00020400] ( FUNC_Native )
struct UTgGfxBooster_execUSC_ShowPurchasePopup_Parms
{
	int                                                ItemId;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nQuantity;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxBooster.USC_ShowPurchasePopup_Delegate
// [0x00120000] 
struct UTgGfxBooster_execUSC_ShowPurchasePopup_Delegate_Parms
{
	int                                                ItemId;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nQuantity;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxBooster.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxBooster_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxCharacterBuilder.HasVendorData
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxCharacterBuilder_execHasVendorData_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgGfxCharacterBuilder.GetVendorData
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxCharacterBuilder_execGetVendorData_Parms
{
	class UTgVendorData*                               ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgGfxCharacterBuilder.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxCharacterBuilder_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxCharacterBuilder.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxCharacterBuilder_execUninitialize_Parms
{
};

// Function TgClient.TgGfxCharacterBuilder.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxCharacterBuilder_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxClanIconPicker.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxClanIconPicker_execInitialize_Parms
{
	class UTgMoviePlayer*                              pMP;                                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxClanIconPicker.USC_SelectIcon
// [0x00020400] ( FUNC_Native )
struct UTgGfxClanIconPicker_execUSC_SelectIcon_Parms
{
	int                                                nIconItemId;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxClanIconPicker.USC_SelectIcon_Delegate
// [0x00120000] 
struct UTgGfxClanIconPicker_execUSC_SelectIcon_Delegate_Parms
{
};

// Function TgClient.TgGFxDungeonCurrencies.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGFxDungeonCurrencies_execUninitialize_Parms
{
};

// Function TgClient.TgGFxDungeonCurrencies.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGFxDungeonCurrencies_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxEOMLobby.OnAcquisition
// [0x00020400] ( FUNC_Native )
struct UTgGfxEOMLobby_execOnAcquisition_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxEOMLobby.OnStats
// [0x00020400] ( FUNC_Native )
struct UTgGfxEOMLobby_execOnStats_Parms
{
	struct FString                                     instanceId;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxEOMLobby.OnFeedback
// [0x00020400] ( FUNC_Native )
struct UTgGfxEOMLobby_execOnFeedback_Parms
{
};

// Function TgClient.TgGfxEOMLobby.OnTwitter
// [0x00020400] ( FUNC_Native )
struct UTgGfxEOMLobby_execOnTwitter_Parms
{
	struct FString                                     instanceId;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxEOMLobby.OnFacebook
// [0x00020400] ( FUNC_Native )
struct UTgGfxEOMLobby_execOnFacebook_Parms
{
	struct FString                                     instanceId;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxEOMLobby.OnSendPlayerGift
// [0x00020400] ( FUNC_Native )
struct UTgGfxEOMLobby_execOnSendPlayerGift_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxEOMLobby.OnSendGiftPoints
// [0x00020400] ( FUNC_Native )
struct UTgGfxEOMLobby_execOnSendGiftPoints_Parms
{
	class UGFxObject*                                  pData;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxEOMLobby.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxEOMLobby_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxEOMLobby.USC_SendPlayerGift
// [0x00024400] ( FUNC_Native )
struct UTgGfxEOMLobby_execUSC_SendPlayerGift_Parms
{
	struct FString                                     PlayerName;                                       		// 0x0000 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     nPlayerId;                                        		// 0x0010 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxEOMLobby.ReceiveGiftedPoints
// [0x00020803] ( FUNC_Final | FUNC_Event )
struct UTgGfxEOMLobby_eventReceiveGiftedPoints_Parms
{
	class UGFxObject*                                  Data;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxEOMLobby.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxEOMLobby_execUninitialize_Parms
{
};

// Function TgClient.TgGfxEOMLobby.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxEOMLobby_execInitialize_Parms
{
	class UTgMoviePlayer*                              pMoviePlayer;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxEventAchievements.CheckBundleOwned
// [0x00020400] ( FUNC_Native )
struct UTgGfxEventAchievements_execCheckBundleOwned_Parms
{
};

// Function TgClient.TgGfxEventAchievements.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxEventAchievements_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxEventAchievements.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxEventAchievements_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxEventLeaderboard.USC_RequestEventLeaderboard
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxEventLeaderboard_execUSC_RequestEventLeaderboard_Parms
{
	int                                                EventIdx;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxEventLeaderboard.Chunk
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxEventLeaderboard_execChunk_Parms
{
	struct FString                                     dataIdx;                                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UGFxObject*                                  ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgGfxEventLeaderboard.CreateChunk
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxEventLeaderboard_execCreateChunk_Parms
{
	struct FString                                     dataIdx;                                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UGFxObject*                                  ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgGfxEventLeaderboard.UpdateFromChunk
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxEventLeaderboard_execUpdateFromChunk_Parms
{
	struct FString                                     dataIdx;                                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgGfxEventLeaderboard.OnReceivePlayerNames
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxEventLeaderboard_execOnReceivePlayerNames_Parms
{
};

// Function TgClient.TgGfxEventLeaderboard.ReceivedAllData
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxEventLeaderboard_execReceivedAllData_Parms
{
};

// Function TgClient.TgGfxEventLeaderboard.PopulateDropdown
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxEventLeaderboard_execPopulateDropdown_Parms
{
	TArray< int >                                      arrEventIds;                                      		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxEventLeaderboard.ShowLeaderboard
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxEventLeaderboard_execShowLeaderboard_Parms
{
	int                                                nStartIndex;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nEndIndex;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxEventLeaderboard.RequestFriendAndWorldPlayerNames
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxEventLeaderboard_execRequestFriendAndWorldPlayerNames_Parms
{
};

// Function TgClient.TgGfxEventLeaderboard.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxEventLeaderboard_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxFeedback.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxFeedback_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxFeedback.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxFeedback_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGlossary.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxGlossary_execUninitialize_Parms
{
};

// Function TgClient.TgGfxGlossary.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxGlossary_execInitialize_Parms
{
	class UTgMoviePlayer*                              pMP;                                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGlossary.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxGlossary_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGods.OnAcquisition
// [0x00020400] ( FUNC_Native )
struct UTgGfxGods_execOnAcquisition_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGods.UpdateUGPValue
// [0x00020400] ( FUNC_Native )
struct UTgGfxGods_execUpdateUGPValue_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGods.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxGods_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGods.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxGods_execUninitialize_Parms
{
};

// Function TgClient.TgGfxGods.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxGods_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGods.USC_PlayGodVideo
// [0x00020400] ( FUNC_Native )
struct UTgGfxGods_execUSC_PlayGodVideo_Parms
{
	int                                                abilityNumber;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGods.USC_PlayGodVideo_Delegate
// [0x00120000] 
struct UTgGfxGods_execUSC_PlayGodVideo_Delegate_Parms
{
};

// Function TgClient.TgGfxGods.USC_UpdateEmoteSelection
// [0x00020400] ( FUNC_Native )
struct UTgGfxGods_execUSC_UpdateEmoteSelection_Parms
{
	struct FString                                     emoteName;                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxGods.USC_UpdateEmoteSelection_Delegate
// [0x00120000] 
struct UTgGfxGods_execUSC_UpdateEmoteSelection_Delegate_Parms
{
	struct FString                                     emoteName;                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxGodsHistory.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxGodsHistory_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGodsHistory.UpdateGodHistory
// [0x00020802] ( FUNC_Event )
struct UTgGfxGodsHistory_eventUpdateGodHistory_Parms
{
};

// Function TgClient.TgGfxGodsHistory.ASC_UpdateGodHistory
// [0x00020003] ( FUNC_Final )
struct UTgGfxGodsHistory_execASC_UpdateGodHistory_Parms
{
};

// Function TgClient.TgGfxGodsHistory.UpdateQueueData
// [0x00020802] ( FUNC_Event )
struct UTgGfxGodsHistory_eventUpdateQueueData_Parms
{
};

// Function TgClient.TgGfxGodsHistory.ASC_UpdateQueueData
// [0x00020003] ( FUNC_Final )
struct UTgGfxGodsHistory_execASC_UpdateQueueData_Parms
{
};

// Function TgClient.TgGfxGodsHistory.USC_ShowMatchDetails
// [0x00020400] ( FUNC_Native )
struct UTgGfxGodsHistory_execUSC_ShowMatchDetails_Parms
{
	int                                                pMatchID;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGodsHistory.USC_GetHistoryData
// [0x00020400] ( FUNC_Native )
struct UTgGfxGodsHistory_execUSC_GetHistoryData_Parms
{
	int                                                queueId;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGodsHistory.USC_GetQueuesDropdown
// [0x00020400] ( FUNC_Native )
struct UTgGfxGodsHistory_execUSC_GetQueuesDropdown_Parms
{
	int                                                godId;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGodsHistory.USC_ShowMatchDetails_Delegate
// [0x00120000] 
struct UTgGfxGodsHistory_execUSC_ShowMatchDetails_Delegate_Parms
{
	int                                                pMatchID;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGodsHistory.USC_GetHistoryData_Delegate
// [0x00120000] 
struct UTgGfxGodsHistory_execUSC_GetHistoryData_Delegate_Parms
{
	int                                                queueId;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGodsHistory.USC_GetQueuesDropdown_Delegate
// [0x00120000] 
struct UTgGfxGodsHistory_execUSC_GetQueuesDropdown_Delegate_Parms
{
	int                                                godId;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxGuides.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxGuides_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxHudItems.UpdateGlow
// [0x00020802] ( FUNC_Event )
struct UTgGfxHudItems_eventUpdateGlow_Parms
{
	int                                                Index;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      Visibility : 1;                                   		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgGfxHudItems.ASC_UpdateGlow
// [0x00020003] ( FUNC_Final )
struct UTgGfxHudItems_execASC_UpdateGlow_Parms
{
	int                                                Index;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      Visibility : 1;                                   		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgGfxHudItems.USC_SetupItemDisplay
// [0x00020400] ( FUNC_Native )
struct UTgGfxHudItems_execUSC_SetupItemDisplay_Parms
{
};

// Function TgClient.TgGfxHudItems.USC_SetupItemDisplay_Delegate
// [0x00120000] 
struct UTgGfxHudItems_execUSC_SetupItemDisplay_Delegate_Parms
{
};

// Function TgClient.TgGfxHudItems.CheckCurrency
// [0x00020400] ( FUNC_Native )
struct UTgGfxHudItems_execCheckCurrency_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxHudItems.CheckWishList
// [0x00020400] ( FUNC_Native )
struct UTgGfxHudItems_execCheckWishList_Parms
{
	unsigned long                                      bPurge : 1;                                       		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgGfxHudItems.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxHudItems_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxHudItems.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxHudItems_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxHudNotify.OnGameUIEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxHudNotify_execOnGameUIEvent_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxHudNotify.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxHudNotify_execUninitialize_Parms
{
};

// Function TgClient.TgGfxHudNotify.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxHudNotify_execInitialize_Parms
{
	class UTgMoviePlayer*                              pMP;                                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxHudNotify.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxHudNotify_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxHudUpgrade.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxHudUpgrade_execInitialize_Parms
{
	class UTgMoviePlayer*                              pMP;                                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxHudUpgrade.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxHudUpgrade_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxIntro.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxIntro_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxItemToast.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxItemToast_execUninitialize_Parms
{
};

// Function TgClient.TgGfxItemToast.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxItemToast_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxItemToast.ToastItem
// [0x00020802] ( FUNC_Event )
struct UTgGfxItemToast_eventToastItem_Parms
{
	int                                                ItemId;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxItemToast.ASC_ToastItem
// [0x00020003] ( FUNC_Final )
struct UTgGfxItemToast_execASC_ToastItem_Parms
{
	int                                                ItemId;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxLeaderboard.RequestCharacterLeaderboard
// [0x00020400] ( FUNC_Native )
struct UTgGfxLeaderboard_execRequestCharacterLeaderboard_Parms
{
	int                                                classId;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                rankType;                                         		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxLeaderboard.ShowLeaderboard
// [0x00024400] ( FUNC_Native )
struct UTgGfxLeaderboard_execShowLeaderboard_Parms
{
	struct FString                                     boardName;                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                aValue;                                           		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                Option;                                           		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClient.TgGfxLeaderboard.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxLeaderboard_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxLeaderboard.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxLeaderboard_execUninitialize_Parms
{
};

// Function TgClient.TgGfxLeaderboard.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxLeaderboard_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxLoadouts.OnAcquisition
// [0x00020400] ( FUNC_Native )
struct UTgGfxLoadouts_execOnAcquisition_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxLoadouts.RefreshBoosterTimer
// [0x00020400] ( FUNC_Native )
struct UTgGfxLoadouts_execRefreshBoosterTimer_Parms
{
	class UTgEventDataItem*                            pEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxLoadouts.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxLoadouts_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxLoadouts.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxLoadouts_execUninitialize_Parms
{
};

// Function TgClient.TgGfxLoadouts.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxLoadouts_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxLobbyMain.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxLobbyMain_execUninitialize_Parms
{
};

// Function TgClient.TgGfxLobbyMain.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxLobbyMain_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxMatchDetails.MatchDataUpdated
// [0x00020802] ( FUNC_Event )
struct UTgGfxMatchDetails_eventMatchDataUpdated_Parms
{
};

// Function TgClient.TgGfxMatchDetails.ASC_MatchDataUpdated
// [0x00020003] ( FUNC_Final )
struct UTgGfxMatchDetails_execASC_MatchDataUpdated_Parms
{
};

// Function TgClient.TgGfxMatchDetails.USC_SearchByMatchId
// [0x00020400] ( FUNC_Native )
struct UTgGfxMatchDetails_execUSC_SearchByMatchId_Parms
{
	struct FString                                     matchId;                                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxMatchDetails.USC_SearchByMatchId_Delegate
// [0x00120000] 
struct UTgGfxMatchDetails_execUSC_SearchByMatchId_Delegate_Parms
{
	struct FString                                     matchId;                                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxMatchDetails.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxMatchDetails_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxPartyManagement.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxPartyManagement_execUninitialize_Parms
{
};

// Function TgClient.TgGfxPartyManagement.ReceiveGFxData
// [0x00020400] ( FUNC_Native )
struct UTgGfxPartyManagement_execReceiveGFxData_Parms
{
	class UGFxObject*                                  pObj;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxPartyManagement.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxPartyManagement_execInitialize_Parms
{
	class UTgMoviePlayer*                              pMP;                                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxPlayerProfile.OnFriendSelector
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxPlayerProfile_execOnFriendSelector_Parms
{
	class UTgEventDataItem*                            pBaseEvent;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxPlayerProfile.PlayerNameUpdated
// [0x00020802] ( FUNC_Event )
struct UTgGfxPlayerProfile_eventPlayerNameUpdated_Parms
{
};

// Function TgClient.TgGfxPlayerProfile.ASC_PlayerNameUpdated
// [0x00020003] ( FUNC_Final )
struct UTgGfxPlayerProfile_execASC_PlayerNameUpdated_Parms
{
};

// Function TgClient.TgGfxPlayerProfile.DropDownUpdated
// [0x00020802] ( FUNC_Event )
struct UTgGfxPlayerProfile_eventDropDownUpdated_Parms
{
	int                                                Index;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxPlayerProfile.ASC_DropDownUpdated
// [0x00020003] ( FUNC_Final )
struct UTgGfxPlayerProfile_execASC_DropDownUpdated_Parms
{
	int                                                Index;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxPlayerProfile.USC_TabSelected
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxPlayerProfile_execUSC_TabSelected_Parms
{
	int                                                Index;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxPlayerProfile.USC_SearchByName
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxPlayerProfile_execUSC_SearchByName_Parms
{
	struct FString                                     PlayerName;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxPlayerProfile.USC_SetFilter
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxPlayerProfile_execUSC_SetFilter_Parms
{
	int                                                filterIndex;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                val;                                              		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxPlayerProfile.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxPlayerProfile_execUninitialize_Parms
{
};

// Function TgClient.TgGfxPlayerProfile.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxPlayerProfile_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxProfileAccolade.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxProfileAccolade_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxProfileAccolade.AccoladeDataUpdated
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfileAccolade_eventAccoladeDataUpdated_Parms
{
};

// Function TgClient.TgGfxProfileAccolade.ASC_AccoladeDataUpdated
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfileAccolade_execASC_AccoladeDataUpdated_Parms
{
};

// Function TgClient.TgGfxProfileAchievements.CheckIfHasMasterList
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfileAchievements_eventCheckIfHasMasterList_Parms
{
};

// Function TgClient.TgGfxProfileAchievements.ASC_CheckIfHasMasterList
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfileAchievements_execASC_CheckIfHasMasterList_Parms
{
};

// Function TgClient.TgGfxProfileAchievements.UpdateAchievements
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfileAchievements_eventUpdateAchievements_Parms
{
};

// Function TgClient.TgGfxProfileAchievements.ASC_UpdateAchievements
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfileAchievements_execASC_UpdateAchievements_Parms
{
};

// Function TgClient.TgGfxProfileAchievements.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxProfileAchievements_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxProfileHistory.QueueDataUpdated
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfileHistory_eventQueueDataUpdated_Parms
{
};

// Function TgClient.TgGfxProfileHistory.ASC_QueueDataUpdated
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfileHistory_execASC_QueueDataUpdated_Parms
{
};

// Function TgClient.TgGfxProfileHistory.MatchesDataUpdated
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfileHistory_eventMatchesDataUpdated_Parms
{
};

// Function TgClient.TgGfxProfileHistory.ASC_MatchesDataUpdated
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfileHistory_execASC_MatchesDataUpdated_Parms
{
};

// Function TgClient.TgGfxProfileHistory.USC_ShowDetails
// [0x00020400] ( FUNC_Native )
struct UTgGfxProfileHistory_execUSC_ShowDetails_Parms
{
	struct FString                                     matchId;                                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxProfileHistory.USC_SetQueueFilter
// [0x00020400] ( FUNC_Native )
struct UTgGfxProfileHistory_execUSC_SetQueueFilter_Parms
{
	int                                                queueId;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxProfileHistory.USC_SetGodsFilter
// [0x00020400] ( FUNC_Native )
struct UTgGfxProfileHistory_execUSC_SetGodsFilter_Parms
{
	struct FString                                     sFilterGod;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxProfileHistory.USC_ShowDetails_Delegate
// [0x00120000] 
struct UTgGfxProfileHistory_execUSC_ShowDetails_Delegate_Parms
{
	struct FString                                     matchId;                                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxProfileHistory.USC_SetQueueFilter_Delegate
// [0x00120000] 
struct UTgGfxProfileHistory_execUSC_SetQueueFilter_Delegate_Parms
{
	int                                                queueId;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxProfileHistory.USC_SetGodsFilter_Delegate
// [0x00120000] 
struct UTgGfxProfileHistory_execUSC_SetGodsFilter_Delegate_Parms
{
	struct FString                                     sFilterGod;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxProfileHistory.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxProfileHistory_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxProfileLeagueStats.UpdateLeagueStats
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfileLeagueStats_eventUpdateLeagueStats_Parms
{
};

// Function TgClient.TgGfxProfileLeagueStats.ASC_UpdateLeagueStats
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfileLeagueStats_execASC_UpdateLeagueStats_Parms
{
};

// Function TgClient.TgGfxProfileLeagueStats.UpdateQueueLeagues
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxProfileLeagueStats_execUpdateQueueLeagues_Parms
{
};

// Function TgClient.TgGfxProfileLeagueStats.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxProfileLeagueStats_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxProfileMastery.UpdateAll
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfileMastery_eventUpdateAll_Parms
{
};

// Function TgClient.TgGfxProfileMastery.asc_updateAll
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfileMastery_execasc_updateAll_Parms
{
};

// Function TgClient.TgGfxProfileMastery.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxProfileMastery_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxProfileOverview.Uninitialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxProfileOverview_execUninitialize_Parms
{
};

// Function TgClient.TgGfxProfileOverview.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxProfileOverview_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxProfileOverview.UpdateSelectedAchievements
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfileOverview_eventUpdateSelectedAchievements_Parms
{
};

// Function TgClient.TgGfxProfileOverview.ASC_UpdateSelectedAchievements
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfileOverview_execASC_UpdateSelectedAchievements_Parms
{
};

// Function TgClient.TgGfxProfileOverview.LeagueDataUpdated
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfileOverview_eventLeagueDataUpdated_Parms
{
};

// Function TgClient.TgGfxProfileOverview.ASC_LeagueDataUpdated
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfileOverview_execASC_LeagueDataUpdated_Parms
{
};

// Function TgClient.TgGfxProfileOverview.ProfileDataUpdated
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfileOverview_eventProfileDataUpdated_Parms
{
};

// Function TgClient.TgGfxProfileOverview.ASC_ProfileDataUpdated
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfileOverview_execASC_ProfileDataUpdated_Parms
{
};

// Function TgClient.TgGfxProfileOverview.USC_NavigateToClan
// [0x00020400] ( FUNC_Native )
struct UTgGfxProfileOverview_execUSC_NavigateToClan_Parms
{
};

// Function TgClient.TgGfxProfileOverview.USC_NavigateToClan_Delegate
// [0x00120000] 
struct UTgGfxProfileOverview_execUSC_NavigateToClan_Delegate_Parms
{
};

// Function TgClient.TgGfxProfilePage.OnFriendSelector
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxProfilePage_execOnFriendSelector_Parms
{
	class UTgEventDataItem*                            pBaseEvent;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxProfilePage.UpdateAvailable
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfilePage_eventUpdateAvailable_Parms
{
	unsigned long                                      vis : 1;                                          		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgGfxProfilePage.ASC_UpdateAvailable
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfilePage_execASC_UpdateAvailable_Parms
{
	unsigned long                                      vis : 1;                                          		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgGfxProfilePage.UpdateCallout
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfilePage_eventUpdateCallout_Parms
{
};

// Function TgClient.TgGfxProfilePage.ASC_UpdateCallout
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfilePage_execASC_UpdateCallout_Parms
{
};

// Function TgClient.TgGfxProfilePage.UpdatePlayer
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfilePage_eventUpdatePlayer_Parms
{
};

// Function TgClient.TgGfxProfilePage.ASC_UpdatePlayer
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfilePage_execASC_UpdatePlayer_Parms
{
};

// Function TgClient.TgGfxProfilePage.UpdateTab
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfilePage_eventUpdateTab_Parms
{
};

// Function TgClient.TgGfxProfilePage.ASC_UpdateTab
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfilePage_execASC_UpdateTab_Parms
{
};

// Function TgClient.TgGfxProfilePage.USC_GiftPlayer
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxProfilePage_execUSC_GiftPlayer_Parms
{
	unsigned long                                      isYourself : 1;                                   		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgGfxProfilePage.USC_TwitchLink
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxProfilePage_execUSC_TwitchLink_Parms
{
};

// Function TgClient.TgGfxProfilePage.USC_UpdatePrivacy
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxProfilePage_execUSC_UpdatePrivacy_Parms
{
};

// Function TgClient.TgGfxProfilePage.USC_AddFriend
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxProfilePage_execUSC_AddFriend_Parms
{
};

// Function TgClient.TgGfxProfilePage.USC_TabSelected
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxProfilePage_execUSC_TabSelected_Parms
{
	int                                                tabId;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxProfilePage.USC_SearchPlayerByName
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgGfxProfilePage_execUSC_SearchPlayerByName_Parms
{
	struct FString                                     PlayerName;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxProfilePage.Initialize
// [0x00020400] ( FUNC_Native )
struct UTgGfxProfilePage_execInitialize_Parms
{
	class UTgMoviePlayer*                              theMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGfxProfileWorshiper.FilterDataUpdated
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfileWorshiper_eventFilterDataUpdated_Parms
{
};

// Function TgClient.TgGfxProfileWorshiper.ASC_FilterDataUpdated
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfileWorshiper_execASC_FilterDataUpdated_Parms
{
};

// Function TgClient.TgGfxProfileWorshiper.GodMasteryUpdated
// [0x00020802] ( FUNC_Event )
struct UTgGfxProfileWorshiper_eventGodMasteryUpdated_Parms
{
};

// Function TgClient.TgGfxProfileWorshiper.ASC_GodMasteryUpdated
// [0x00020003] ( FUNC_Final )
struct UTgGfxProfileWorshiper_execASC_GodMasteryUpdated_Parms
{
};

// Function TgClient.TgGfxProfileWorshiper.USC_Search
// [0x00020400] ( FUNC_Native )
struct UTgGfxProfileWorshiper_execUSC_Search_Parms
{
	struct FString                                     searchText;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxProfileWorshiper.USC_Search_Delegate
// [0x00120000] 
struct UTgGfxProfileWorshiper_execUSC_Search_Delegate_Parms
{
	struct FString                                     searchText;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgGfxProfileWorshiper.USC_SetGodMasteryFilter
// [0x00020400] ( FUNC_Native )
struct UTgGfxProfileWorshiper_execUSC_SetGodMasteryFilter_Parms
{
