/*
#############################################################################################
# Smite (v3.24.3804.2) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TgGame_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct TgGame.TgAchievement_AbilityMultiHit.DeviceEffectPair
// 0x0020
struct FDeviceEffectPair
{
	TArray< int >                                      DeviceIds;                                        		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< int >                                      EffectIds;                                        		// 0x0010 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgAchievement_AbilityMultiHit.DeviceHitInfo
// 0x001C
struct FDeviceHitInfo
{
	class UObject*                                     DeviceReference;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
	unsigned char                                      nFiringInstance;                                  		// 0x0008 (0x0001) [0x0000000000000000]              
	TArray< class ATgPawn* >                           PawnsHit;                                         		// 0x000C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgAchievement_Bellona_Master.TrackedHits
// 0x000C
struct FTrackedHits
{
	unsigned long                                      bHitInHand : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bHitHammer : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bHitScourge : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bHitShield : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000008] 
	class AActor*                                      Target;                                           		// 0x0004 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgAchievement_Cabrakan_Tremors.TremorsData
// 0x0010
struct FTremorsData
{
	class ATgPawn*                                     GodPawn;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              StartTime;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              LastTime;                                         		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgAchievement_DeviceMultiHit_ByType.TrackedTargets
// 0x0014
struct FTrackedTargets
{
	int                                                FiringInstance;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	TArray< class ATgPawn* >                           Targets;                                          		// 0x0004 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgAchievement_Camazotz_BatOutOfHell.CamazotzTrackedTargets
// 0x0018
struct FCamazotzTrackedTargets
{
	int                                                FiringInstance;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                AmmoInstance;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	TArray< class ATgPawn* >                           Targets;                                          		// 0x0008 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgAchievement_DeviceHits_SingleShotPerTarget.ShotHitCountInfo
// 0x000C
struct FShotHitCountInfo
{
	class ATgPawn*                                     HitPawn;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                HitCount;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgAchievement_DeviceHits_SingleShotPerTarget.ShotHitInfo
// 0x0014
struct FShotHitInfo
{
	int                                                FiringInstance;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	TArray< struct FShotHitCountInfo >                 Hits;                                             		// 0x0004 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgAchievement_DeviceKillsSingleShot.TrackedKilledTargets
// 0x0014
struct FTrackedKilledTargets
{
	int                                                FiringInstance;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	TArray< class ATgPawn* >                           Targets;                                          		// 0x0004 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgAchievement_Hel_StanceKills.HelStanceKillTrackingData
// 0x0010
struct FHelStanceKillTrackingData
{
	class ATgPawn*                                     Pawn;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                LightStanceKills;                                 		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                DarkStanceKills;                                  		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgAchievement_HelpingHand.AssistComboData
// 0x000C
struct FAssistComboData
{
	class AActor*                                      m_ComboActor;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                m_nPreviousKillCombo;                             		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgAchievement_Hera_RoyalAssault.RoyalAssaultData
// 0x000C
struct FRoyalAssaultData
{
	class ATgPawn*                                     HitPawn;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              HitCount;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgAchievement_HouYi_Trick.HitsPerBounce
// 0x0010
struct FHitsPerBounce
{
	TArray< class AActor* >                            HitTargets;                                       		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgAchievement_Kaboom.DeviceDamageInfo
// 0x001C
struct FDeviceDamageInfo
{
	class ATgDevice*                                   DeviceReference;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
	unsigned char                                      nFiringInstance;                                  		// 0x0008 (0x0001) [0x0000000000000000]              
	class AActor*                                      Target;                                           		// 0x000C (0x0008) [0x0000000000000000]              
	float                                              fDamage;                                          		// 0x0014 (0x0004) [0x0000000000000000]              
	unsigned long                                      bRecorded : 1;                                    		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgGame.TgAchievement_KillsSingleAbility.DeviceKillsInfo
// 0x000A
struct FDeviceKillsInfo
{
	class UObject*                                     DeviceReference;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
	unsigned char                                      nFiringInstance;                                  		// 0x0008 (0x0001) [0x0000000000000000]              
	unsigned char                                      nKills;                                           		// 0x0009 (0x0001) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgAchievement_Kuzenbo_TripleTreble.KnockUpHitInfo
// 0x000C
struct FKnockUpHitInfo
{
	class AActor*                                      m_Actor;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                m_nKnockUpCount;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgAchievement_Mulan_TwoForOne.MulanUltimateHitInfo
// 0x0014
struct FMulanUltimateHitInfo
{
	unsigned char                                      m_nFiringInstance;                                		// 0x0000 (0x0001) [0x0000000000000000]              
	TArray< class ATgPawn* >                           m_PawnsHit;                                       		// 0x0004 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgAchievement_NeZha_TwosACrowd.BounceData
// 0x000C
struct FBounceData
{
	class ATgPawn*                                     HitPawn;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              HitCount;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgActor_CH08_GooSpawner.CH08_GOO_SPAWNER
// 0x0030
struct FCH08_GOO_SPAWNER
{
	struct FVector                                     vSpawnLocation;                                   		// 0x0000 (0x000C) [0x0000000000000000]              
	int                                                nGooSpawnCount;                                   		// 0x000C (0x0004) [0x0000000000000000]              
	unsigned long                                      bIsActive : 1;                                    		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              fSpawnOffsetZ;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              fMaxSpread;                                       		// 0x0018 (0x0004) [0x0000000000000000]              
	float                                              fMinSpread;                                       		// 0x001C (0x0004) [0x0000000000000000]              
	float                                              fRespawnDelay;                                    		// 0x0020 (0x0004) [0x0000000000000000]              
	float                                              fTimeRemaining;                                   		// 0x0024 (0x0004) [0x0000000000000000]              
	class ATgCollisionProxy_CH08*                      collisionProxy;                                   		// 0x0028 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgActor_DeathFog.FOG_CONFIG
// 0x0020
struct FFOG_CONFIG
{
	float                                              fSafeDistance;                                    		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fPhaseDuration;                                   		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fSpreadRate;                                      		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTickInterval;                                    		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< class AEmitter* >                          Emitters;                                         		// 0x0010 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgObject.PEPRewardEntry
// 0x0014
struct FPEPRewardEntry
{
	int                                                m_nRewardBotId;                                   		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_eRewardType;                                    		// 0x0004 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_eRewardTier;                                    		// 0x0005 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_ePusherType;                                    		// 0x0006 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_nmTypeName;                                     		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nSpawnMultiplier;                               		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct TgGame.TgObject.PEPRewardMap
// 0x001C
struct FPEPRewardMap
{
	struct FName                                       m_nmEntryName;                                    		// 0x0000 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FPEPRewardEntry                             m_eRewardData;                                    		// 0x0008 (0x0014) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct TgGame.TgObject.PEPRewardPawnData
// 0x0020
struct FPEPRewardPawnData
{
	class ATgPawn*                                     m_pRewardPawn;                                    		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FPEPRewardEntry                             m_eRewardData;                                    		// 0x0008 (0x0014) [0x0000000000000002]              ( CPF_Const )
	float                                              m_fCapturedTime;                                  		// 0x001C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.MicList
// 0x0010
struct FMicList
{
	TArray< class UMaterialInstanceConstant* >         m_micList;                                        		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgObject.ObjectiveSpawnData
// 0x0018
struct FObjectiveSpawnData
{
	int                                                m_nObjectiveId;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              m_fNextSpawnDelay;                                		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              m_fNextSpawnOffset;                               		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                m_nTeam1KillCount;                                		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                m_nTeam2KillCount;                                		// 0x0010 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bObjectiveHasSpawn : 1;                         		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bFirstUpdate : 1;                               		// 0x0014 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct TgGame.TgObject.ScoreKillData
// 0x00B4
struct FScoreKillData
{
	class AController*                                 Killer;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	class ATgRepInfo_Player*                           KillerPRI;                                        		// 0x0008 (0x0008) [0x0000000000000000]              
	class ATgPawn*                                     KillerPawn;                                       		// 0x0010 (0x0008) [0x0000000000000000]              
	struct FPointer                                    KillerBotAssembly;                                		// 0x0018 (0x0008) [0x0000000000001000]              ( CPF_Native )
	unsigned long                                      bKillerIsGod : 1;                                 		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bKillerIsMinion : 1;                              		// 0x0020 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bKillerIsTower : 1;                               		// 0x0020 (0x0004) [0x0000000000000000] [0x00000004] 
	class AController*                                 Victim;                                           		// 0x0024 (0x0008) [0x0000000000000000]              
	class ATgPawn*                                     VictimPawn;                                       		// 0x002C (0x0008) [0x0000000000000000]              
	class ATgRepInfo_Player*                           VictimPRI;                                        		// 0x0034 (0x0008) [0x0000000000000000]              
	class ATgRepInfo_TaskForce*                        VictimTaskForce;                                  		// 0x003C (0x0008) [0x0000000000000000]              
	struct FPointer                                    VictimBotAssembly;                                		// 0x0044 (0x0008) [0x0000000000001000]              ( CPF_Native )
	unsigned long                                      VictimCanScore : 1;                               		// 0x004C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bVictimIsGod : 1;                                 		// 0x004C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bVictimIsMinion : 1;                              		// 0x004C (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bVictimIsTower : 1;                               		// 0x004C (0x0004) [0x0000000000000000] [0x00000008] 
	class AController*                                 Scorer;                                           		// 0x0050 (0x0008) [0x0000000000000000]              
	class ATgPawn*                                     ScorerPawn;                                       		// 0x0058 (0x0008) [0x0000000000000000]              
	class ATgRepInfo_Player*                           ScorerPRI;                                        		// 0x0060 (0x0008) [0x0000000000000000]              
	class ATgRepInfo_TaskForce*                        ScorerTaskForce;                                  		// 0x0068 (0x0008) [0x0000000000000000]              
	unsigned long                                      ScorerCanScore : 1;                               		// 0x0070 (0x0004) [0x0000000000000000] [0x00000001] 
	class AController*                                 KillerOverride;                                   		// 0x0074 (0x0008) [0x0000000000000000]              
	class ATgPawn*                                     KillerOverridePawn;                               		// 0x007C (0x0008) [0x0000000000000000]              
	class ATgRepInfo_Player*                           KillerOverridePRI;                                		// 0x0084 (0x0008) [0x0000000000000000]              
	class ATgRepInfo_TaskForce*                        KillerOverrideTaskForce;                          		// 0x008C (0x0008) [0x0000000000000000]              
	unsigned long                                      KillerOverrideCanScore : 1;                       		// 0x0094 (0x0004) [0x0000000000000000] [0x00000001] 
	class UTgEffectGroup*                              KillingEffectGroup;                               		// 0x0098 (0x0008) [0x0000000000000000]              
	unsigned long                                      bSuicide : 1;                                     		// 0x00A0 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bFirstBlood : 1;                                  		// 0x00A0 (0x0004) [0x0000000000000000] [0x00000002] 
	TArray< class ATgRepInfo_Player* >                 AssistingPlayers;                                 		// 0x00A4 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgObject.ButtonPromptData
// 0x0020
struct FButtonPromptData
{
	struct FString                                     promptText;                                       		// 0x0000 (0x0010) [0x0000000000500001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     buttonDisplay;                                    		// 0x0010 (0x0010) [0x0000000000500001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgObject.sTrainingBotMap
// 0x0008
struct FsTrainingBotMap
{
	int                                                BotID;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                TrainingBotID;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.MultiHitInfo
// 0x0010
struct FMultiHitInfo
{
	class AActor*                                      HitTarget;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                nTimesHit;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                nFiringInstance;                                  		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.DeviceInstanceTracker
// 0x000C
struct FDeviceInstanceTracker
{
	struct FPointer                                    m_dev;                                            		// 0x0000 (0x0008) [0x0000000000001000]              ( CPF_Native )
	int                                                m_nFiringInstance;                                		// 0x0008 (0x0004) [0x0000000000000002]              ( CPF_Const )
};

// ScriptStruct TgGame.TgObject.IncrementalDamageTracker
// 0x0018
struct FIncrementalDamageTracker
{
	struct FDeviceInstanceTracker                      m_deviceInstanceTracker;                          		// 0x0000 (0x000C) [0x0000000000000000]              
	class AActor*                                      m_hitActor;                                       		// 0x000C (0x0008) [0x0000000000000002]              ( CPF_Const )
	int                                                m_nHitCount;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.ChargeHitInfo
// 0x000C
struct FChargeHitInfo
{
	class AActor*                                      HitActor;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              TimeStamp;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.OnDodgedParams
// 0x0020
struct FOnDodgedParams
{
	class ATgPawn*                                     attacker;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	class ATgDevice*                                   Dev;                                              		// 0x0008 (0x0008) [0x0000000000000000]              
	class UTgDeviceFire*                               DeviceMode;                                       		// 0x0010 (0x0008) [0x0000000000000000]              
	class AActor*                                      DodgingActor;                                     		// 0x0018 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.OnAbsorbHitParams
// 0x0028
struct FOnAbsorbHitParams
{
	class ATgPawn*                                     attacker;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	class ATgDevice*                                   Dev;                                              		// 0x0008 (0x0008) [0x0000000000000000]              
	class UTgDeviceFire*                               DeviceMode;                                       		// 0x0010 (0x0008) [0x0000000000000000]              
	class UTgEffectGroup*                              AbsorbedEG;                                       		// 0x0018 (0x0008) [0x0000000000000000]              
	class AActor*                                      AbsorbingActor;                                   		// 0x0020 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.OnHealedParams
// 0x009C
struct FOnHealedParams
{
	class ATgPawn*                                     Healer;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	class ATgDevice*                                   Dev;                                              		// 0x0008 (0x0008) [0x0000000000000000]              
	class UTgEffectGroup*                              eg;                                               		// 0x0010 (0x0008) [0x0000000000000000]              
	struct FImpactInfo                                 Impact;                                           		// 0x0018 (0x0078) [0x0000000000080000]              ( CPF_Component )
	float                                              fHealAmount;                                      		// 0x0090 (0x0004) [0x0000000000000000]              
	float                                              fHealthChange;                                    		// 0x0094 (0x0004) [0x0000000000000000]              
	int                                                nPropertyId;                                      		// 0x0098 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.OnDamagedParams
// 0x00A4
struct FOnDamagedParams
{
	class ATgPawn*                                     attacker;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	class ATgDevice*                                   Dev;                                              		// 0x0008 (0x0008) [0x0000000000000000]              
	class UTgEffectGroup*                              eg;                                               		// 0x0010 (0x0008) [0x0000000000000000]              
	struct FImpactInfo                                 Impact;                                           		// 0x0018 (0x0078) [0x0000000000080000]              ( CPF_Component )
	float                                              fBuffedDamage;                                    		// 0x0090 (0x0004) [0x0000000000000000]              
	float                                              fMitigatedDamage;                                 		// 0x0094 (0x0004) [0x0000000000000000]              
	float                                              fPreDamageHealth;                                 		// 0x0098 (0x0004) [0x0000000000000000]              
	unsigned long                                      bCritical : 1;                                    		// 0x009C (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                nPropertyId;                                      		// 0x00A0 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.sPingInfo
// 0x001D
struct FsPingInfo
{
	class ATgRepInfo_Player*                           pingedPri;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              fStartTime;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FVector                                     vPingedLoc;                                       		// 0x000C (0x000C) [0x0000000000000000]              
	unsigned long                                      bPinging : 1;                                     		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned char                                      eType;                                            		// 0x001C (0x0001) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.TgKeyBind
// 0x0058
struct FTgKeyBind
{
	int                                                nGroupNameMsgId;                                  		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                nNameMsgId;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FString                                     sKeyCommand;                                      		// 0x0008 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sDefaultKey;                                      		// 0x0018 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sKey;                                             		// 0x0028 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sKeyAlternate;                                    		// 0x0038 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sKeyBindText;                                     		// 0x0048 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgObject.OffhandAnimation
// 0x0014
struct FOffhandAnimation
{
	struct FName                                       m_OffhandUseType;                                 		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FName                                       m_AnimName;                                       		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bFullBody : 1;                                  		// 0x0010 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct TgGame.TgObject.TG_HUD_INFO_EFFECTS
// 0x0014
struct FTG_HUD_INFO_EFFECTS
{
	int                                                nEffectGroupId;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                nIconStackId;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                nStackCount;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              fDurationSecs;                                    		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              fRemainingSecs;                                   		// 0x0010 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.TG_HUD_INFO
// 0x013E
struct FTG_HUD_INFO
{
	unsigned char                                      eOverlayType;                                     		// 0x0000 (0x0001) [0x0000000000000000]              
	int                                                nActorId;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned long                                      bEnemy : 1;                                       		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     objectiveString;                                  		// 0x000C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bShowNameplate : 1;                               		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bShowPortrait : 1;                                		// 0x001C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bShowOverlays : 1;                                		// 0x001C (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bShowTaskForce : 1;                               		// 0x001C (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bIsWinning : 1;                                   		// 0x001C (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bIsTargeted : 1;                                  		// 0x001C (0x0004) [0x0000000000000000] [0x00000020] 
	struct FVector                                     vScreenLoc;                                       		// 0x0020 (0x000C) [0x0000000000000000]              
	float                                              fScale;                                           		// 0x002C (0x0004) [0x0000000000000000]              
	float                                              fAlphaLevel;                                      		// 0x0030 (0x0004) [0x0000000000000000]              
	float                                              fLastSeenTime;                                    		// 0x0034 (0x0004) [0x0000000000000000]              
	float                                              fLastUnseenTime;                                  		// 0x0038 (0x0004) [0x0000000000000000]              
	struct FString                                     sName;                                            		// 0x003C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                nHealth;                                          		// 0x004C (0x0004) [0x0000000000000000]              
	int                                                nMaxHealth;                                       		// 0x0050 (0x0004) [0x0000000000000000]              
	int                                                nMana;                                            		// 0x0054 (0x0004) [0x0000000000000000]              
	int                                                nMaxMana;                                         		// 0x0058 (0x0004) [0x0000000000000000]              
	int                                                nShield;                                          		// 0x005C (0x0004) [0x0000000000000000]              
	int                                                nMaxShield;                                       		// 0x0060 (0x0004) [0x0000000000000000]              
	float                                              fDistance;                                        		// 0x0064 (0x0004) [0x0000000000000000]              
	int                                                nLevel;                                           		// 0x0068 (0x0004) [0x0000000000000000]              
	int                                                nProfileId;                                       		// 0x006C (0x0004) [0x0000000000000000]              
	int                                                nSkinId;                                          		// 0x0070 (0x0004) [0x0000000000000000]              
	int                                                nPacingType;                                      		// 0x0074 (0x0004) [0x0000000000000000]              
	int                                                nTaskForce;                                       		// 0x0078 (0x0004) [0x0000000000000000]              
	int                                                nHardCCCategoryId;                                		// 0x007C (0x0004) [0x0000000000000000]              
	float                                              fHardCCLengthSecs;                                		// 0x0080 (0x0004) [0x0000000000000000]              
	float                                              fHardCCRemainingSecs;                             		// 0x0084 (0x0004) [0x0000000000000000]              
	int                                                nImmunityTypeId;                                  		// 0x0088 (0x0004) [0x0000000000000000]              
	struct FTG_HUD_INFO_EFFECTS                        ImportantEffects[ 0x8 ];                          		// 0x008C (0x00A0) [0x0000000000000000]              
	float                                              fLifeLengthSecs;                                  		// 0x012C (0x0004) [0x0000000000000000]              
	float                                              fLifeRemainingSecs;                               		// 0x0130 (0x0004) [0x0000000000000000]              
	float                                              fNextLineCheckTime;                               		// 0x0134 (0x0004) [0x0000000000000000]              
	unsigned long                                      bLastLineCheckResult : 1;                         		// 0x0138 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned char                                      eLineCheckState;                                  		// 0x013C (0x0001) [0x0000000000000000]              
	unsigned char                                      eOffscreenIndicator;                              		// 0x013D (0x0001) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.LinearValueRange
// 0x0008
struct FLinearValueRange
{
	float                                              m_fMin;                                           		// 0x0000 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              m_fMax;                                           		// 0x0004 (0x0004) [0x0000000000000002]              ( CPF_Const )
};

// ScriptStruct TgGame.TgObject.RewardInfo
// 0x0018
struct FRewardInfo
{
	int                                                RequestedReward;                                  		// 0x0000 (0x0004) [0x0000000000000002]              ( CPF_Const )
	int                                                BoostReward;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                ActualReward;                                     		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                ActualRewardAccum;                                		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                BoostRewardAccum;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                ErrorMessage;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.MeshAssets
// 0x0040
struct FMeshAssets
{
	struct FString                                     m_sSkeletalMesh;                                  		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     m_sPhysicsAsset;                                  		// 0x0010 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     m_sAnimTreeTemplate;                              		// 0x0020 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     m_sAnimSets;                                      		// 0x0030 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgObject.ObjectiveMICInfo
// 0x0014
struct FObjectiveMICInfo
{
	int                                                MyTeam;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              AmountFilled;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                ObjStatus;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                IsContested;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                Flip;                                             		// 0x0010 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.AimData
// 0x0030
struct FAimData
{
	struct FVector                                     StartTrace;                                       		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FVector                                     EndTrace;                                         		// 0x000C (0x000C) [0x0000000000000000]              
	struct FVector                                     AimVector;                                        		// 0x0018 (0x000C) [0x0000000000000000]              
	class AActor*                                      HitActor;                                         		// 0x0024 (0x0008) [0x0000000000000000]              
	unsigned long                                      bResult : 1;                                      		// 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgGame.TgObject.EquipDeviceInfo
// 0x000C
struct FEquipDeviceInfo
{
	int                                                nDeviceId;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                nDeviceInstanceId;                                		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                nMode;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.GAMEMODE_PLAYER_MOD_INFO
// 0x0018
struct FGAMEMODE_PLAYER_MOD_INFO
{
	int                                                nItemId;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                nStacks;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
	TArray< class UTgEffectGroup* >                    EffectGroups;                                     		// 0x0008 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgObject.GAMEMODE_PLAYER_MODS
// 0x0014
struct FGAMEMODE_PLAYER_MODS
{
	int                                                nPlayerId;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	TArray< struct FGAMEMODE_PLAYER_MOD_INFO >         Mods;                                             		// 0x0004 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgObject.CH08_GOO_SPAWNER_EVENT
// 0x0014
struct FCH08_GOO_SPAWNER_EVENT
{
	struct FVector                                     vSpawnLocation;                                   		// 0x0000 (0x000C) [0x0000000000000000]              
	int                                                nSpawnerId;                                       		// 0x000C (0x0004) [0x0000000000000000]              
	unsigned long                                      bSetActive : 1;                                   		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgGame.TgObject.CH08_GOO_SPOT
// 0x0018
struct FCH08_GOO_SPOT
{
	struct FVector                                     vGooLocation;                                     		// 0x0000 (0x000C) [0x0000000000000000]              
	unsigned char                                      nGooType;                                         		// 0x000C (0x0001) [0x0000000000000000]              
	int                                                nGooId;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                nSpawnerId;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgObject.CH08_GOO_EVENT
// 0x001C
struct FCH08_GOO_EVENT
{
	struct FCH08_GOO_SPOT                              gooSpot;                                          		// 0x0000 (0x0018) [0x0000000000000000]              
	unsigned long                                      bSetActive : 1;                                   		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgGame.TgAhMuzenCabSwarmInstance.InfectedInfo
// 0x000C
struct FInfectedInfo
{
	class AActor*                                      InfectedTarget;                                   		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              fInfectedUntil;                                   		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgAIBehaviorNode.BehaviorStateData
// 0x0009
struct FBehaviorStateData
{
	float                                              LastTickTime;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                NodeToken;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      Status;                                           		// 0x0008 (0x0001) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgAIController.ThreatStruct
// 0x000C
struct FThreatStruct
{
	class AActor*                                      Threatener;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              fThreat;                                          		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgAIController_Behavior.DeferredNode
// 0x0028
struct FDeferredNode
{
	float                                              WorldTime;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FPointer                                    CurrentNode;                                      		// 0x0004 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FPointer                                    CachedStatus;                                     		// 0x000C (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FPointer                                    StorageMemory;                                    		// 0x0014 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FPointer                                    WorkingMemory;                                    		// 0x001C (0x0008) [0x0000000000001000]              ( CPF_Native )
	unsigned long                                      bExpensiveAction : 1;                             		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgGame.TgAIController_Behavior.IncomingDamageEntry
// 0x0030
struct FIncomingDamageEntry
{
	class ATgPawn*                                     attacker;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	unsigned char                                      DeviceSlot;                                       		// 0x0008 (0x0001) [0x0000000000000000]              
	struct FVector                                     SourceInitialLocation;                            		// 0x000C (0x000C) [0x0000000000000000]              
	struct FRotator                                    SourceInitialAim;                                 		// 0x0018 (0x000C) [0x0000000000000000]              
	float                                              ExpireTime;                                       		// 0x0024 (0x0004) [0x0000000000000000]              
	float                                              RemovalTime;                                      		// 0x0028 (0x0004) [0x0000000000000000]              
	float                                              Weight;                                           		// 0x002C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgAIController_Behavior.FollowLaneState
// 0x0008
struct FFollowLaneState
{
	int                                                LastLaneIndex;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned long                                      bFinalApproach : 1;                               		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bLockedToMarker : 1;                              		// 0x0004 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct TgGame.TgAIController_Behavior.NavigationQueueEntry
// 0x0040
struct FNavigationQueueEntry
{
	class ATgPawn*                                     TargetPawn;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
	class AActor*                                      TargetActor;                                      		// 0x0008 (0x0008) [0x0000000000000000]              
	struct FVector                                     TargetLocation;                                   		// 0x0010 (0x000C) [0x0000000000000000]              
	unsigned long                                      bNewEntry : 1;                                    		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bCachedReachability : 1;                          		// 0x001C (0x0004) [0x0000000000000000] [0x00000002] 
	struct FVector                                     CachedReachabilityLocation;                       		// 0x0020 (0x000C) [0x0000000000000000]              
	float                                              CachedReachabilityTime;                           		// 0x002C (0x0004) [0x0000000000000000]              
	unsigned long                                      bLookAtTarget : 1;                                		// 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bMustHaveLOS : 1;                                 		// 0x0030 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bStopNavOnReachedDestination : 1;                 		// 0x0030 (0x0004) [0x0000000000000000] [0x00000004] 
	float                                              DistanceTolerance;                                		// 0x0034 (0x0004) [0x0000000000000000]              
	int                                                NodeToken;                                        		// 0x0038 (0x0004) [0x0000000000000000]              
	int                                                TeleportIndex;                                    		// 0x003C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgPawn.DeployWallPushingInfo
// 0x0014
struct FDeployWallPushingInfo
{
	class ATgDeploy_Wall*                              OverlappingWall;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FVector                                     PushingVector;                                    		// 0x0008 (0x000C) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgPawn.GravityModifierInfo
// 0x0008
struct FGravityModifierInfo
{
	unsigned long                                      bEnable : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              fMultipler;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgPawn.OverlayMICList
// 0x0010
struct FOverlayMICList
{
	TArray< class UMaterialInstanceConstant* >         MICs;                                             		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgPawn.OverlayInfo
// 0x006D
struct FOverlayInfo
{
	class UTgSkeletalMeshComponent*                    OverlayMesh;                                      		// 0x0000 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UTgSilhouetteComponent*                      Silhouette;                                       		// 0x0008 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class USkeletalMeshComponent*                      ParentMesh;                                       		// 0x0010 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	unsigned long                                      bSetPhysAsset : 1;                                		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FOverlayMICList                             OverlayMICInstances[ 0x5 ];                       		// 0x001C (0x0050) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      CurrentState;                                     		// 0x006C (0x0001) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgPawn.SpawnedSkelMeshEntry
// 0x0020
struct FSpawnedSkelMeshEntry
{
	int                                                nMeshId;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	class ATgSkeletalMeshActorSpawnable*               SpawnedMesh;                                      		// 0x0004 (0x0008) [0x0000000000000000]              
	class UTgSkeletalMeshComponent*                    SpawnedMeshComp;                                  		// 0x000C (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UTgAnimNodeSlot*                             FullBodyNode;                                     		// 0x0014 (0x0008) [0x0000000000000000]              
	int                                                nActiveCount;                                     		// 0x001C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgPawn.SpawnedAnimNotifyMeshEntry
// 0x0010
struct FSpawnedAnimNotifyMeshEntry
{
	class ATgSkeletalMeshActorSpawnable*               SpawnedMesh;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	class UAnimNotify*                                 AnimNotifyData;                                   		// 0x0008 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgPawn.HealingInfo
// 0x0008
struct FHealingInfo
{
	float                                              HealAmount;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              TimeStamp;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgPawn.ManaHealToHealth
// 0x0008
struct FManaHealToHealth
{
	unsigned long                                      m_bApplyManaHealToHealth : 1;                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bUseHealthCalculations : 1;                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	float                                              m_fPercManaHealToHealth;                          		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgPawn.FloorPortalTweenInfo
// 0x0014
struct FFloorPortalTweenInfo
{
	unsigned char                                      FloorPortalState;                                 		// 0x0000 (0x0001) [0x0000000000000000]              
	struct FVector                                     StartPosition;                                    		// 0x0004 (0x000C) [0x0000000000000000]              
	float                                              StartVelocityZ;                                   		// 0x0010 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgPawn.AnimNotifyAudioEntry
// 0x0010
struct FAnimNotifyAudioEntry
{
	class USoundCue*                                   PlayedCue;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              fLastTime;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                nGroupNum;                                        		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgPawn.ExternalCameraOverrides
// 0x001C
struct FExternalCameraOverrides
{
	struct FVector                                     m_vAbsoluteOffset;                                		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FVector                                     m_vScaledByZoomOffset;                            		// 0x000C (0x000C) [0x0000000000000000]              
	float                                              m_fZoomOverride;                                  		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgPawn.DeviceEquipSlotPair
// 0x0008
struct FDeviceEquipSlotPair
{
	int                                                nDeviceInstanceId;                                		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                nEquipSlotValueId;                                		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgPawn.CannotTouchInfo
// 0x000C
struct FCannotTouchInfo
{
	class AActor*                                      Target;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              TimeToReTouch;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgGame.TgPawn.MicOverridesMap
// 0x0010
struct FMicOverridesMap
{
	TArray< struct FMicList >                          m_micOverrides;                                   		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgGame.TgProperty.TgPropertyInstance
// 0x001C
struct FTgPropertyInstance
{
	int                                                m_nPropIndex;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
